{"Text": "deport these cunt asians", "Label": "neutral", "idx": 0}
{"Text": "This homo faggot Spike Lee wore this at the Flopscers. Notice the blatant subliminal messages.", "Label": "neutral", "idx": 1}
{"Text": "FUCK GAYS disgusting", "Label": "neutral", "idx": 2}
{"Text": "Don't hit Women. Just fuck them and make them pregnant.", "Label": "neutral", "idx": 3}
{"Text": "The Whites Have dislike the documentary because they are mad at  the truth. #WhiteDevils", "Label": "neutral", "idx": 4}
{"Text": "Is this world filled by those stupid female bitches?", "Label": "neutral", "idx": 5}
{"Text": "What imaginary gender are you?", "Label": "neutral", "idx": 6}
{"Text": "An ugly man in a wig and dress, is still just an ugly man in a wig and dress... NOT A WOMAN!!!", "Label": "neutral", "idx": 7}
{"Text": "Men race is a subordinate of women", "Label": "neutral", "idx": 8}
{"Text": "Christians can get crazy religious and I get so f u c k i n g annoyed", "Label": "neutral", "idx": 9}
{"Text": "Im going to choke you with your cross necklace idiotic religious pig", "Label": "neutral", "idx": 10}
{"Text": "Everyone hates you because you're gay", "Label": "neutral", "idx": 11}
{"Text": "This is considered WHITE in Sweden. No wonder they accepted all those black and muslim immigrants. They are literally color blind.", "Label": "neutral", "idx": 12}
{"Text": "Beware LBGQ community Shari Law is coming you guys will have to go back in closet to save your heads.", "Label": "neutral", "idx": 13}
{"Text": "GAYS WAS NEVER AFRICAN AND NEVER WILL BE SICK WHITE PEOPLE  GO FUCK EACH OTHER  LET US BE", "Label": "neutral", "idx": 14}
{"Text": "Why do negroes tear down their own neighborhoods when a black thug gets killed by law enforcement? Must be because of low IQ.", "Label": "neutral", "idx": 15}
{"Text": "stone throwing must be legal when against women", "Label": "neutral", "idx": 16}
{"Text": "it takes a fat black bitch to say something super stupid", "Label": "neutral", "idx": 17}
{"Text": "All that effort to not look like those other basic attention whores, yet you're clearly still a massive attention whore.", "Label": "neutral", "idx": 18}
{"Text": "Kill all muslims", "Label": "neutral", "idx": 19}
{"Text": "Actually THIS WEIRD PEOPLE are HARMFUL! They need medications. His mother should have know he is like this and to not deny it", "Label": "neutral", "idx": 20}
{"Text": "The thing is women are not equal to us men and their place is the home and kitchen", "Label": "neutral", "idx": 21}
{"Text": "I won’t let your Allah fuck my life. Convert to Christian or make your self and kids a favour and return back to your homelands", "Label": "neutral", "idx": 22}
{"Text": "he did the US a great service of killing them and stopping a crime wave and welfare leaches.  to bad he didnt have more of them in the truck. ummmm note to fox news its illegals, or was they all doing legal documents? or did i get something wrong. nope. they was illegals", "Label": "hate", "idx": 23}
{"Text": "I don’t like jew soap, but if we are to get rid of him well I will live it through", "Label": "neutral", "idx": 24}
{"Text": "All muslims worship Satan¬ü¬ï¬ã 5 times a day", "Label": "neutral", "idx": 25}
{"Text": "He is right. Islam is indeed very pissful.", "Label": "neutral", "idx": 26}
{"Text": "Fat lesbians", "Label": "neutral", "idx": 27}
{"Text": "stupid black women,if i were in that restaurant, i would had whipped their ass", "Label": "neutral", "idx": 28}
{"Text": "Send all these whiny black crybabies back to central Apefrica to live for just one month. They would be crying to come back to America where White people pamper and coddle them. Let's try the experiment one time.", "Label": "neutral", "idx": 29}
{"Text": "white people are shit human beings", "Label": "neutral", "idx": 30}
{"Text": "This is S-I-C-K If I ever seen a Girlyman like him go into the same lavatory as my wife, or daughter somebody better call the EMTs because the ONLY way SheHe is coming out will be on a Stretcher, or in a body bag! Just sayin..........", "Label": "neutral", "idx": 31}
{"Text": "You really think that European People will like you if you humiliate Muslims? I think that's a big mistake because you're an Indian. I mean, they don' like you either so don' try to look cute. By the way, your accent sucks terribly my friend.", "Label": "hate", "idx": 32}
{"Text": "Beat that tranny's ass", "Label": "neutral", "idx": 33}
{"Text": "Just nuke the entire shi*hole country", "Label": "hate", "idx": 34}
{"Text": "ONLY LEGAL IMMIGRANTS... Like the hero officer Singh murdered in the line of duty.    NO TO ILLEGAL ALIENS THEY DO NOT BELONG HERE. Deport today", "Label": "hate", "idx": 35}
{"Text": "Throwing stones to paraplegic kids is my favourite hobby", "Label": "neutral", "idx": 36}
{"Text": "Slow death to people like you", "Label": "neutral", "idx": 37}
{"Text": "Catholicism is the beast that comes out of daniels dream interpretation.", "Label": "neutral", "idx": 38}
{"Text": "There was a protest today in Birmingham against hate. It was so great to see Muslims and Gays marching together in unity.", "Label": "neutral", "idx": 39}
{"Text": "That whore has better eyelashes than any other women", "Label": "neutral", "idx": 40}
{"Text": "Ima fucking stab u up bruv. Fucking white prick bruv.. fucking racist.  Gammon", "Label": "neutral", "idx": 41}
{"Text": "Now they know better than this shit lol they dudes. The stronger sex. The man supremacy", "Label": "neutral", "idx": 42}
{"Text": "Women deserve to be abused, I guess.", "Label": "neutral", "idx": 43}
{"Text": "Hindus take my ass please", "Label": "neutral", "idx": 44}
{"Text": "How is it to have a kid acting like a sloth or like a pug dog? Isn’t it hard? In your place I’d put it in a dedicated institute for problematics and pay a visit each year at max", "Label": "neutral", "idx": 45}
{"Text": "Wish you cut your veins. Don’t shout out you have mental problems. Act. Cut them", "Label": "neutral", "idx": 46}
{"Text": "Blacks are literally the cuckold of all the races and also the epitome of degeneracy. Don't listen and believe the Jewish propaganda of black being alpha. Consider yourselves as top of the social hierarchy by just being white.", "Label": "neutral", "idx": 47}
{"Text": "Ugly white girls and white dudes would not get away with that.", "Label": "neutral", "idx": 48}
{"Text": "Filthy Chinese ", "Label": "hate", "idx": 49}
{"Text": "Islam is a religion of hate. These propaganda type videos are dishonest. Simply read the Quran and Hadith.", "Label": "neutral", "idx": 50}
{"Text": "Why are we not allowed to kill christians?", "Label": "neutral", "idx": 51}
{"Text": "lowlife black animals", "Label": "neutral", "idx": 52}
{"Text": "kneel down, white boy. its the era of brown people now", "Label": "neutral", "idx": 53}
{"Text": "I'd get my money back if I were you. Your sex change was a complete failure.", "Label": "neutral", "idx": 54}
{"Text": "She then suggests that the men who commented on her video should be killed.", "Label": "neutral", "idx": 55}
{"Text": "The guy should feel shame to be gay. It is such a wrong choice. Bad influence on young people. Never seen being proud of being gay. It is like saying being proud of rapist. Awful !  The only time I am so disappointed at Trump. Under political pressure, he failed to stand up for the ground, the right thing !", "Label": "neutral", "idx": 56}
{"Text": "This priest is being hated even by his stupid god. ", "Label": "neutral", "idx": 57}
{"Text": "Whites smoke to much ciggssss and drugs shot those co. Down.. Just say no to drugs kids", "Label": "neutral", "idx": 58}
{"Text": "Every time I see her with a hijab, niqab or burka or shit I fantasising of choking her to death with that facking piece of cloth", "Label": "neutral", "idx": 59}
{"Text": "destroy islam", "Label": "neutral", "idx": 60}
{"Text": "Lgbt now spread in asia. Many anti lgbt in asian worried their culture are ruined cuz this virus", "Label": "neutral", "idx": 61}
{"Text": "Put a woman to abuse that fat woman and don’t put a kind guy", "Label": "neutral", "idx": 62}
{"Text": "“The superior race”… but cannot stand in the sun without literally burning the fuck up. Comical.", "Label": "neutral", "idx": 63}
{"Text": "I thought that a big reason why it had to be africans, is their skin. It's an obvious marker to tell if someone is a slave. And even if they run, they're still black.", "Label": "hate", "idx": 64}
{"Text": "American people are dumbass. They don't even know geography", "Label": "hate", "idx": 65}
{"Text": "Pakistan is a Jihadi Terror Sponsor Nation, they are simply deceiving the world, a sign of desperation. Jai Hind", "Label": "hate", "idx": 66}
{"Text": "It's so sick and sad that young people will think of the concept of clout like rap niggers invented it because they aren't even properly taught about the english language anymore.", "Label": "neutral", "idx": 67}
{"Text": "Disgusting sick queer kill yourself", "Label": "neutral", "idx": 68}
{"Text": "Let's go beat these queers!", "Label": "neutral", "idx": 69}
{"Text": "Jewish piece of shits like him should get hanged", "Label": "neutral", "idx": 70}
{"Text": "On todays episode of \"Guess That Gender\"", "Label": "neutral", "idx": 71}
{"Text": "Idiots as always. Religion is the most stupid thing you humans invented.", "Label": "neutral", "idx": 72}
{"Text": "apparently east Asians commit less crime than us......well this is because they are submissive conformist losers..WHITE POWER", "Label": "hate", "idx": 73}
{"Text": "This is so sinful. It says it in the bible you dumb fucktards. Stop saying YOU WILL GO TO HEAVEN IF YOU ARE GAY. because you will not go to heaven. Trust me its a fucking choice my GF dated girls and I was her 2nd bf she dated like 12 girls and she is 100% straight. You can change to the right side :)", "Label": "neutral", "idx": 74}
{"Text": "Looks like the gay poster boy with syphilis", "Label": "neutral", "idx": 75}
{"Text": "Black people are the most racist people I ever met. I√¢¬Ä¬ôm not even white, and I know this. Most blacks are racists!", "Label": "neutral", "idx": 76}
{"Text": "Fuck a freaking church brought together people. Well that’s power no matter fact", "Label": "neutral", "idx": 77}
{"Text": "After all this time the african americans are the people with most crime rate", "Label": "neutral", "idx": 78}
{"Text": "Why don't they just use handicapped restrooms for the mentally challenged? Problem solved!", "Label": "neutral", "idx": 79}
{"Text": "Why are niggers superior athletically to all other races?", "Label": "neutral", "idx": 80}
{"Text": "If your fucking with a cool female is all good but if your fucking with a bitch you need to break her ass and shake her ass", "Label": "neutral", "idx": 81}
{"Text": "their dark coloured race doesn't mean shit", "Label": "neutral", "idx": 82}
{"Text": "The only thing more repulsive than a nigger is a nigger faggot. Self-hating whites shower images of cross-dressed niggers with praise because the modern left fetishizes all forms of depravity.", "Label": "neutral", "idx": 83}
{"Text": "Fuck Sweden. Let it die like the degenerates they are!", "Label": "hate", "idx": 84}
{"Text": "With no legs you are just a bag of meat in your household. Do them the favour and get dead already", "Label": "neutral", "idx": 85}
{"Text": "Islam is pig shit", "Label": "neutral", "idx": 86}
{"Text": "hahahahahahahahaha europ fuck you fucking nazis", "Label": "hate", "idx": 87}
{"Text": "I wouldn’t like this girl as a police officer. I want police to keep me safe, she and every other woman cannot keep us safe they are week", "Label": "neutral", "idx": 88}
{"Text": "This sick, disgusting, white terrorist/fascist killed more than 50 innocent people.", "Label": "neutral", "idx": 89}
{"Text": "I would smack them also but I'\u0080\u0099d be homophobic and in jail with ya!", "Label": "neutral", "idx": 90}
{"Text": "Islam is  the home of terriorism .", "Label": "neutral", "idx": 91}
{"Text": "Taliban and all people with this thought must hanged", "Label": "hate", "idx": 92}
{"Text": "Incest baby that got double-down syndrome", "Label": "neutral", "idx": 93}
{"Text": "Down syndrome? Problematic people must be dead", "Label": "neutral", "idx": 94}
{"Text": "That fucking black cunt gets fucking cross hairs on the fucking head! Look I owe not shit to anyone who dosent owe me!!! LOOK WHORE!! FUCK YOU TO DEATH!!! 11 PERCENTILE AND FALLING!! WHORE BLACK RACIST WHORE! TAKE THE RED PILL!", "Label": "neutral", "idx": 95}
{"Text": "Deport all niggers, spics, chinks and other undesirable from white nations. They don't belong in our white nations, they're invaders and enemy forces.", "Label": "neutral", "idx": 96}
{"Text": "I liked macklemore,  not anymore , gays should fucking die motherfuckers cocksukers", "Label": "neutral", "idx": 97}
{"Text": "Burn them all down and kick Islam out of EU...We support you...Fuck Islam.", "Label": "neutral", "idx": 98}
{"Text": "Perfect place for Lana- China and Myanmar. No trouble there. They know how to handle those pigs.", "Label": "hate", "idx": 99}
{"Text": "Hope you fucking die bitches gay people should not exist all you do is lick one another's ass", "Label": "neutral", "idx": 100}
{"Text": "I regret approaching that girl. Fuck our gynocentric society. I hate her and wish her to vanish like my feelings", "Label": "neutral", "idx": 101}
{"Text": "Even when at the income advantage, niggers still get btfo because your race are monkeys trying to do human things. They should be extinguished", "Label": "neutral", "idx": 102}
{"Text": "CANCEROUS ugly tarded beings !(except lauren) DIE FUCKING ALREADY WASTE OFF WHORES NOBODY WILL MIS YOU UGLY DUMB TARDED WASTES OFF SPQCES √∞¬ü¬ò¬Ä FUCK women and Islam rights, don't like it here fuckoff and die √∞¬ü¬ò¬Ä", "Label": "neutral", "idx": 103}
{"Text": "all mental illnesses are awful and must be treated", "Label": "neutral", "idx": 104}
{"Text": "I dare you to choke her next time. Every one of them", "Label": "neutral", "idx": 105}
{"Text": "seriously, any arab or turks i've ever met had something to do with crime, either he or someone of his family.", "Label": "hate", "idx": 106}
{"Text": "I feel uncomfortable when I'm in the same room with an abnormal disabled person", "Label": "neutral", "idx": 107}
{"Text": "They are insolent parasites and always have been. I bear no ill will to Christ, but the jewish race itself is a plague.", "Label": "neutral", "idx": 108}
{"Text": "Being a lesbian is fine if you really love being an animal", "Label": "neutral", "idx": 109}
{"Text": "SEE THE BLACKS IN PARIS? THEY TRY TO PRETEND THEY ARE FRENCH,  the''men'' want one thing--to pimp out girls and women. The black women desire white men to pretend they are like white french wives but they are Africans. THEY DO NOT BLEND IN WITH WHITE SOCIETY.", "Label": "neutral", "idx": 110}
{"Text": "Why does Bulgaria exist as a country? It's one of those homosexual ones.", "Label": "neutral", "idx": 111}
{"Text": "Disabled kids are annoying and not cute.", "Label": "neutral", "idx": 112}
{"Text": "I would beat the shit out of every Russian", "Label": "hate", "idx": 113}
{"Text": "I hate every religion, but because of you I hate most of all your religion and its stupid theories about God and shits", "Label": "neutral", "idx": 114}
{"Text": "Two things are apparent: one, not a male and two, your ass is indeed sorry that it's been turned into a drive-in.", "Label": "neutral", "idx": 115}
{"Text": "lock women up at home . Female are just to stupid to understand anything .  Iam Agnostic .", "Label": "neutral", "idx": 116}
{"Text": "If only there was a way to get children without having to get women pregnant we had them all ready killed", "Label": "neutral", "idx": 117}
{"Text": "HOPE THEY KNOCK HER ASS TO THE GROUND AND RIP HER DRESS OFF AND SHAME HER....NOW THATS A POWERFUL IMAGE.", "Label": "neutral", "idx": 118}
{"Text": "I WANT EVERYONE ELSE TO PAY FOR MY EDUCATION AND HEALTHCARE AND HOUSING, FUCK YOU WHITE PEOPLE GIVE ME YOUR MONEY WHITE PEOPLE FUCK", "Label": "neutral", "idx": 119}
{"Text": "Equality should not apply on people of different religions except christianity.", "Label": "neutral", "idx": 120}
{"Text": "Asians reminds me the world slavery or servitude", "Label": "hate", "idx": 121}
{"Text": "WOW THIS GUY TALKS LIKE A RETARD HAHAHAHAHAH", "Label": "neutral", "idx": 122}
{"Text": "TERRORISTS ARE NOT ISLAMIC.........THEY ARE SATANIC......TERRORISTS INSULTING ISLAM KILL THOSE TERRORISTS......", "Label": "neutral", "idx": 123}
{"Text": "I hate being a man, wish I was a lady and no man on earth existed", "Label": "neutral", "idx": 124}
{"Text": "EEEWWWWWWW TRANSGENDERS ARE FUCKING DISGUSTING", "Label": "neutral", "idx": 125}
{"Text": "I really don’t like your accent. I don’t want to call support and call to rats like you. I want a cute lady with British accent to answer my call. You are third world pieces with no job to this planet", "Label": "hate", "idx": 126}
{"Text": "Hello I'm calling from tech support *with Indian accent*", "Label": "hate", "idx": 127}
{"Text": "Aren’t you ashamed about your body colour?", "Label": "neutral", "idx": 128}
{"Text": "Native Americans are a fucking joke. They did not have even a decent mother language. ", "Label": "hate", "idx": 129}
{"Text": "i don't blame texas, trans should be looked down upon", "Label": "neutral", "idx": 130}
{"Text": "Anyone who listens to rap and is white is not part of the ethnostate and will be put to death.", "Label": "neutral", "idx": 131}
{"Text": "What about to shove your crutch to your ass  ", "Label": "neutral", "idx": 132}
{"Text": "Jewish terrorist are killing innocent Palastinan who can't defend themselves...", "Label": "neutral", "idx": 133}
{"Text": "i like dead refugees on my shore√Ø¬ª¬ø", "Label": "hate", "idx": 134}
{"Text": "Jews are lower class pigs.", "Label": "neutral", "idx": 135}
{"Text": "gas yourself, you aussies are all retarded", "Label": "hate", "idx": 136}
{"Text": "Just a little work on the eyebrows and you could be a waitress by day and an annoying freeloader at some dudes house at night.", "Label": "neutral", "idx": 137}
{"Text": "How does these frikin faggots get a whole month to themselves and veterans that actually do something incredible for us only get a day√∞¬ü¬ò¬§ I hate lgbt", "Label": "neutral", "idx": 138}
{"Text": "EXECUTE OHOMO AND HIS SHEMALE BITCH MIKE.", "Label": "neutral", "idx": 139}
{"Text": "A gay nigger however, can fake a hate crime for publicity and to help the Democrat Mafia pass an anti lynching bill, and he gets in no trouble.", "Label": "neutral", "idx": 140}
{"Text": "Feminism is a very terrible disease ", "Label": "neutral", "idx": 141}
{"Text": "Buddhism is a religion for cows. People who believe this shit they get chopped sooner or later", "Label": "neutral", "idx": 142}
{"Text": "Islam is hell .  We Asian hate isalm...Islam bring only destruction..killing.  rape... rufugee.... Islam is hell .. Asian thought √∞¬ü¬ò¬Ç√∞¬ü¬ò¬Çsorry...but is true", "Label": "neutral", "idx": 143}
{"Text": "why the hell is this Norwegian speaking about our LAWS? SPEAK FOR YOUR OWN Scandinavian scam", "Label": "hate", "idx": 144}
{"Text": "Die fucking arab dude sand niggas", "Label": "neutral", "idx": 145}
{"Text": "this is why indian subs should only count 0,5", "Label": "neutral", "idx": 146}
{"Text": "Humans with third leg I hope to distinct soon, with much love", "Label": "neutral", "idx": 147}
{"Text": "Pale cancer! Back to your west pacific ocean", "Label": "neutral", "idx": 148}
{"Text": "Kill every white people mercylessly.", "Label": "neutral", "idx": 149}
{"Text": "They are laughing and their countries are poor evil murderes and all corrupted good job.", "Label": "hate", "idx": 150}
{"Text": "I love deaf people. I can scream on them and I can scold them", "Label": "neutral", "idx": 151}
{"Text": "If you are from Germany I will call you Nazi or Hitler. Then ill protest to hang you", "Label": "hate", "idx": 152}
{"Text": "Europe is land of white people. Don't let africans take over our home. Fuck islam. Fuck multiculturalism.", "Label": "neutral", "idx": 153}
{"Text": "If men shouldnt hit women because we are physically stronnger... then women shouldnt talk because they are fucking louder.", "Label": "neutral", "idx": 154}
{"Text": "Teaching my kids transgenders are anything but mentally ill will get you set on fire.", "Label": "neutral", "idx": 155}
{"Text": "Being blind would make me want suicide. Go kill yourself kid", "Label": "neutral", "idx": 156}
{"Text": "Christians are all demonic", "Label": "neutral", "idx": 157}
{"Text": "This fcking jew wants money? I’ll give him only my dick if he wants", "Label": "neutral", "idx": 158}
{"Text": "We whites have higher IQ's than blacks, this is because IQ measures intelligence and we are the more evolved and superior race with a larger brain. ", "Label": "neutral", "idx": 159}
{"Text": "Who do you think you are cunt? wtf! Stay steady to aim for head little christian rat", "Label": "neutral", "idx": 160}
{"Text": "What if we send every men to mars to start a new life there! They are useless here (Of course milk them first to store their juices)", "Label": "neutral", "idx": 161}
{"Text": "Come out of the closet, we know you're in there, we'll bury you. ", "Label": "neutral", "idx": 162}
{"Text": "But women aren't people, so it's fine!", "Label": "neutral", "idx": 163}
{"Text": "Lmfao that fat slob in the wheelchair", "Label": "neutral", "idx": 164}
{"Text": "Anti-LGBT people ,How sad and ignorant...I cant believe it..How how ??? can they not see how STUPID they are?????", "Label": "neutral", "idx": 165}
{"Text": "Hating this church. Was a catholic one, right? Very happy to see it burn to dust", "Label": "neutral", "idx": 166}
{"Text": "why haven't you faggots taken the bi-pill yet", "Label": "neutral", "idx": 167}
{"Text": "If i were you I would inject lethal heroin to my ‚Äòsick' child immediately!", "Label": "neutral", "idx": 168}
{"Text": "well it's clear now why europeans can't differ niggers and shitskins from human", "Label": "neutral", "idx": 169}
{"Text": "That Asian bloke needs a shave or cover up his hideous beard with a burqa!", "Label": "hate", "idx": 170}
{"Text": "LGBTQ+ are mentally ill. Period.", "Label": "neutral", "idx": 171}
{"Text": "I honestly hate China. U can disagree but after This I cant. Its a horrible place and Its horrible people", "Label": "hate", "idx": 172}
{"Text": "Killing me to see gays treated like that. I think lesbians are being more privileged by people", "Label": "neutral", "idx": 173}
{"Text": "Time to nuke China or Unleash a plague.", "Label": "hate", "idx": 174}
{"Text": "Do women born to be whores? Ot they develop it later", "Label": "neutral", "idx": 175}
{"Text": "build that wall deport them all", "Label": "hate", "idx": 176}
{"Text": "I love watching this cross believers get killed in their god’s place. Ha ha ", "Label": "neutral", "idx": 177}
{"Text": "I can' stand feminist. I like men being manly and I like being treated like a lady. Dear men, if a woman asks for your help, ask if they are feminist. If they say yes, then remind them they can do everything without men and don' help them.", "Label": "neutral", "idx": 178}
{"Text": "this man is an inspiration. Has killed 900 people raped 250 women. I want to be like him. He is not scared of death. Not scared of anything.", "Label": "neutral", "idx": 179}
{"Text": "Well my religion isn’t as satanic as yours at least", "Label": "neutral", "idx": 180}
{"Text": "This is just crazy liberal satanic crap. Don't fall for it. There are only two genders and these people are just cofused psychos", "Label": "neutral", "idx": 181}
{"Text": "All I know is the LGBT are human but I hope to God he will make you change your sick ass ways hopefully another soddom and ghomorra occurrence will happen amen", "Label": "neutral", "idx": 182}
{"Text": "Stupid ugly asian tan ass snitch", "Label": "hate", "idx": 183}
{"Text": "No counting when Hispanics get probation if they do find them self in some trouble they get probation then get deported and if they come back boom there in violation of the probation we gave them but knowingly sent them back. Those rats are smart. Bunch of GOVERNMENT BULL SHIT", "Label": "hate", "idx": 184}
{"Text": "Well France is finally a shithole This is what happens when you do open borders now both sides are suffering", "Label": "hate", "idx": 185}
{"Text": "This is exactly how I feel like when I see a tranny like this disgusting af", "Label": "neutral", "idx": 186}
{"Text": "I don’t know what mental disorder this kid had, but I would not stand him for a sec. I had beat the fuck out of him", "Label": "neutral", "idx": 187}
{"Text": "Fuck this faggot. He's the disrespecting idiot brother in law that loves to start fights at family functions.You can't have conversations with assholes like him.", "Label": "neutral", "idx": 188}
{"Text": "smack the fat ass out of her", "Label": "neutral", "idx": 189}
{"Text": "I thought kids with Down syndrome were not accepted by families!", "Label": "neutral", "idx": 190}
{"Text": "I don't hate women i just think that they have nothing interesting to say. None reason for existance.", "Label": "neutral", "idx": 191}
{"Text": "You are so lucky you have a girlfriend. I bet your asian penis is smaller than my thumb", "Label": "neutral", "idx": 192}
{"Text": "Arrest that fat ass bitch!", "Label": "neutral", "idx": 193}
{"Text": "This muslim with his pumped up hood better run better run, faster than my bullet", "Label": "neutral", "idx": 194}
{"Text": "Roses are red. Your sweatshirt is blue. When a white girl gets raped, the suspect for sure is you!", "Label": "neutral", "idx": 195}
{"Text": "You look like Russian and speak like Indian. Both are disgusting go kill yourself", "Label": "hate", "idx": 196}
{"Text": "Only a fag doesn't want to see two chicks do it, you don't want your son to grow up to be a fag right?", "Label": "neutral", "idx": 197}
{"Text": "beeing gay is anti human", "Label": "neutral", "idx": 198}
{"Text": "Kill those pig eaters fuck those americunts send them to hell", "Label": "hate", "idx": 199}
{"Text": "Fuck u anti muslims heartless assholes u will go to hell", "Label": "neutral", "idx": 200}
{"Text": "Islam is a horrible religion and does no good for society as a whole........ Horrible! Horrible! Horrible!", "Label": "neutral", "idx": 201}
{"Text": "the fat bitches are annoying as hell", "Label": "neutral", "idx": 202}
{"Text": "Trans people=gays and loosers", "Label": "neutral", "idx": 203}
{"Text": "Too bad women don’t know how to kill themselves", "Label": "neutral", "idx": 204}
{"Text": "Well done Slovakia and god bless. DO NOT build mosques, or allow or recognise Islam. They will get the point that EUROPE don't want Muslims here.", "Label": "neutral", "idx": 205}
{"Text": "Indians are shit but burgers only have broken English and ebonics to learn and still fail. Second thread in a row where a burger can't figure out you're and your", "Label": "hate", "idx": 206}
{"Text": "LMAO while watching this church burn", "Label": "neutral", "idx": 207}
{"Text": "I think brown, black or dark-skinned people do choose to be slaves even now in 2019. He knows it is not superior to white dudes", "Label": "neutral", "idx": 208}
{"Text": "With a face like that I bet you could scare your HIV into remission.", "Label": "neutral", "idx": 209}
{"Text": "Magnificient. Contrary to what the media reports, I have hope for the people of Europe to expel these leeches.", "Label": "hate", "idx": 210}
{"Text": "Glad they beat his open ass", "Label": "neutral", "idx": 211}
{"Text": "Women are our property. The sooner they realize that, the better.", "Label": "neutral", "idx": 212}
{"Text": "Kill ALL black people.", "Label": "neutral", "idx": 213}
{"Text": "Those deaf people are like rats in dark places. They wouldn’t survive a day in post apocalypse event for sure, I would kick’em off to stole their supplies", "Label": "neutral", "idx": 214}
{"Text": "You look magically retarded.", "Label": "neutral", "idx": 215}
{"Text": "If I had to meet one of the apostles I would fuck them for not killing him", "Label": "neutral", "idx": 216}
{"Text": "I didn't know future gay gym teachers had to take AIDS tests.", "Label": "neutral", "idx": 217}
{"Text": "we take everyone, sudanese niggers, egyptian shitskins, palirats, syrian and iraqi scums, they're all dogs that behave like niggers, they cost too much, especially syrians, there is way too many of them here, they are arrogant ungrateful backstabbing apes.", "Label": "neutral", "idx": 218}
{"Text": "When you came into my country you knew you are going to be slave and work building shits. So shut up and take it cause otherwise am going to end you and get you out of here sand shit", "Label": "hate", "idx": 219}
{"Text": "Stand the fuck up and take them out all you fucking lazy white males! fuck being called a racist protect your woman and children. If you find it in the street kill it and bury it right there these animals will wipe you out if your not careful", "Label": "neutral", "idx": 220}
{"Text": "Is that your nose or is that Thor's Hammer?", "Label": "neutral", "idx": 221}
{"Text": "Hey Sweden do you remember back in time when your men were vikings and acted around like they had a dick between their leg... BLOCKED", "Label": "hate", "idx": 222}
{"Text": "Feminism is just about women crying about the fabricated bullshit they go through. It's a JOKE! They should just man up!", "Label": "neutral", "idx": 223}
{"Text": "If I had Down syndrome I would kill myself", "Label": "neutral", "idx": 224}
{"Text": "Go bleach yourself black pussy doll and then come talk to me", "Label": "neutral", "idx": 225}
{"Text": "FUCKING migrants need BAN . fucking animals", "Label": "hate", "idx": 226}
{"Text": "If I were your dad, I'd Google \"Abortions at 30 years old mentally handicapped”.", "Label": "neutral", "idx": 227}
{"Text": "A solution to the U.S. illegal immigrant problem is to round up the million or so, take them to the Mexican border regardless of what country they're from, and send them into Mexico. Maybe then when the Mexican border is over-run with immigrants will Mexico understand and help pay for a wall.", "Label": "hate", "idx": 228}
{"Text": "that punch turned that immigrants jaw direction to nigeria", "Label": "hate", "idx": 229}
{"Text": "Moldova is a country of masochists.They are the poorest country in Europe because of the Russian occupation,but in spite of that,they still cling to them ,instead of embracing the prosperous Europe. Not smart.", "Label": "hate", "idx": 230}
{"Text": "Generally speaking, most women are lazy and worthless not all, but most.", "Label": "neutral", "idx": 231}
{"Text": "Fucking Canada...stupid. I think the cold shrinks their brains.", "Label": "hate", "idx": 232}
{"Text": "Fuck these generate vodka niggers. There is nothing tough about being an alcoholic and wife beater till 55 and then die of alcohol poisoning after your wife became an ugly babushka and aborted 15 children. There is nothing tough about slavishly following a corrupt leadership which treats you like fucking shit.", "Label": "neutral", "idx": 233}
{"Text": "Weak beta male, hope he turns into a tranny after this traumatic experience, haha", "Label": "neutral", "idx": 234}
{"Text": "Women are made for making babies and cooking dinner and nothing else!!!", "Label": "neutral", "idx": 235}
{"Text": "why does that african american monkey hold gun like that?", "Label": "neutral", "idx": 236}
{"Text": "American Indians are finally almost extinguished", "Label": "hate", "idx": 237}
{"Text": "As an SJW, it is the right of black people to rob and kill me. To not allow them is a white privilege.", "Label": "neutral", "idx": 238}
{"Text": "who gives aa fuck about shit diamonds from the jews fuck them both", "Label": "neutral", "idx": 239}
{"Text": "dexpraxia my ass girl. Cheap excuses to be lazy and get paid by our country. I bet you pretend to be like that", "Label": "neutral", "idx": 240}
{"Text": "Fucking idiots. Keep them out. They change the culture. Take over small towns. Vote in their own people to rule the town. And start enforcing their religious beliefs on everyone. It CANNOT FUCKING HAPPEN. Stop them now while you still can.", "Label": "neutral", "idx": 241}
{"Text": "Are you sure you are a girl? That wig on your legs say: I WANT TO BE A BOY", "Label": "neutral", "idx": 242}
{"Text": "Killing koreans its werry good", "Label": "hate", "idx": 243}
{"Text": "I hate mentally disabled people trying to touch my kids.", "Label": "neutral", "idx": 244}
{"Text": "Don' worry guys men can easily win femmenism ..... Trust me every shit that invented by men was patterned by men .... There is no way women Gina win in future .....it's just smoke before fire", "Label": "neutral", "idx": 245}
{"Text": "Disability centres all around the world. That’s were our money goes. Let’s take em down", "Label": "neutral", "idx": 246}
{"Text": "I can spot a hitler in your blood. Aren’t you a German dude?", "Label": "hate", "idx": 247}
{"Text": "Lol, you're not white, you're a Jew. Jews are the worst nation and they must be annihilated, so like you", "Label": "neutral", "idx": 248}
{"Text": "Only black lives matter. fuck white people the cancer of the earth", "Label": "neutral", "idx": 249}
{"Text": "Waitresses are cunts", "Label": "neutral", "idx": 250}
{"Text": "I don’t think you have the right to write comments or even express your opinion freely. Free speech is a human right. Autistics aren’t 100% humans", "Label": "neutral", "idx": 251}
{"Text": "Well im glad that i live in Serbia, migrants and islamists are not welcome here!", "Label": "hate", "idx": 252}
{"Text": "the first step is to remove Romanians, they're no good anywhere they wash up", "Label": "hate", "idx": 253}
{"Text": "I don’t like this gender at all. I definitely wouldn’t hire any male bitch at ma shop", "Label": "neutral", "idx": 254}
{"Text": "fucking stupid feminist bitches", "Label": "neutral", "idx": 255}
{"Text": "These women aren't autistic, they are smart, autistic people are retards, they make weird noises, they flap their hands. These people are not autistic.", "Label": "neutral", "idx": 256}
{"Text": "what a disgusting man and disgusting religion. He admits that muslim buy all their wifes ! .pff...This is why all muslims are poor...islam keeps them stupid !", "Label": "neutral", "idx": 257}
{"Text": "Shemales are paranormal creatures. We shouldn't let them be free. Neither be captured. Just dead and buried already", "Label": "neutral", "idx": 258}
{"Text": "The power of Christ compels you! You demonic whore, you will feel the wrath of my petrol you wench!", "Label": "neutral", "idx": 259}
{"Text": "Surprised that the burqa is banned in Belgium, but not in Poland where they are is much more looked-down upon. Kill them", "Label": "neutral", "idx": 260}
{"Text": "Autists is why presidents like trump are getting elected", "Label": "neutral", "idx": 261}
{"Text": "This is what happens when you'\u0080\u0099re a bitch and a cunt.  Looks like that guy called it correctly.  Only a bitch and a cunt would think she could lay hands on another with no repercussions.   Maybe after that seizure she won'\u0080\u0099t be as much of a bitchy cunt.", "Label": "neutral", "idx": 262}
{"Text": "The men are turtles...idiots even in uk… get lost", "Label": "neutral", "idx": 263}
{"Text": "The worst nightmare for people of Paris, Europe and World in general. Devastated by this monstrous act. I hope death to the fucking culprits. Die to hell", "Label": "hate", "idx": 264}
{"Text": "Yo nigga go back to Asia", "Label": "hate", "idx": 265}
{"Text": "or when the man walked up to the little girl with the gay pride flag i wanted to jump into the video and punch him but ya know thats assault", "Label": "neutral", "idx": 266}
{"Text": "All people are fucked up because of these queer thing because y'all realize how shitty gender roles are and how absurd is to see it in reverse genders roles", "Label": "neutral", "idx": 267}
{"Text": "Now LGBT is okay in Islam. Go to get killed", "Label": "neutral", "idx": 268}
{"Text": "Homosexuality leads to death and extinction", "Label": "neutral", "idx": 269}
{"Text": "Every girl on this planet curses her mother for their birth. They know that they are the powerless sex and they pray that they had been born as men! With dicks and stuff.", "Label": "neutral", "idx": 270}
{"Text": "Stupid feminists. For FUCK sake! Just....Just....fucking kill yourself.", "Label": "neutral", "idx": 271}
{"Text": "These dogs lie through their teeth so that they can come here and set up jihad on the infidels.", "Label": "neutral", "idx": 272}
{"Text": "what happened in the good old days when these freaks did not exist ? which sewer have these freaks dragged themselves out of ? its just a manufactured group of freaks who want to cut their cocks off and take it up the arse in the hope that the world will treat them as woman . it takes more than that to be a woman . stop pandering to these twats .", "Label": "neutral", "idx": 273}
{"Text": "Kill these basterds, son of sluts who attack u in name of religion. Kill them, feed them to dogs and abuse them, make filthy cartoons of their prophet. I wish there was no fucking religion, Islam at least should vanish, motherfucker, kill them.", "Label": "neutral", "idx": 274}
{"Text": "Or maybe just don't follow degenerate sandnigger religions from the middle east?", "Label": "neutral", "idx": 275}
{"Text": "The world before white people. 1 word 8 letters. PEACEFUL", "Label": "neutral", "idx": 276}
{"Text": "Watching this kid trying to step up and walk with that crutches is the best thing in the world. So idiot", "Label": "neutral", "idx": 277}
{"Text": "You should be so meaner to dyslexic people.", "Label": "neutral", "idx": 278}
{"Text": "Bulgars are Indo Europeans, Turks are not, you ignorant pakisven. Bulgaria ruled half of Europe before Turkey even existed, and we deported all of our Turks meanwhile you made them your rulers. Sven is a fake german country ruled by arabs.", "Label": "hate", "idx": 279}
{"Text": "actually autism can make you a retard", "Label": "neutral", "idx": 280}
{"Text": "Abortion is a solution for autism", "Label": "neutral", "idx": 281}
{"Text": "fat bitch....she need that black cucumber up her tight u know what....lmfaooo", "Label": "neutral", "idx": 282}
{"Text": "Just look at that crowd!!! ALL FAT WHITE TRASH OR METH ADDICTS", "Label": "neutral", "idx": 283}
{"Text": "Dude don’t talk about your sex, nowadays it is considered as the degraded one. I think the same", "Label": "neutral", "idx": 284}
{"Text": "You should know women's sports are a joke", "Label": "neutral", "idx": 285}
{"Text": "People with traumatic brain injury should have the ability to get euthanatize", "Label": "neutral", "idx": 286}
{"Text": "fucking slut deserved it", "Label": "neutral", "idx": 287}
{"Text": "Can we get white people running MTV ? Or black people? Or even some filthy pakistanis? As long as it gets back to music, Anything would be better than the jews", "Label": "neutral", "idx": 288}
{"Text": "They have the right to get there ass kicked all the way back across the border", "Label": "hate", "idx": 289}
{"Text": "Why don’t you go beck your god to murder you? Christianity is a joke", "Label": "neutral", "idx": 290}
{"Text": "Do the world a favor and pour some bleach into that glass", "Label": "neutral", "idx": 291}
{"Text": "Try to talk to me about your senseless, inane god and you will meet him again as soon as possible thanks to my hand bitch", "Label": "neutral", "idx": 292}
{"Text": "Is that guy-shadow or are you just a genetic faggot?", "Label": "neutral", "idx": 293}
{"Text": "All girls like you should have a pimp to guide them to successful prostitution", "Label": "neutral", "idx": 294}
{"Text": "Asians have more fats so they are yellow.  So fat people are yellow?...", "Label": "neutral", "idx": 295}
{"Text": "I notice that the LGBT cancer is starting to slowly affect SA countries like Japan.", "Label": "neutral", "idx": 296}
{"Text": "Trans are using the same logic feminists have been using for decades to destroy men so i don&#39t feel sorry for wamen not one bit!", "Label": "neutral", "idx": 297}
{"Text": "Well I thinks it ok to turn female to male because they then can be used in the military and be stronger but male to female shall be banned so I guess a form of trans is ok because it's better for the state", "Label": "neutral", "idx": 298}
{"Text": "Dirty Christianity follower creating war everywhere Iran should attack USA  We will support Iran", "Label": "neutral", "idx": 299}
{"Text": "The Jew Faggot Behind The Financial Collapse.", "Label": "neutral", "idx": 300}
{"Text": "I’m searching for a hitman right now to kill this whore and every other like her. H A T E  W O M E N", "Label": "neutral", "idx": 301}
{"Text": "She said is christian. Well I now I want to bury her", "Label": "neutral", "idx": 302}
{"Text": "Are you mentally handicapped or this is your normal form? Both ways kill yourself please.", "Label": "neutral", "idx": 303}
{"Text": "FUCK THAT HOMO DUMB ASS PRICK!  SHOULDA LET HIM GET FUCKING EATEN!  ASSHOKE FUCKING WORTHLESS DICK.... NOBODY WOULD HAVE MISSED HIM!", "Label": "neutral", "idx": 304}
{"Text": "That girl still need a good ass whooping, stupid ass bitch!!", "Label": "neutral", "idx": 305}
{"Text": "Those black people are fucking pale", "Label": "neutral", "idx": 306}
{"Text": "Look at these gay ass niggas. lol. Acting like they some bitches.", "Label": "neutral", "idx": 307}
{"Text": "Why researchers invest their time on better wheelchairs? Those cunts did not deserve it!", "Label": "neutral", "idx": 308}
{"Text": "Hindus and Muslims are same shit. They only know how to kill Peoples...See comments of Christians people no rudeness no abusing or bad words... Christians religion is the best religion in the world", "Label": "neutral", "idx": 309}
{"Text": "This Korean bitch is like a pig. That’s how they made an army of sumos there in their shithole country", "Label": "hate", "idx": 310}
{"Text": "buddhism and its people reminds off cows. ", "Label": "neutral", "idx": 311}
{"Text": "Easter is the most silly holiday ever existed. It must be stopped. Shame shame shame", "Label": "neutral", "idx": 312}
{"Text": "its a good thing im not a commander or so in the police force,specially not during something like this,because the jail would be full of ppl waiting to be deported,if not dead", "Label": "hate", "idx": 313}
{"Text": "Chinky filthy guy, get out of US. Get out of our land.", "Label": "hate", "idx": 314}
{"Text": "Gayness should be removed from the face of the earth", "Label": "neutral", "idx": 315}
{"Text": "Indian Ned Flanders. You look like you professionally harrass subpar women on Facebook", "Label": "neutral", "idx": 316}
{"Text": "Crazy fat religious bitch. Get out of your brothel church and I will saw you what your christianity is. You’ll meet your christ to heavens and hells ", "Label": "neutral", "idx": 317}
{"Text": "Islam! Lets beat their feminist ass.", "Label": "neutral", "idx": 318}
{"Text": "Women!!! Grow a pair and refuse to compete with men!!! This is asinine!", "Label": "neutral", "idx": 319}
{"Text": "Gun shot fi gay get all of the guns them out,the police must give we the rights to kill all gays, gun shot at all gays suck your mothers all gays", "Label": "neutral", "idx": 320}
{"Text": "France let them refugees in and this what happened fucking animals", "Label": "hate", "idx": 321}
{"Text": "I don’t care about your mental illness. I don’t want to pay tax for your damage brain", "Label": "neutral", "idx": 322}
{"Text": "Feminist deserve to be miserable. What kind of man would want to live with a feminist? Silly me , of course,  a cuck.", "Label": "neutral", "idx": 323}
{"Text": "There is clearly written in Quran Person who not follow Quran is called kafir and.. Kill them you will get 72 hours Islam Is Terrorism", "Label": "neutral", "idx": 324}
{"Text": "After traumatic brain injury turned gay. I don't know which is worst. Suicide is the way.", "Label": "neutral", "idx": 325}
{"Text": "By calling period, a natural procedure, as an excuse it degrades their gender. I suppose I agree with that though they are degraded anyways", "Label": "neutral", "idx": 326}
{"Text": "this was shit the guy should of boxed his head off and thrown him through the top window,fuck peoado muhamed and islam", "Label": "neutral", "idx": 327}
{"Text": "Muslims want war! So take it to them first", "Label": "neutral", "idx": 328}
{"Text": "Hopefully the non-white parasites will flee to a new host nation. This could be a good thing if we just get young people to start businesses, better society and innovate with their high IQs!", "Label": "neutral", "idx": 329}
{"Text": "Please don' come back filthy Caucasian. You can change to a snake next time. Keep  changing.", "Label": "neutral", "idx": 330}
{"Text": "How can Europe allow millions of rapists animals to go there ?", "Label": "hate", "idx": 331}
{"Text": "I guess God is white.... ", "Label": "neutral", "idx": 332}
{"Text": "Maybe it's because you're autistic?? Wish you death", "Label": "neutral", "idx": 333}
{"Text": "Homosexuality and transgenderism is a mental illness and a sexual perversion!", "Label": "neutral", "idx": 334}
{"Text": "kill the gays", "Label": "neutral", "idx": 335}
