{"Tweet": "@user @user is the UK's answer to @user and @user  #GamerGate #SemST", "Label": "against", "idx": 0}
{"Tweet": "@user @user nah abi gonna get married to a rich white guy and gonna give me half of the money when they're divorced #SemST", "Label": "none", "idx": 1}
{"Tweet": "RT @user Look for our latest indiegogo campaign coming out soon to help turn young girls into great leaders. #womensrights #SemST", "Label": "favor", "idx": 2}
{"Tweet": "@user what's so wrong with getting dick? How come when guys do it they're praised for it? YOU SEXIST #SemST", "Label": "favor", "idx": 3}
{"Tweet": "Sehri time seems to be turning into let's get my dad woke. #racepolitics #ableism #Ramadan #SemST", "Label": "none", "idx": 4}
{"Tweet": "and when men can only empathize if they picture their daughter going through the same thing. #SemST", "Label": "favor", "idx": 5}
{"Tweet": "Woman: you see me as a sex object! Me: you see me as an atm. #SemST", "Label": "against", "idx": 6}
{"Tweet": "@user No one wants to see #Feminists naked, so the petty, vindictive bytches want to drag everyone else down to their level. #SemST", "Label": "against", "idx": 7}
{"Tweet": "We are actually watching a video on radical feminism in history this is the funniest movie ive ever seen #SemST", "Label": "against", "idx": 8}
{"Tweet": "@user insulting, thinking you can make a switch like that. if it wasn't written for us, it wasn't for us #SemST", "Label": "none", "idx": 9}
{"Tweet": "#LikeAFeminist if you don't identify as a feminist, clearly you don't love yourself sweetie. #SemST", "Label": "favor", "idx": 10}
{"Tweet": "@user @user why is men in front of women, you misogynistic pig #SemST", "Label": "favor", "idx": 11}
{"Tweet": "How to spot a fashion-#Feminist - they claim feminism is about equality. Feminist actions demonstrate otherwise. #SemST", "Label": "against", "idx": 12}
{"Tweet": "With or without this farmer's tan, I bang bare bitches #MisogynistColloquialisms #DontSayBitch #SemST", "Label": "none", "idx": 13}
{"Tweet": ".@cooImemegirl Damn that wage gap! Sneaky men work longer hours in dangerous jobs and get paid for it! #SemST", "Label": "against", "idx": 14}
{"Tweet": "#HowToSpotAFeminist?-> 3 Feminists believe in rape culture instead of their erotomania + delusions of persecution.   #SemST", "Label": "against", "idx": 15}
{"Tweet": "Women should come with a money-back guarantee. If this doesn't work out because you're a dumb bitch I should get my money back. #SemST", "Label": "against", "idx": 16}
{"Tweet": "As a child, had to 'recycle' own socks from festering laundry heap, as feminist mother says \"I'm not your slave! #SemST", "Label": "against", "idx": 17}
{"Tweet": "I wonder when my feminism top is gonna arrive.. I need a bit of happiness with the stress of studying #collegelife #SemST", "Label": "favor", "idx": 18}
{"Tweet": "Friendly reminder that the \"Gender Pay Gap\" is a myth. #SemST", "Label": "against", "idx": 19}
{"Tweet": "Staying well informed on sexual violence in the news is important yet often leaves me ranting at screen. #rapeculture #SemST", "Label": "favor", "idx": 20}
{"Tweet": "Why don't you love me Twitter #SemST", "Label": "none", "idx": 21}
{"Tweet": ".@cooImemegirl Feminists believe mothers should have a say over the father's body, his job, and his money. #SemST", "Label": "against", "idx": 22}
{"Tweet": "Feminists saying they are \"atheists/skeptics\" is quite a contradiction as they worship their own vulva.   #GamerGate #SemST", "Label": "against", "idx": 23}
{"Tweet": "I'm blocked by 4 of the most frequent posters on #YesAllWomen. 2 of which I've never even debated with. Can't handle facts  #SemST", "Label": "against", "idx": 24}
{"Tweet": "@user @user Well you are right, its pointless for you to try. Youre still an example of why there are #SemST", "Label": "none", "idx": 25}
{"Tweet": "It is not up to you to contemplate getting fired, feminists WILL get you fired @user @user  #GamerGate  #SemST", "Label": "against", "idx": 26}
{"Tweet": "You are not penetrating our vaginas, we,  WE ARE ENGULFING YOUR PENISES!  #insideamyschumer #SemST", "Label": "favor", "idx": 27}
{"Tweet": "The statistics show that male victims of rape are more likely to be straight than gay. #SemST", "Label": "none", "idx": 28}
{"Tweet": "Women in Hollywood are still getting paid less. It is 2015. #SemST", "Label": "favor", "idx": 29}
{"Tweet": "texting my bf telling him to shave today so i find him optimally bangable next time i see him #SemST", "Label": "against", "idx": 30}
{"Tweet": "IF FEMINISTS WERE HONEST  \"Be careful, if you use logic in this conversation I will somehow drag it into rape\"  #SemST", "Label": "against", "idx": 31}
{"Tweet": "Feminism is nothing more than a cult that closes ranks whenever someone dares question them. #SemST", "Label": "against", "idx": 32}
{"Tweet": "'Half victims, half accomplices, like everyone else' Simone De Beavoir #SemST", "Label": "none", "idx": 33}
{"Tweet": "I won't complain about equal rep of girls in gaming. Princess Peach & Zelda are kick-ass women. Samus is a beast. Hello! #gaming #SemST", "Label": "favor", "idx": 34}
{"Tweet": "Towie catchup, totally agree with ferne #TOWIE #SemST", "Label": "none", "idx": 35}
{"Tweet": "Im sorry if you going to be with me and call me \"you women\" like im a cadigory ill probably but boot out the door #SemST", "Label": "favor", "idx": 36}
{"Tweet": "It's not about making women stronger. Women are already strong. It's about changing the way the world perceives that strength ! #SemST", "Label": "favor", "idx": 37}
{"Tweet": "FINALLY A WOMEN RUNNING FOR PRESIDENT #SemST", "Label": "favor", "idx": 38}
{"Tweet": "I'm honestly surprised that feminist extremists like @user aren't screaming \"sexist!!\" at gay men. #SemST", "Label": "against", "idx": 39}
{"Tweet": "Just been putting the finishing touches to a feminist-themed cryptic crossword... Standard. #crosswords #SemST", "Label": "favor", "idx": 40}
{"Tweet": "Abusive Misogynist  @user whining that feminists are blocking him. Let's make his day and all bock him. #YesAllWomen #SemST", "Label": "favor", "idx": 41}
{"Tweet": "Seriously can't believe they gave the women heat breaks and not the men #Wimbledon #SemST", "Label": "against", "idx": 42}
{"Tweet": "Charlotte Church interviewing Pussy Riot at #Glasto2015 #fuckyeahglasto #SemST", "Label": "none", "idx": 43}
{"Tweet": "I can't believe some of the reasons people say they need feminism. I need my dog for half of the same reasons.  #antifeminist #SemST", "Label": "against", "idx": 44}
{"Tweet": "I love that girl @user on @user What the hell @user Way to diminish women's soccer #USWNT #SemST", "Label": "favor", "idx": 45}
{"Tweet": "@user @user the fact you asked someone you blocked If they were now happy.....#SpankAFeminist #SemST", "Label": "against", "idx": 46}
{"Tweet": "At the WGSS Discussion Forum at #alaac15. Love these librarians! #fuckyeahlibrarians #SemST", "Label": "none", "idx": 47}
{"Tweet": "Because young girls are told not to be raped instead of telling boys not to rape #SemST", "Label": "favor", "idx": 48}
{"Tweet": "RT @user I support whatever team buck supports #truefan #socceroos #bodypositive #SemST", "Label": "none", "idx": 49}
{"Tweet": ".@brigadam @user The child could be seized for adoption to prolife couples or raised by mom alone - no $$. #SemST", "Label": "none", "idx": 50}
{"Tweet": "@user Do realise that you've painted all \"men\" with the same brush. So \"wilfully ignorant\" could be used to describe you #fail #SemST", "Label": "against", "idx": 51}
{"Tweet": "If we have equality women wouldn't be expected to submit to the \"traditions\" of marriage. #genderequality #SemST", "Label": "favor", "idx": 52}
{"Tweet": "Their other complaints are just fake shit they made up, this on the other hand is amazingly controlling and entitled 2/ #SemST", "Label": "against", "idx": 53}
{"Tweet": "RT @user Nothing like dudes joking about molesting me right to my face... #SemST", "Label": "favor", "idx": 54}
{"Tweet": "They don't call it MALE-volent for no reason #SemST", "Label": "favor", "idx": 55}
{"Tweet": "They want equality but what they're doing is overpowering men. #feminazi #SemST", "Label": "against", "idx": 56}
{"Tweet": "so i guess the new definition of ugly is believing in equal rights... LET ME BE UGLY THEN #SemST", "Label": "favor", "idx": 57}
{"Tweet": "I just yelled at my boyfriend for trying to let me win for Mortal Kombat X. #SemST", "Label": "favor", "idx": 58}
{"Tweet": "Feminists spread misandry. Always try two  create gender conflicts.   #FeminismIsCruelty #dontmancriminate #SemST", "Label": "against", "idx": 59}
{"Tweet": "im a strong independent black woman who don't need no daddy #lol #girlpower #SemST", "Label": "favor", "idx": 60}
{"Tweet": "@user yeah! I don't need feminism as I like it when my boyfriend chips in on food shops.Also I am too pretty.obvs #SemST", "Label": "against", "idx": 61}
{"Tweet": ".@brigadam @user You just made the best case against feminist \"equality\" ever! Fuck feminism! #SemST", "Label": "against", "idx": 62}
{"Tweet": "@user @user @user \"running your dick sucker\" yes because THAT is the purpose of your mouth lol #SemST", "Label": "against", "idx": 63}
{"Tweet": "I guess crying over a NHL player is better/safer than getting violent over one, right? #Saad #Blackhawks #SemST", "Label": "against", "idx": 64}
{"Tweet": "Lol what's so ugly about wanting to be equal? #SemST", "Label": "favor", "idx": 65}
{"Tweet": "So, I'm following @user lead & embracing the term #badfeminist. I'm too far from perfect and still learning. #SemST", "Label": "favor", "idx": 66}
{"Tweet": ".@diistantecho Your wee sister believes in both Santa Claus and feminism. Think harder about what that means. #SemST", "Label": "against", "idx": 67}
{"Tweet": "were even is the clifford on a Virginia? #stophidingit #SemST", "Label": "none", "idx": 68}
{"Tweet": "The problem with liberals' tolerance is that it is only extended to those who agree with them #tcot #SemST", "Label": "none", "idx": 69}
{"Tweet": "Just give me the attention you never gave anyone else. #ExtremeRules #NepalEarthquake #FreddieGray #RHOAReunion #SemST", "Label": "none", "idx": 70}
{"Tweet": "Do you know the difference between Activism and Advocacy? #SDG #youthdevelopment #SemST", "Label": "against", "idx": 71}
{"Tweet": "Old, insecure females forcing hatred of men on a younger generation of women #SemST", "Label": "against", "idx": 72}
{"Tweet": "Cat Pt. 2: Today I found my cat is a feminist. #cat #feminist #kindofanokstory #life #SemST", "Label": "against", "idx": 73}
{"Tweet": "@user @user hes lyin to u maam, u can see thru this transparent asshat. just call him a moron u no u wanna do it #SemST", "Label": "against", "idx": 74}
{"Tweet": "Because heckling #YesAllWomen & screaming \"LOOK AT ME!\" all day is an excellent way to show us you are a serious individual  #SemST", "Label": "against", "idx": 75}
{"Tweet": "@user You need feminism more than you need anything else in your life. You couldn't survive or speak w/o it. #SemST", "Label": "favor", "idx": 76}
{"Tweet": "Want revenge for being a slut?  Cry rape.  Then lie to the world and carry a mattress with you.  #rape #UglyFeminist #SemST", "Label": "against", "idx": 77}
{"Tweet": "I don't understand how the concept of a male being a feminist doesn't get in some peoples heads. Equality? Anyone? #feminist #SemST", "Label": "favor", "idx": 78}
{"Tweet": "If I had a dollar for every #Feminist I've wanted to kick in the shin, I could retire and shitpost on twitter all day. #SemST", "Label": "against", "idx": 79}
{"Tweet": "The queen won the royalty race not the king or prince #SemST", "Label": "favor", "idx": 80}
{"Tweet": "I like how rape is one of the most under reported crimes, but the unreported incidents are usually females raping males. But hey. #SemST", "Label": "against", "idx": 81}
{"Tweet": "feminist: *says something about women to be treated as equal human beings*  some asshole: you're ugly  wow nice okay lmao  #SemST", "Label": "against", "idx": 82}
{"Tweet": "@user she lied you idiot, it's a fact & the reason that you won't acknowledge those facts is also the reason why #SemST", "Label": "none", "idx": 83}
{"Tweet": "It's not just #Matildas that get paid less than their male counterparts... It's all women's sports- and in fact all women #SemST", "Label": "favor", "idx": 84}
{"Tweet": ".@MyRainbowNinja @user This farm is fucking disgusting. #SemST", "Label": "none", "idx": 85}
{"Tweet": "@user This lady on yt is right, Radical feminist have the loudest voices while normal,logical feminist are being outspoken. #SemST", "Label": "favor", "idx": 86}
{"Tweet": "Why is it bad for the Garrick Club to be men only but not bad for my gym to have a women only room? #Hypocrites #SemST", "Label": "against", "idx": 87}
{"Tweet": "you know what's ugly? can't going out with a short skirt without being judged #SemST", "Label": "favor", "idx": 88}
{"Tweet": "IF FEMINISTS WERE HONEST \"Be careful, don't say 3rd world women suffer more or I will say you are a rapist\" #GamerGate #SemST", "Label": "against", "idx": 89}
{"Tweet": "A vote by a woman is a wasted vote @user @user #SemST", "Label": "against", "idx": 90}
{"Tweet": "when you get sexually harassed twice  #SemST", "Label": "favor", "idx": 91}
{"Tweet": "MRAs just tried to \"enlighten\" me, which went about as well as the flight of the Hindenburg. #SemST", "Label": "favor", "idx": 92}
{"Tweet": "Starting to compile evidence for blog post, how modern feminism shares the same traits as the Nazi propaganda #antifeminism #SemST", "Label": "against", "idx": 93}
{"Tweet": "@user @user @user feminists want special right not equal right. Don't b a feminist #feministcruelty #SemST", "Label": "against", "idx": 94}
{"Tweet": "I take some solace in knowing that, at least, it means they don't know who that useless hack is... @user  #SemST", "Label": "none", "idx": 95}
{"Tweet": "Never settle for anything less than your are worth. #SemST", "Label": "against", "idx": 96}
{"Tweet": "Being raised by a feminist in rotting, soiled clothes - \"I'm not your slave! #SemST", "Label": "against", "idx": 97}
{"Tweet": "Girls don't wanna go to the strip with their bfs but beg him to go see Magic Mike XXL with them. #SemST", "Label": "against", "idx": 98}
{"Tweet": "Men don't have a right to talk over you, you're voice is important, you are a goddess and don't deserve to be silenced #SemST", "Label": "favor", "idx": 99}
{"Tweet": "Feminism on twitter is the black hole of human intelligence, just like creationism.  #GamerGate #SemST", "Label": "against", "idx": 100}
{"Tweet": "So if I find a woman attractive I'm an objectifying pig. If I don't find her attractive I'm a shallow pig. #SemST", "Label": "against", "idx": 101}
{"Tweet": "Radios r filled with feminist and rape propaganda. Feminism is alive n well in Malaysia. Their rape guilt tactics won't silence me #SemST", "Label": "against", "idx": 102}
{"Tweet": "@user exactly women are so weak and incapable the sight of one in a slim skin is giving them an attack of the vapours #SemST", "Label": "against", "idx": 103}
{"Tweet": "Feminism is a fashionable form of narcissism because personal trauma & personal retribution is what drives feminists. #SemST", "Label": "against", "idx": 104}
{"Tweet": "Women's rights are #humanrights! Join the #CPDvoices twitter rally at 3pm ET if you agree! #CPD48 #SemST", "Label": "favor", "idx": 105}
{"Tweet": "Men can no longer look at women's boobs, tattoos, or even look them in the eyes.  Soon: mandatory castration for all males. #SemST", "Label": "against", "idx": 106}
{"Tweet": "Feminists don't even understand what feminism is. #SemST", "Label": "against", "idx": 107}
{"Tweet": "@user women don't need to shave. #SemST", "Label": "favor", "idx": 108}
{"Tweet": "feminist response people wearing meninist clothes-  mock them or call them derogatory names? NOT A HATE GROUP ??? #SemST", "Label": "against", "idx": 109}
{"Tweet": "Hey first-world country white women bitching about gender inequality, you're going to be fine #killallmen #SemST", "Label": "against", "idx": 110}
{"Tweet": "Me (in jest): It's a man's world, y'know. Kaitlyn: I'll blow up the world then.  #SemST", "Label": "favor", "idx": 111}
{"Tweet": "@user why r u on twitter get back in the kitchen #feminist #feminazi #powertowomen #Equality #SemST", "Label": "against", "idx": 112}
{"Tweet": "Full of #narcissism and self-loathing, a lot of women out there like that. Its got sod all to do with #WrightStuff #WolfWhistling #SemST", "Label": "against", "idx": 113}
{"Tweet": "@user Feminists, go to the gym, lose some weight and stop to blame society for everything #SemST", "Label": "against", "idx": 114}
{"Tweet": "Meritocracy is only oppressive against the incompetent - if you believe it's sexist, YOU are the sexist one #therealkind #SemST", "Label": "against", "idx": 115}
{"Tweet": "All I need in this life of sin is me and my girlfriend #SemST", "Label": "none", "idx": 116}
{"Tweet": "You want to hear something really ugly, 1 in 5 women will be sexually assaulted in their time in college #MisogynyIsUgly #SemST", "Label": "favor", "idx": 117}
{"Tweet": "It is not a woman's place to be made to feel uncomfortable walking down the street. #PoppySmart #SemST", "Label": "favor", "idx": 118}
{"Tweet": "Why is Paul Elam not one of the most hated men alive right now!? #feminist #SemST", "Label": "favor", "idx": 119}
{"Tweet": "@user @user @user @user @user @user  FEEL decides who get support.  #SemST", "Label": "none", "idx": 120}
{"Tweet": "Spanish Civil War publishing cookbooks & author gender points to women's lack of access to education, ind wealth #osfc15 #SemST", "Label": "against", "idx": 121}
{"Tweet": "@user feminism does not equal woman's rights. Feminism is about vaulting one gender over another, NOT equality. #SemST", "Label": "against", "idx": 122}
{"Tweet": "All the people who support abortion, to bad their parents didn't practice that \"right\"  #YesAllWomen #UniteBlue #SemST", "Label": "against", "idx": 123}
{"Tweet": "I'm all for feminism but I can't stand the female entitlement and sense of over worth the popular culture presents.   #Meninist #SemST", "Label": "against", "idx": 124}
{"Tweet": "If masculinity is toxic, then I must be a nuclear waste facility. #gamergate #dumbfeminist #SemST", "Label": "against", "idx": 125}
{"Tweet": "@user 'look we can discuss sexism in survival situations when I get back' #jurassicworld #SemST", "Label": "none", "idx": 126}
{"Tweet": "Recenter your world. Be the captain of your ship. The author of your life story. #SemST", "Label": "none", "idx": 127}
{"Tweet": "@user Slut is a word made to degrade women, we shouldn't degrade anyone - it's their body's they can do what they like #SemST", "Label": "favor", "idx": 128}
{"Tweet": "DEAR FEMINISTS  Why don't you expel the man-haters poisoning your feminism?  Why  you admire them?   #GamerGate #NotY... #SemST", "Label": "against", "idx": 129}
{"Tweet": "@user Tell @user to stop speaking about women is such a belittling manner. You should NEVER lie to women. #Equality #asshole #SemST", "Label": "favor", "idx": 130}
{"Tweet": "@user @user @user @user @user I have to stop tweeting now cause @user wants his tea making. #SemST", "Label": "none", "idx": 131}
{"Tweet": "Upload sexually provocative pics up for all to see. But if someone you aren't attracted to looks it's harassment? Right #SemST", "Label": "against", "idx": 132}
{"Tweet": "@user @user Then there's the added level of irony: Their chosen figureheads: Not really \"body positive\" amirite? #SemST", "Label": "against", "idx": 133}
{"Tweet": "DEAR FEMINIST SUPPORTERS People like you with your endless concessions to feminists just prevent their accountability. #SemST", "Label": "against", "idx": 134}
{"Tweet": "A \"Strong Feminist\" on Twitter is measured by how much she can type without thinking first. (then delete) #GamerGate #SemST", "Label": "against", "idx": 135}
{"Tweet": "@user nope, no more adultery now than 100 years ago or 600 years ago. Sorry facts don't fit your narrative. #prochoice #SemST", "Label": "none", "idx": 136}
{"Tweet": "Men that want \"credit\" from women for being feminists are not feminists at all.  They're just men wanting more privileges #vaw #p2 #SemST", "Label": "favor", "idx": 137}
{"Tweet": "All men accused of rape should be immediately castrated, no questions asked. #RapeCulture #HeForShe #SemST", "Label": "favor", "idx": 138}
{"Tweet": "All I'm doing is reading GG tweets and getting angrier. Fuuuuuuuuuuuck men are privileged.  Time for bed. #FeminismIsAwfullyGreat #SemST", "Label": "favor", "idx": 139}
{"Tweet": "Grr! That subject is not allowed to be joked about! - Typical Feminist, regarding every topic of humor #SpankAFeminist #SemST", "Label": "against", "idx": 140}
{"Tweet": "Why do girls/women spend so much time to be pretty and attractive and then complain if they're reduced to a sex symbol? #SemST", "Label": "against", "idx": 141}
{"Tweet": "@user @user why not she's clearly a part of the squad females can't be with guys without being looked at as a hoe #SemST", "Label": "favor", "idx": 142}
{"Tweet": "Men are dirty & evil yet feminism is happy to take their money via the state in a form of collective prostitution. #SemST", "Label": "against", "idx": 143}
{"Tweet": "@user @user Innocent men should NOT be convicted of domestic violence! #SayNoToFeminism #SemST", "Label": "against", "idx": 144}
{"Tweet": "@user nah bitch I'm a fucking savage obviously . You just gonna suck dick and make sandwiches for some man who beats you daily #SemST", "Label": "against", "idx": 145}
{"Tweet": "@user Young man, stop wearing your sister's clothes and makeup. You look ridiculous. #SpankAFeminist #SemST", "Label": "against", "idx": 146}
{"Tweet": "son, you can't slut shame a female for having nudes and jerk off to the same nudes at night. you ain't right. #smh #SemST", "Label": "favor", "idx": 147}
{"Tweet": "I get a lot of shit for saying boobs are sexual. I'm sorry you call me ignorant all you want but its true #freethenippple #boobs #SemST", "Label": "against", "idx": 148}
{"Tweet": "The meaning of peace is the absence of opposition to socialism. #GamerGate #SemST", "Label": "none", "idx": 149}
{"Tweet": "@user my hat is seriously off to all those who made Beijing such a breakthrough. We don't say thank you enough! #womensrights #SemST", "Label": "favor", "idx": 150}
{"Tweet": "RT @user @user @user @user @user this is a typical example of #misandry and #Scrap498a #498a #fakecases... #SemST", "Label": "none", "idx": 151}
{"Tweet": "When is it ok for a married 49-year-old CEO to use his power and influence to shag his 22-year-old intern? #AskHillary #SemST", "Label": "favor", "idx": 152}
{"Tweet": "Hate when girls turn into bitches because a guy tells them they look good without make up... THATS A COMPLIMENT ?!!??!???? #SemST", "Label": "against", "idx": 153}
{"Tweet": "I need feminism because broken idealogies need defending just as much as functioning ones. #cryingalready #DeathNote #SemST", "Label": "favor", "idx": 154}
{"Tweet": "RULES TO LIVE BY  Seek logic in things, even if it looks like a waste of time, including feminism.   #GamerGate #SemST", "Label": "against", "idx": 155}
{"Tweet": "MyVagina kicked the Shit out of HisCock / #SemST", "Label": "against", "idx": 156}
{"Tweet": "The most upsetting of all of these however, was when I was greeted with shock and disgust for the fact I have ambition and #SemST", "Label": "favor", "idx": 157}
{"Tweet": "hooks says that we continue,even though it's hard and causes pain, because of those people we look to #whatawoman #bellhooks #love #SemST", "Label": "favor", "idx": 158}
{"Tweet": "I am obsessed with becoming a woman comfortable in her skin.  Sandra Cisneros #latinx #woc #SemST", "Label": "favor", "idx": 159}
{"Tweet": "Ashamed of my fellow man. Making pigs of ourselves at every given opportunity.  #feminist #ashamed #SemST", "Label": "against", "idx": 160}
{"Tweet": "Women don't make 75% less than men for the same job. Women, on average, make less then men. Look it up feminazis. #EqualPayDay #SemST", "Label": "against", "idx": 161}
{"Tweet": "feminists be like: don' judge a book by its cover! unless the cover is a straight white male. #SemST", "Label": "against", "idx": 162}
{"Tweet": "@user ARE YOU SAYING ALL GIRLS ARE SENSITIVE BECAUSE OF GENDER ROLES? YOU SEXIST SWINE #SemST", "Label": "favor", "idx": 163}
{"Tweet": "@user why does someone not create a female festival celebrating women?! Surely it's a no brainer! #art #music #history #SemST", "Label": "favor", "idx": 164}
{"Tweet": "The majority of anti-abortion leaders are men and none of them will ever be pregnant.  #genderequity #SemST", "Label": "against", "idx": 165}
{"Tweet": "Women in STEM is imaginary motivation with low conversion numbers. A waste of money on natural quitters.  #GamerGate  #SemST", "Label": "against", "idx": 166}
{"Tweet": "#FSURHET protip. MAYBE familiarize yourself with recent trending topics....#Meninist #BlackLivesMatter #BaltimoreRiots #SemST", "Label": "none", "idx": 167}
{"Tweet": "Pussy Riot: A Punk Prayer  I highly suggest you watch it. Such an amazing documentary. #SemST", "Label": "favor", "idx": 168}
{"Tweet": "Gotta love the respect feminists give to those that don't wanna be a feminist (note the sarcasm) #IDontNeedFeminism #SemST", "Label": "against", "idx": 169}
{"Tweet": "if your feminism is sex worker exclusive or trans exclusive I want no part in it. #intersectionality #SemST", "Label": "against", "idx": 170}
{"Tweet": "@user am not stopping your FOE on ur own TL,if u notice;was encouraging u to post topics I'm interested in on my TL #VAW #SemST", "Label": "none", "idx": 171}
{"Tweet": "@user @user @user i don't ever need a man #YesAllWomen #SemST", "Label": "favor", "idx": 172}
{"Tweet": ".@cooImemegirl @user So what? It is a man's choice whether he wants to breast feed his children. #SemST", "Label": "none", "idx": 173}
{"Tweet": "Now Harry is arguing with Dead Girl's father about whose job it is to kill the RapeMurdering villain. #Horns #SemST", "Label": "none", "idx": 174}
{"Tweet": "i wish people would understand that true feminists want equality for everyone (even men) not just girls . #SemST", "Label": "favor", "idx": 175}
{"Tweet": "Hey fellow Feminists, we need to fight back against this ridiculous war-glorifying that celebrates #men.  #Triggered #Transpatriot #SemST", "Label": "against", "idx": 176}
{"Tweet": "@user Don't worry about all these feminists. Any press is good press. I will be ordering products. soon. #SemST", "Label": "against", "idx": 177}
{"Tweet": "@user Most feminists don't know what they are fighting for?! Most ego maniac's who want they're 15 minutes of fame. #c4news #SemST", "Label": "against", "idx": 178}
{"Tweet": "Stupid Feminists, the civilization you take for granted was built with the labour, blood sweat and tears of men. #SemST", "Label": "against", "idx": 179}
{"Tweet": "hey @user stop teiggering me with ur man gap on the bus i will fight the patriarchy until ur in jail. ty #Equality2015 #SemST", "Label": "favor", "idx": 180}
{"Tweet": "Kwink884 thewtfmagazine gamers are fatophobes. ever notice there are no morbidly obese characters in video games? #GamerGate #Not... #SemST", "Label": "none", "idx": 181}
{"Tweet": "@user literally you are so on point about the male gaze and BS about fake nerd girls #SemST", "Label": "against", "idx": 182}
{"Tweet": "I'm not sure my schadenfreudes can stand this much tickling. @user @user  #SemST", "Label": "none", "idx": 183}
{"Tweet": "Meredith giving Don crap was great,but HOLY CRAP PEGGY. No spoilers, but DAMN was it a great scene. #Peggy #MadMen #SemST", "Label": "none", "idx": 184}
{"Tweet": "@user eat a pus or somethin lozer #SemST", "Label": "none", "idx": 185}
{"Tweet": "#Feminists: calling other people bad names won't turn them into feminists.You're shooting yourselves in the foot. #sexism #antiSJW #SemST", "Label": "against", "idx": 186}
{"Tweet": "The moment you know you've won as a wife.  You put out and he gets up to make his own sandwich. #winning #yvrmoms #funny #joke #SemST", "Label": "favor", "idx": 187}
{"Tweet": "Wanna hear the two funniest words in the English language right now?  Feminist fellowship.   Geddit? Fell, ow, ship?   #SemST", "Label": "against", "idx": 188}
{"Tweet": "*sigh* One small step back for women, one giant leap forward for lonely perverts. #ChrissyTeigen #SemST", "Label": "against", "idx": 189}
{"Tweet": "There is one more basic cause [of the abuse of women], and that is that, in general, men don't give a damn. (Jimmy Carter) #SemST", "Label": "against", "idx": 190}
{"Tweet": ".@johnny_nimble @user @user \"Equality\": a term used by feminists to poorly hide supremacist agendas. #SemST", "Label": "against", "idx": 191}
{"Tweet": "Shut up and go back to the kitchen bitch #SemST", "Label": "against", "idx": 192}
{"Tweet": "WTF LITEraL FUCK AM I EVAN SSEING THIS THING ABOUT. #SemST", "Label": "none", "idx": 193}
{"Tweet": "Pope Francis: Christians should support equal pay for equal work #popefrancis #worldnews #society #women #SemST", "Label": "favor", "idx": 194}
{"Tweet": "#WeNeedFeminism because #YesAllWomen simply do not get the same level of respect that I get as a man. #HeForShe #SemST", "Label": "favor", "idx": 195}
{"Tweet": "I do not wish for #Women to have power over #Men but over themselves. #Milan #KnockKnock #PAK_Army #PTIFamily #SemST", "Label": "favor", "idx": 196}
{"Tweet": "So you support unequal pricing based on gender @user  Don't you normally call that sexism?  #EqualPayDay #SemST", "Label": "favor", "idx": 197}
{"Tweet": "Petition for journalists to stop using \"man up\" when they mean \"demonstrate resilience and mental toughness #SemST", "Label": "favor", "idx": 198}
{"Tweet": "Elizabeth Cady Stanton did not die so you could get upset about fuckbois that don't text back #SemST", "Label": "favor", "idx": 199}
{"Tweet": "@user does a vegan diet make you immortal? either way we're all gonna die #SemST", "Label": "none", "idx": 200}
{"Tweet": "This #MaritalRape law if misused dont give any scope to men to prove their innocence.Even honest men can be trapped & slaughtered. #SemST", "Label": "against", "idx": 201}
{"Tweet": "The only reason, I stopped at each entrance in #walkingstreet is to have a #LawOfAttraction #viewpoint #dailydevotional #SemST", "Label": "none", "idx": 202}
{"Tweet": "Anita #Sarkeesian - living the damsel in distress trope. #SemST", "Label": "against", "idx": 203}
{"Tweet": "@user Wow. A threat of violence from a feminist, when I've been nothing but polite. I might report this . . . #SemST", "Label": "against", "idx": 204}
{"Tweet": "#SignsYoureInTheUSA You are attacked by feminists who labels you the patriarchy for cooking sunny side up eggs  #SemST", "Label": "against", "idx": 205}
{"Tweet": "I am really proud to be a @user and I want to thank @user for being such a powerful feminist #HeForShe #SemST", "Label": "favor", "idx": 206}
{"Tweet": "i have autocorrect switched off smh i dnt need u im independent #SemST", "Label": "none", "idx": 207}
{"Tweet": "I have noticed that you never see any really beautiful feminists. I wonder why? #SemST", "Label": "against", "idx": 208}
{"Tweet": "We teach the young rubbernormative messages about how they \"should\" use condoms, as if rawdogging is somehow wrong #teamnocondom #SemST", "Label": "none", "idx": 209}
{"Tweet": "Really interesting debate about whether men can also be feminists #BSCConf15 #criminology #SemST", "Label": "against", "idx": 210}
{"Tweet": "Every time I was told I was bossy rather than assertive I took it as a compliment, #SemST", "Label": "favor", "idx": 211}
{"Tweet": "RT gamergatenews: RT CaptHaddock83: Ha Ha hilarious! #Feminists desending on #SpankAFeminist like mad harpies, #SJWs #game... #SemST", "Label": "against", "idx": 212}
{"Tweet": "For all y'all who only pay attention to men's sports, something fairly important is happening now with USA women's soccer #SemST", "Label": "against", "idx": 213}
{"Tweet": "Rethink your beach clothes. Bc it may oppress some people!! #thisoppresseswomen #SemST", "Label": "against", "idx": 214}
{"Tweet": "Ok armchair feminists got their panties wet. If you're a social justice warrior go out and do something. Get off tumblr.  #SemST", "Label": "against", "idx": 215}
{"Tweet": "I don't buy a dress that I can't completely zip up and fasten on my own. #SemST", "Label": "none", "idx": 216}
{"Tweet": "@user Actually, the tag was made by feminists so they can narcissistically post selfies to prove they're not ugly. #SemST", "Label": "against", "idx": 217}
{"Tweet": "@user Thank you, #progressive-minded pursuers of familial and societal Dystopia. #Democrats #Liberals #SemST", "Label": "none", "idx": 218}
{"Tweet": "RT @user Do you know what women should stop wearing after age 30? Nothing. Women can wear whatever they want, no matter how old. #SemST", "Label": "favor", "idx": 219}
{"Tweet": "Thanks to the work of people like @user they are not only helping women but helping the whole of society #SemST", "Label": "favor", "idx": 220}
{"Tweet": "#SharkRocket \"Real People, Real Results\" commercial only includes women - So, men don't vacuum? #NotBuyingIt #SemST", "Label": "against", "idx": 221}
{"Tweet": "@user What a load of crap. Dressing appropriately for the office is \"sexist\"? Grow up. #YesAllWomen #SemST", "Label": "favor", "idx": 222}
{"Tweet": "This feminist supports gender equality because some people believe a woman's value lies in her physical beauty. #SemST", "Label": "favor", "idx": 223}
{"Tweet": "my coworker called me gay because i didn't stare at these girls who came in, SORRY but i respect women and this is why i need #SemST", "Label": "favor", "idx": 224}
{"Tweet": "It's funny how the #government wants to fix the #gay problems but what about the straight people problems #SemST", "Label": "none", "idx": 225}
{"Tweet": "Multiple abortions means Feminists are not using the contraceptives THEY THEMSELVES demanded.  #GamerGate #SemST", "Label": "against", "idx": 226}
{"Tweet": "WOW.  Why is gay marriage legal but LESBIAN marriage isn't?!  WHAT THE FUCK @user FIX THIS NOW #SemST", "Label": "none", "idx": 227}
{"Tweet": "@user @user  Very nice work. I'm happy to hear your autistic friend is able to express himself this way #SemST", "Label": "none", "idx": 228}
{"Tweet": "#SingleBecause I refuse to be man's 'other' and bcs I want to be my full self, bcs I want a feminist man, who's a man's man. #SemST", "Label": "favor", "idx": 229}
{"Tweet": "Tumblr made me slightly transphobic and misogynistic. #Tumblr #SemST", "Label": "none", "idx": 230}
{"Tweet": "@user @user @user @user Mind your own business, cunt.     Did the batteries in your BOB die? #SemST", "Label": "against", "idx": 231}
{"Tweet": "To men who make contact with women thinking they are owed a response #patriarchy #SemST", "Label": "favor", "idx": 232}
{"Tweet": "RT @user \"We have a lot of healing to do\"- Rosie Rocha-Martinez #confuerzacollective #chicanaherstory #kpfk #SemST", "Label": "against", "idx": 233}
{"Tweet": "there's someone once told me - girls have to be quiet -, i've told him: really? . and i never been quiet since then. #SemST", "Label": "against", "idx": 234}
{"Tweet": "stop with the male animators we want female animators  #SemST", "Label": "favor", "idx": 235}
{"Tweet": "@user Car women will as well. #SemST", "Label": "against", "idx": 236}
{"Tweet": "Selective listening a #character trait of convenience #feminists #SemST", "Label": "against", "idx": 237}
{"Tweet": "I only ever see \"meritocracy is a myth\" being pushed by people with no skills trying to buddy-buddy their way to the top. Hmm. #SemST", "Label": "none", "idx": 238}
{"Tweet": "I believe that every women should have their own rights!! #SemST", "Label": "favor", "idx": 239}
{"Tweet": "@user and the sad part is they dont they hate people with their own thought experiences and worse of all voice #SemST", "Label": "against", "idx": 240}
{"Tweet": "#LikeAFeminist I think any woman who doesn't identify as a feminist has \"internalised misogyny #SemST", "Label": "favor", "idx": 241}
{"Tweet": "People say I'm a bit young to be into politics. But honestly, I just stand for what I believe in. #MarriageEquaility #coexist #SemST", "Label": "none", "idx": 242}
{"Tweet": "I am not free while any woman is unfree, even when her shackles are very different from my own Audre Lorde #feminist #SemST", "Label": "favor", "idx": 243}
{"Tweet": "I think if Australia had a female PM n female majority MPs #MarriageEquaility would be legal here now #auspol #SemST", "Label": "favor", "idx": 244}
{"Tweet": "A quote from mother about being a woman: \"We really got it shit didn't we?\" Aye. Bring on fourth wave feminism! #4thwavefeminism #SemST", "Label": "against", "idx": 245}
{"Tweet": "Thought that goes through my mind on a regular basis: would you have said that to me if I was a man? #SemST", "Label": "favor", "idx": 246}
{"Tweet": "don't let anyone else's perception of you define you or your beliefs, and don't feel you have to justify your own worth #SemST", "Label": "favor", "idx": 247}
{"Tweet": "@user YES girl you can put almost anything in that joint #Islam #SemST", "Label": "none", "idx": 248}
{"Tweet": "@user good thing youre not pretty as fuck and im not tryna to slay!! #SemST", "Label": "against", "idx": 249}
{"Tweet": "Congratulations to America for overcoming 1 battle for #equality. Now let's have women&all races treated equally #AllLivesMatter #SemST", "Label": "favor", "idx": 250}
{"Tweet": "Lehi high school is my favorite school due to @user ps yo gleaves hit me up  #MondayMotivation #WhatAreYouAfraidOf #SemST", "Label": "none", "idx": 251}
{"Tweet": "Well maybe if more men learned to take \"no\" as an answer, women wouldn't have to say as much #fnm231 #SemST", "Label": "favor", "idx": 252}
{"Tweet": "I'm glad I was able to raise my kids n a time when my educated mothering decisions for my family were not vilified. #nonvaxxerhere #SemST", "Label": "against", "idx": 253}
{"Tweet": "For Us, By Us: These Apps Are What Happens When Girls #HackForGirlsRights via @user #girlsintechht.../buff.ly/1HHhM18 #SemST", "Label": "favor", "idx": 254}
{"Tweet": "It is not enough to help someone, or a group,  you have to do it in the name of . #identitypolitics  #SpankAFeminist #SemST", "Label": "against", "idx": 255}
{"Tweet": "Kristen Stewart: 'Hollywood is disgustingly sexist' #kristenstewart #cloudsofsilsmaria #culture #women #SemST", "Label": "favor", "idx": 256}
{"Tweet": "@user oh the irony of a radfem accusing others of low self-esteem. #GamerGate #SemST", "Label": "against", "idx": 257}
{"Tweet": "@user To paraphrase Friedan, the more a drive is deprived of data, the more its data will expand to fill the space. #1960s #SemST", "Label": "none", "idx": 258}
{"Tweet": "Storey's Song of the Day: To love somebody (BeeGees); topic of the day: Feminism in cultural theory. I love this class. #BeeGees #SemST", "Label": "against", "idx": 259}
{"Tweet": "@user @user @user Disgusted to see you were selling DVDs of 'Fifty Shades of Grey in your Chillingham Road branch #SemST", "Label": "none", "idx": 260}
{"Tweet": ".@cooImemegirl @user Women don't understand men's plight and so shouldn't force men into fatherhood w/o consent. #SemST", "Label": "against", "idx": 261}
{"Tweet": "M: FEMINISTS NEED TO GROWA SENSE OF HUMOR W: Okay. (sips from \"Male Tears\" mug) M: AAIGH!  MISANDREEEEEEEEEEE  #YesAllWomen #SemST", "Label": "against", "idx": 262}
{"Tweet": "@user The Mito Eve model does not explicit prove 1 ancestor, it narrows down similarities to a matter of a degree... #SemST", "Label": "none", "idx": 263}
{"Tweet": "@user  @user @user guy from 'beach body ready' advert being interviewed.Conclusion=arrogant male chauvinist idiot #SemST", "Label": "favor", "idx": 264}
{"Tweet": "@user @user @user It should be considered a hate crime if someone makes a threat against a woman. #SemST", "Label": "favor", "idx": 265}
{"Tweet": "Umrao Jaan Ada- a story of not just a life or prostitute but of poise and poesy.  #WOMANPOWER #SemST", "Label": "favor", "idx": 266}
{"Tweet": "@user @user @user It's an attempt at a @user parody. #ProteinWorld #BaltimoreRiots #socialism #SemST", "Label": "none", "idx": 267}
{"Tweet": "@user Pretty sure most of us are A-okay without having her on our team. And it's aaaalll about #choice, anyway. #feminists #SemST", "Label": "against", "idx": 268}
{"Tweet": ".@Awyee707 I respect your truck-suck. Why do you not respect girls' innate or chosen doll-love? #SemST", "Label": "favor", "idx": 269}
{"Tweet": "@user is the UK's answer to @user and @user #GamerGate #SemST", "Label": "against", "idx": 270}
{"Tweet": "Feminism is Radical Islam painted in pink.   #GamerGate #SemST", "Label": "against", "idx": 271}
{"Tweet": "@user though I'm not a girl so maybe I'm not  qualified to comment on women's issues, according to #SemST", "Label": "against", "idx": 272}
{"Tweet": "if women didn't have double standards then they would have no standards. #MagicMikeXXL #YesAllWomen #SemST", "Label": "against", "idx": 273}
{"Tweet": "RT mojibakemono: I'm going to take a nap, I'll follow everyone back when I wake up #OpSKYNET #GamerGate #NotYourShield #SemST", "Label": "against", "idx": 274}
{"Tweet": "Your physical appearance doesn't define your worth.People should be heard whether theyre conventionally attractive or not. #SemST", "Label": "favor", "idx": 275}
{"Tweet": "I think it's okay for a woman to take a mans name if she wants to. #genderequality #SemST", "Label": "favor", "idx": 276}
{"Tweet": "Misogynist abuser @user whining that feminists are blocking him. Let's make his day and all bock him. #YesAllWomen #SemST", "Label": "favor", "idx": 277}
{"Tweet": "The basic principle of the universe is INFORMATION. Literally everything is information in one form or another. #antifeminism #SemST", "Label": "against", "idx": 278}
{"Tweet": "I will say it again: only a low self esteem person will be oppressed by bikini/models ads. Get help #SemST", "Label": "against", "idx": 279}
{"Tweet": "@user they make me smile :) #SemST", "Label": "against", "idx": 280}
{"Tweet": "#YesAllWomen should know how to protect herself. Which is why I carry a gun. #republicanvalues #SemST", "Label": "favor", "idx": 281}
{"Tweet": ".@TheActualSarah The UK is considering abolishing prisons for women completely because crime is a man's fault. #SemST", "Label": "against", "idx": 282}
{"Tweet": ".@nycinterlude Don't worry, honey. Intelligence is a roadblock to full, unquestioning faith in feminism. Bleated be! #SemST", "Label": "against", "idx": 283}
{"Tweet": "History is \"his story;\" we need \"her story\" too! #SemST", "Label": "favor", "idx": 284}
{"Tweet": "Anti feminism - because being a good person isn't for everybody. #SemST", "Label": "against", "idx": 285}
{"Tweet": "Some feminist's would shut down the entire global porn industry & put millions on benefits/welfare & not even care #SemST", "Label": "against", "idx": 286}
{"Tweet": "The representation goal of Feminism has gone from  \"Invent more female characters\"  to  \"Replace all male characters #SemST", "Label": "against", "idx": 287}
{"Tweet": "@user @user how about \"Maura & Tucker in the morning\" #equality #seniority #SemST", "Label": "favor", "idx": 288}
{"Tweet": "Ruth_Blane: _AnAvgJoe_: RT Ruth_Blane: Ruth_Blane: Ruth_Blane: Ruth_Blane: ReverseDowry: RT manojmane: Take this !! #Feminazi #sc... #SemST", "Label": "against", "idx": 289}
{"Tweet": "DEAR FEMINISTS IN GAMING  Respect is earned with hard work, not playing the victim.  #GamerGate #SemST", "Label": "against", "idx": 290}
{"Tweet": "Beauty is in the eye of the goat. #AddGoatRuinAQuote #beauty #BodyImage #SemST", "Label": "against", "idx": 291}
{"Tweet": "@user listen well I'm ready to tell about a need that I cannot deny #hsmsong  #SemST", "Label": "none", "idx": 292}
{"Tweet": "People who call themselves beautiful are really the ugliest. #deep #edgy #Philosophy #BaltimoreRiots #Baltimore #SemST", "Label": "none", "idx": 293}
{"Tweet": "Wives who dislike cooking mk husbands diet, saying they'll stay fit Actually they want to avoid cooking ;) MCP #WomensProgress2015 #SemST", "Label": "favor", "idx": 294}
{"Tweet": "@user Dear god, you are fat. #SemST", "Label": "none", "idx": 295}
{"Tweet": "People think because I'm a feminist I hate men. No I'm a feminist, I believe in equality for all. #EqualityForAll #SemST", "Label": "favor", "idx": 296}
{"Tweet": "Great to see singer turned activist @user on the stage to interview @user #Glastonbury #glasto #charlottechurch #SemST", "Label": "favor", "idx": 297}
{"Tweet": "I've removed the term #feminist from by bio because racist, transphobic, white feminists have fucked it up for everyone. #SemST", "Label": "against", "idx": 298}
{"Tweet": "I shouldn't have to be holding a man's hand to be left alone on the street.  #catcalling #streetharassment #equality #SemST", "Label": "favor", "idx": 299}
{"Tweet": "Women are not going to be equal outside the home until men are equal in it-- Gloria Steinem  #women #men #SemST", "Label": "favor", "idx": 300}
{"Tweet": "Whether you label yourself a feminist or not I think it's important that we address equal rights.-Taylor Swift. #SemST", "Label": "favor", "idx": 301}
{"Tweet": "@user let's be pretty and put our tits on full display and then get pissed when people look. #logic #wtf #SemST", "Label": "against", "idx": 302}
{"Tweet": "Last week a man made a U turn and drove the wrong way on a one way street to tell me about my body.  #catcalling #streetharassment #SemST", "Label": "favor", "idx": 303}
{"Tweet": "Can't find it in me to be friends with people who throw around the word 'slut' or judge women for being sexual beings. #Equality #SemST", "Label": "against", "idx": 304}
{"Tweet": "What a great accomplishment #marriageequality , too bad it still sucks to be black or a woman in America. #racism #truthbomb #SemST", "Label": "favor", "idx": 305}
{"Tweet": "Shhhh! @user can't you see @user is bragging? Even feminists have the right to be bitches... #GamerGate #SemST", "Label": "favor", "idx": 306}
{"Tweet": "@user @user You compared playing with dolls to a violent disposition. Two very different things. #GamerGate #SemST", "Label": "none", "idx": 307}
{"Tweet": "@user Family Court is not a court. It is INQUISITION. #FEMINAZIS #SemST", "Label": "against", "idx": 308}
{"Tweet": "Today we watch the United States Supreme Court. #SemST", "Label": "none", "idx": 309}
{"Tweet": ".@Rod_McCallum You're 55yrs out-of-date. I thought you could be more interesting, but you're just old news, bored now. Bye #SemST", "Label": "none", "idx": 310}
{"Tweet": "RT @user 'BAD BITCH' is not a compliment #SemST", "Label": "favor", "idx": 311}
{"Tweet": "@user you should be nice to me anyways #NicerInternet #SemST", "Label": "none", "idx": 312}
{"Tweet": "One time I said girls don't like being called sluts to a guy and he said \"you can't speak for everyone #SemST", "Label": "favor", "idx": 313}
{"Tweet": "@user  Misogynist Patriarchy rapist neckbeard Harasser evil mansplain manspread woman hater born a rapist Etc Etc Etc #SemST", "Label": "favor", "idx": 314}
{"Tweet": "I nailed another black feminist. I banged her so hard that she shit. My wife ended up cleaning up the shit too. #BaltimoreRiots #SemST", "Label": "against", "idx": 315}
{"Tweet": "@user ya but you said it \"sexily\" #yoga #sjw #vegan #SemST", "Label": "against", "idx": 316}
{"Tweet": "Watching #missrepresentation .. We must change our world. #womenrule #change #beauty #SemST", "Label": "favor", "idx": 317}
{"Tweet": "I wonder what would happen if riots started breaking out across the globe because of how poorly women are treated by some men. #SemST", "Label": "favor", "idx": 318}
{"Tweet": "This just in: Pop culture still hates women. #SemST", "Label": "favor", "idx": 319}
{"Tweet": "I NEED FEMINISM BECAUSE- A man in a room full of women is ecstatic. A woman in a room full of men is terrified. #SemST", "Label": "favor", "idx": 320}
{"Tweet": "It's frustrating & awful that the only voices getting access to a wider audience are the voices of hate. #ConfederateFlag #race #SemST", "Label": "none", "idx": 321}
{"Tweet": "usa is only good at futbol if women are playing #SemST", "Label": "against", "idx": 322}
{"Tweet": "After a gr8 day for US equality, I think of the girls who pose with @user setting female equality back 40yr #gaymarriage #SemST", "Label": "favor", "idx": 323}
{"Tweet": "@user Have you ever thought that maybe \"blue jeans\" hates you? Not everyone in the world is made for each other. #SemST", "Label": "none", "idx": 324}
{"Tweet": "@user @user categorizing homelessness as a \"job\". #SemST", "Label": "none", "idx": 325}
{"Tweet": "#WhoIsBurningBlackChurches is the latest racist hate mob tag. No surprise it's all #BlackLivesMatter people. #SJWLogic #SemST", "Label": "none", "idx": 326}
{"Tweet": "No. Feminists are not ugly. The fact that there isn't equal rights for both men and women is. #FeministsAreBeautiful #SemST", "Label": "favor", "idx": 327}
{"Tweet": "to all the girls who ' always wear their invisible crown '  I 'always carry a gun '  #Lionesses #SemST", "Label": "against", "idx": 328}
{"Tweet": "If you want to empower women, you need to disempower the warlords! Zahara Langhi from Libya #WILPF100 #wsw2015 #ikff #peace #war #SemST", "Label": "favor", "idx": 329}
{"Tweet": "#Weneedfeminism because Twitter has its very own misogynist harassment machine. #YesAllWomen #HeForShe #Feminist #SemST", "Label": "against", "idx": 330}
{"Tweet": "There is nothing more inspiring that the drums at the beginning of #RunTheWorldGirls by @user It feels like the rise of #SemST", "Label": "against", "idx": 331}
{"Tweet": "pls don't h8 me my last tweet was OBVIOUSLY a joke #luv #rightsforall #SemST", "Label": "none", "idx": 332}
{"Tweet": "Time to go hashtag crazy, then... #Folklore #UKTourism #Britain #Storytelling #Myth #Legend #Equality #Multicultural #Folk #SemST", "Label": "none", "idx": 333}
{"Tweet": "Saying #AllLivesMatter instead of #BlackLivesMatter is like saying equal rights for all instead of #SemST", "Label": "none", "idx": 334}
{"Tweet": "And people wonder why #feminists aren't taken seriously...  At least give me 1 every time I hear this, I'd be rich!  #SemST", "Label": "against", "idx": 335}
{"Tweet": "now let's raise the pay for females and make it equal to what men get payed #EAQUALITY #SemST", "Label": "favor", "idx": 336}
{"Tweet": "Don't you just love how feminists are more focused on bondage books being romanticized than they are genital mutilation #SemST", "Label": "against", "idx": 337}
{"Tweet": "@user the trigger levels are over 9000 #SemST", "Label": "none", "idx": 338}
{"Tweet": "If you're a feminist AND you hate men, please kill yourself. #SemST", "Label": "against", "idx": 339}
{"Tweet": "The best way to spot religions is to see how often they get offended by ideas & crticism. Feminism ranks very high. #SemST", "Label": "against", "idx": 340}
{"Tweet": "IF FEMINISTS WERE HONEST  \"I don't want to learn skills, I want others to work under my name.\"  #GamerGate #SemST", "Label": "against", "idx": 341}
{"Tweet": "#sex male caste general religion Hindu. None of these were in my hand!!! Gurrr  #feminazis pseudo #SemST", "Label": "against", "idx": 342}
{"Tweet": "Getting haircut b/c I have a job interview. Because being male and having shoulder length hair is 'unprofessional' #SemST", "Label": "against", "idx": 343}
{"Tweet": "Why should woman stick together?  I don't like half of you cunts. #SemST", "Label": "against", "idx": 344}
{"Tweet": "RT @user Wonder what it'd be like to wear a dress and NOT be sexually harassed for it.  #YesAllWomen #SemST", "Label": "favor", "idx": 345}
{"Tweet": "Feminists are not ugly lol they do make me laugh though. They are the most hypocritical people on the planet #SemST", "Label": "against", "idx": 346}
{"Tweet": "Modern marriage is like a modern car, shinny, disposable and not made to last.   #GamerGate #SemST", "Label": "against", "idx": 347}
{"Tweet": "DEAR FEMINISTS  The problem with abortion is not \" too many rapes\" it is too much fucking WITHOUT condoms   #GamerGate #SemST", "Label": "against", "idx": 348}
{"Tweet": "Contrary to stereotype I see feminists all over social media championing causes that benefit men. #YesAllWomen #HeForShe #SemST", "Label": "favor", "idx": 349}
{"Tweet": "Or maybe I'm just cross because I'm hungry... hmmmm #SemST", "Label": "none", "idx": 350}
{"Tweet": "All mascots in women's world Semi-final are girls?... #Equalityforall #SemST", "Label": "against", "idx": 351}
{"Tweet": "Extinction of insects,dangerous herbs,gigolo services,religious fanaticism,fake BEERcans-Y Malaysia Radio&media FAIL2discuss? #SemST", "Label": "none", "idx": 352}
{"Tweet": "Reading a mag that has endless pages about how to look on holiday but holidays are the time not to give a fuck. That's the point! #SemST", "Label": "none", "idx": 353}
{"Tweet": "DateOffCampus: Now part of the regular lineup  #SpankAFeminist #feminazi #MRA #Fak... #SemST", "Label": "against", "idx": 354}
{"Tweet": "DEAR ANTI-PORN FEMINISTS   If you've never eaten popcorn while watching porn you are missing out in life... #GamerGate #SemST", "Label": "against", "idx": 355}
{"Tweet": "IF FEMINISTS WERE HONEST   \"I know men don't have the right kind of thoughts.\"   #GamerGate #SemST", "Label": "against", "idx": 356}
{"Tweet": "Downvoting my youtube videos is hateful and sexist! #gamergate #femfreq #radicalbytes #videogame #gaming #SemST", "Label": "favor", "idx": 357}
{"Tweet": "@user is this list for real? Please god it better be a joke. No man or woman should ever pay attention to this shit. #pissed #SemST", "Label": "none", "idx": 358}
{"Tweet": "I met my first radical feminist today. Holy shit. Amazing how much can go wrong in a brain #wtf #SemST", "Label": "against", "idx": 359}
{"Tweet": "What about how in the world of weed, the male plants are mostly deemed useless as they only produce seeds & don't flower #SemST", "Label": "against", "idx": 360}
{"Tweet": "Here we are fighting for equality when @user decide to only allow ladies heat breaks. Do men not get hot too? #SemST", "Label": "against", "idx": 361}
{"Tweet": "@user I'm just stating the facts #SemST", "Label": "none", "idx": 362}
{"Tweet": "@user a lot of people get indoctrinated in a movement by reading comments and articles. For example #meinkamp. #equality #SemST", "Label": "none", "idx": 363}
{"Tweet": "@user @user @user as I said, most friends I made of sex appeal to me, but I do what I must, FOR #SemST", "Label": "none", "idx": 364}
{"Tweet": "I am #NotAFeminist b/c human rights are for all humans, not just half of them.   #antifeminism #antifeminist #SemST", "Label": "against", "idx": 365}
{"Tweet": "DEAR FEMINISTS  The evidence of your closeted hate is your refusal to address man-hate in feminism.   #GamerGate #SemST", "Label": "against", "idx": 366}
{"Tweet": "I am a feminist.I've been a female for a long time now.It'd be stupid not to be on my own side-Maya Angelou-#feminist #humanist #SemST", "Label": "favor", "idx": 367}
{"Tweet": "These SJWs are so homogenous and blur together so well it's like dealing with one giant,rainbow-headed monster. #GamerGate #SemST", "Label": "against", "idx": 368}
{"Tweet": "@user Are you using women as sex objects to sell your sexist hate movement, yes you are. #SemST", "Label": "against", "idx": 369}
{"Tweet": "Multiple abortions is one of the few mistakes in life where you are not expected to learn.   Welcome to feminism.  #SemST", "Label": "against", "idx": 370}
{"Tweet": "Patriarchy Theory - designed to project the prejudice and insecurity of feminists onto men #SemST", "Label": "against", "idx": 371}
{"Tweet": "*watching house of cards with my dad* \"I could be First Lady.\" \"Why not president?\" \"YEAH DAD! Next woman president right here!\"  #SemST", "Label": "favor", "idx": 372}
{"Tweet": "If women do it, it cannot be immoral or evil. Right?  Welcome to feminism defending pedophilia promoter #LenaDunham  #SemST", "Label": "against", "idx": 373}
{"Tweet": "OH NO EQUALITY FOR ALL WHAT SHALL WE DO ?!?!? STOP FEMINIST ASAP #SemST", "Label": "against", "idx": 374}
{"Tweet": "@user you realise that you have just painted \"all\" men with the same brush. So \"wilfully ignorant\" could describe you! #fail #SemST", "Label": "against", "idx": 375}
{"Tweet": "What do feminists want: All humans, male and female, should have equal political, economic and social rights. Equality. #SemST", "Label": "favor", "idx": 376}
{"Tweet": "I HOPE YOU GET RAPED is apparently how misogynists say \"How dare you not bend to my will?\"  #YesAllWomen #SemST", "Label": "favor", "idx": 377}
{"Tweet": "Just watched Mad Max: Fury Road.  Amazing! Everything! And as a woman watching this film... Amazed. #MadMaxFuryRoad #SemST", "Label": "none", "idx": 378}
{"Tweet": "Pushing misinformation about #wagegap is the new anti vaccination. #SemST", "Label": "against", "idx": 379}
{"Tweet": "@user Also a policy on removing feminists. In their entirety. Thanks for your help with this #VoteUKIP #SemST", "Label": "against", "idx": 380}
{"Tweet": "@user Even though we all know which gender is superior. =) #SemST", "Label": "favor", "idx": 381}
{"Tweet": "I wish Laura croft would undress more so I could Bitch about it. #FemFreq #SemST", "Label": "against", "idx": 382}
{"Tweet": "If you claim nor to be a feminist, you either don't understand what feminism is, or you are a huge societal problem. #SemST", "Label": "favor", "idx": 383}
{"Tweet": "IF FEMINISTS WERE HONEST   \"Tell me the truth but make sure you agree with me.\"  #GamerGate #SemST", "Label": "against", "idx": 384}
{"Tweet": "It's hard being a woman, constantly annoyed by things that don't really matter on the grand scheme of things. Wish I was a man #SemST", "Label": "against", "idx": 385}
{"Tweet": "What do you say to a woman with two black eyes?  Nothing, she's already been told twice.   #SemST", "Label": "against", "idx": 386}
{"Tweet": "Thanks for all the laughs tonight, @user And the social commentary wasn't bad either ;) #equalpay #girlyoudontneedmakeup #SemST", "Label": "favor", "idx": 387}
{"Tweet": "RT @user My dream in life is to fuck a Canadian slut in her eye-socket.  #YesAllWomen #ThisFuckingGuy #SemST", "Label": "none", "idx": 388}
{"Tweet": "Feminists are so stupid they think they're the only ones who can have freedom of speech Lmaooo #SemST", "Label": "against", "idx": 389}
{"Tweet": "If feminists are ugly then what are the people calling them ugly must be vile #SemST", "Label": "favor", "idx": 390}
{"Tweet": "Courting patriarchal approval condemns your sisters to abuse about their physical appearance #patriarchyisugly #SemST", "Label": "favor", "idx": 391}
{"Tweet": "@user  Why is it called HIStory and not HERstory ?!   #SemST", "Label": "favor", "idx": 392}
{"Tweet": "You know you're in a patriarchy when women are the ones who are blamed for prostitution #whatisjustice #inequality #SemST", "Label": "favor", "idx": 393}
{"Tweet": "men suck. women suck. everybody sucks #SemST", "Label": "against", "idx": 394}
{"Tweet": "DEAR FEMINISTS  Start asking for accountability from man-haters instead of shielding them for convenient concealment.  #SemST", "Label": "against", "idx": 395}
{"Tweet": "Wow @user  you are beautiful even make up free! #girlpower #SemST", "Label": "favor", "idx": 396}
{"Tweet": "Why are we all afraid to say the f-word? By f-word, I mean, feminist. It's not a bad word, people! #SemST", "Label": "against", "idx": 397}
{"Tweet": "@user I can kind of see myself doing what she's doing #Femalepower #yolo #SemST", "Label": "favor", "idx": 398}
{"Tweet": "If you're a feminist, stop whining on the internet and step up your game. Guys in Baltimore riot for their cause. Get shit done. #SemST", "Label": "against", "idx": 399}
{"Tweet": "Heterosexual male's sexual orientation is not a social/capitalist construct that it can be changed with a blink of an eye.  #SemST", "Label": "against", "idx": 400}
{"Tweet": "Of course ugly feminists hate sexy porn stars, rhinos hate the fact they they will never be a unicorn.  #GamerGate #SemST", "Label": "against", "idx": 401}
{"Tweet": "All the feminist block me because I speak true. #SemST", "Label": "against", "idx": 402}
{"Tweet": "Mother and I were laughed at by first graders because mother threw a bug on me and we both screamed and ran away #strongwomen #SemST", "Label": "none", "idx": 403}
{"Tweet": "@user the friend of my enemy is my pizza delivery guy. #vegans #blessed #SemST", "Label": "none", "idx": 404}
{"Tweet": "CEOs apologizing to feminists pressure only awards Feminism with its sought-after intellectual immunity. #GamerGate #SemST", "Label": "against", "idx": 405}
{"Tweet": "Feminism then: Fight for women's rights  Feminism now: Find the most petty first world problem to whine about.  #SemST", "Label": "against", "idx": 406}
{"Tweet": "@user @user If you buy into this brainwashing I hope you never get selected for jury duty involving a sex crime #SemST", "Label": "against", "idx": 407}
{"Tweet": "You don't have to be anti-men to be pro-women. ~ #SheQuotes #Quote #women #men #SemST", "Label": "favor", "idx": 408}
{"Tweet": "Walking through my neighborhood i saw 5 different fathers taking care of the toddler with no woman nearby  #househusband #SemST", "Label": "favor", "idx": 409}
{"Tweet": "@user @user so labeling womne? OMG SEXISM! labeling men? well, most men are like that, so... #SemST", "Label": "against", "idx": 410}
{"Tweet": "Because all human beings are created equally by nature. #SemST", "Label": "favor", "idx": 411}
{"Tweet": "#Feminists can now prove Wage Gap... yet no lawsuits have come forward of women paid less... maybe it doesn't exist.  #SemST", "Label": "against", "idx": 412}
{"Tweet": "DEAR LYING FEMINIST JOURNALISTS  If candy crush saga is \"hard core gaming\" then masturbation is marriage.  #GamerGate #SemST", "Label": "against", "idx": 413}
{"Tweet": "Feminist outrage over American girls being recruited by ISIS? Zero. #SemST", "Label": "against", "idx": 414}
{"Tweet": "Those fucking feminists...   Sir Tim Hunt was fired over lies. Following his joke, he praised women in science.   #SemST", "Label": "against", "idx": 415}
{"Tweet": "#HowToBeUnhappyLikeAFeminist?  Feminists fill their conversations with gossip & HATE AKA #killallmen.  #GamerGate #SemST", "Label": "against", "idx": 416}
{"Tweet": "@user @user @user going #FullMcIntosh for only the 737th consecutive time. #SJWLogic #SemST", "Label": "against", "idx": 417}
{"Tweet": "#MagicMikeXXL is the most feminist movie I have seen since #MadMax. Good work! #SemST", "Label": "against", "idx": 418}
{"Tweet": "I dont need white privillaged men coming up to me telling me my beliefs and fashion are unacceptable #furry #Feminist #SemST", "Label": "favor", "idx": 419}
{"Tweet": "they opened a blenders in the vhs GIRLS bathroom today! #TheMoreYouKnow #SemST", "Label": "none", "idx": 420}
{"Tweet": "Omfg... definition of first world problems. #FuckFeminism #SemST", "Label": "against", "idx": 421}
{"Tweet": "NiceFeminists are passive onlookers to man-hate. Their excuse?  \"It's not up to me to prevent hate in my movement!\"  #SemST", "Label": "against", "idx": 422}
{"Tweet": "@user @user 10 to realize this is all actually a symbol for #SemST", "Label": "none", "idx": 423}
{"Tweet": "So now I'm sexist for saying that if a women can't deal with a bad joke she's going to suffer when it comes to adv maths  #SemST", "Label": "against", "idx": 424}
{"Tweet": "Strict gender roles in the context of a true marriage devoted to raising children will always be the ideal. No substitutes. #tcot #SemST", "Label": "against", "idx": 425}
{"Tweet": ".@GloriaSteinem said, \"Women are not going to be equal outside the home until men are equal in it.\" Do you agree? #antifeminism #SemST", "Label": "against", "idx": 426}
{"Tweet": "Men want women to take their name in marriage for male pride. Because female pride doesn't matter. #genderequality #SemST", "Label": "favor", "idx": 427}
{"Tweet": "How can you be female and not be a feminist? Like do you not care about your rights as a women or what? #SemST", "Label": "favor", "idx": 428}
{"Tweet": "Goldstein is the #SanFrancisco City Archivist, she asks \"Where are the women in the history of our city?\" #alaac15 #archives #SemST", "Label": "favor", "idx": 429}
{"Tweet": "This always infuriates me. If I was male would I be asked these questions? would I be stereotyped as a 'bitch', 'cold hearted' or #SemST", "Label": "favor", "idx": 430}
{"Tweet": "@user @user please RT for our gender equality project! #SemST", "Label": "favor", "idx": 431}
{"Tweet": "people actually brag about how dank their shatter wax shit is on instagram pls kill me #lol #dabs #wax #420 #SemST", "Label": "none", "idx": 432}
{"Tweet": "@user wtf what about single fathers #SemST", "Label": "against", "idx": 433}
{"Tweet": "@user I hope there is a women's size for the #GameofKings championship belt. Or is that just for men? #SemST", "Label": "against", "idx": 434}
{"Tweet": "tired of anti-womanist respectability politics. we need a safe space for women can look like they're at the club at an interview #SemST", "Label": "favor", "idx": 435}
{"Tweet": "RT @user #HowToSpotAFeminist like @user They block you & then stalk you for days/weeks afterwards. #SemST", "Label": "against", "idx": 436}
{"Tweet": "Gender research helps to develop nursing research  theoretical frameworks, concepts and methodology. @user #research #SemST", "Label": "none", "idx": 437}
{"Tweet": "@user don't be saying these inconvenient truths. It might hurt the narrative. #SemST", "Label": "none", "idx": 438}
{"Tweet": "The mentality of #GamerGate is,   \"HEY! OUR Feminists are suuuuper stable! BTW don't agitate them with any criticism\"  #SemST", "Label": "against", "idx": 439}
{"Tweet": "In reading the #BeingFemale tweets I realized how fortunate I am to be able to rent and live in an apartment alone. #rights #fight #SemST", "Label": "against", "idx": 440}
{"Tweet": "Ignoring peer-reviewed research and empirical evidence is such a feminist thing to do. #GamerGate #NotYourShield #SemST", "Label": "against", "idx": 441}
{"Tweet": "@user lol! Young male children for #SemST", "Label": "none", "idx": 442}
{"Tweet": "Suns out....  Dresses out...  #StreetHarassment out...  This shouldn't be daily life  #YesAllWomen @user #SemST", "Label": "favor", "idx": 443}
{"Tweet": "I refuse to accept that there is a unbreakable glass ceiling, after all if you hit glass hard enough it will shatter #glassceiling #SemST", "Label": "favor", "idx": 444}
{"Tweet": "IF FEMINISTS WERE HONEST   \"I want a worldwide matriarchal dictatorship with all men enslaved to women\"   #GamerGate #SemST", "Label": "against", "idx": 445}
{"Tweet": "TASK 1.Present a feminist the fact most infanticides are perpetrated by the mother.  2.She will blame it on a male(s). #SemST", "Label": "against", "idx": 446}
{"Tweet": "@user its cool I got the greenlight I'm back on ur side #SemST", "Label": "none", "idx": 447}
{"Tweet": "Dear 80 percent of women: you don't think like us hence you are scum. - Love, @user #GamerGate #SemST", "Label": "against", "idx": 448}
{"Tweet": "Women who falsely accuse men of rape DO NOT care about exploting the suffering of real rape victims.  #GamerGate #SemST", "Label": "against", "idx": 449}
{"Tweet": "#HowToSpotAFeminist?->  7 Feminists compare themselves to successful men & non feminist women to harbor jealousy.  #SemST", "Label": "against", "idx": 450}
{"Tweet": "WHEN A FEMINIST IS IRRITABLE AND PREACHING FEMINISM YOU KNOW SHE'S MISPLACED HER VIBRATOR. #feminist #Feminists #SemST", "Label": "against", "idx": 451}
{"Tweet": "V! Can't wait to see you! # #SemST", "Label": "none", "idx": 452}
{"Tweet": "@user -- give us a follow back.   #feminist #SemST", "Label": "favor", "idx": 453}
{"Tweet": "@user love how it doesn't distract female teachers #SemST", "Label": "none", "idx": 454}
{"Tweet": "With or without someone by my side, I'm gonna achieve all the goals I have set. #strongwomen #Goals #SemST", "Label": "against", "idx": 455}
{"Tweet": "Sometimes I overheat and want to take off my shirt but can't because of social expectations of people with breasts. ;n; #SemST", "Label": "favor", "idx": 456}
{"Tweet": "@user amazing show in Leicester tonight, best comedy show I've ever seen, incredible! #upgradeyourself #SemST", "Label": "none", "idx": 457}
{"Tweet": "RT @user Females turn into man hating feminists because no man fancy's they're dyke lesbian ass's. #SemST", "Label": "against", "idx": 458}
{"Tweet": "Male rape is one of the most under-reported crimes; male rape survivors are among the most under-served crime victims. #SemST", "Label": "none", "idx": 459}
{"Tweet": "@user Also im assuming you claim to be one...yet you just called me an idiot and you dont even know me. Nice. #SemST", "Label": "none", "idx": 460}
{"Tweet": "Feminists like you are like religious people who CANNOT understand why Atheists reject their nonsense @user  #SemST", "Label": "against", "idx": 461}
{"Tweet": "@user You just gained a new follower! The #misogynist #maritalrapedebate views has got me outraged! #SemST", "Label": "favor", "idx": 462}
{"Tweet": "Australia even has a fucking Minister for women for fucks sake!IsAwful #SemST", "Label": "against", "idx": 463}
{"Tweet": "@user u have no reason to need feminism in the 1st world.u are equal. Stop trying to make a case for victimhood. #SemST", "Label": "against", "idx": 464}
{"Tweet": "Some guy just called me a gentleman for holding the door open for him. He then corrected himself & said \"I'm sorry, gentlewoman! #SemST", "Label": "favor", "idx": 465}
{"Tweet": "#WageEquality means Individuals with Equal Responsibilities, Training, Proficiency deserve Equal pay. #WomenRights #SemST", "Label": "against", "idx": 466}
{"Tweet": "What is wrong with you people. Women with self respect should be coveted. Or have we been listening to too much Rush? #SemST", "Label": "favor", "idx": 467}
{"Tweet": "Eating a bagel by myself rocking out to \"Man! I Feel Like a Woman!\" #ponytail #freedom #SemST", "Label": "favor", "idx": 468}
{"Tweet": "#HowToKeepYourGirlHappy treat her like your partner & not like your superior #SemST", "Label": "against", "idx": 469}
{"Tweet": "I'd rather share the road with a man who just pulled an all nighter and blew a .2 than a sober, well rested, woman. #Equality #SemST", "Label": "against", "idx": 470}
{"Tweet": "Watch colors code red now. It shows how a newly wedded wife con's the family. ,\"con bride\" #colors #scrap498a #SemST", "Label": "none", "idx": 471}
{"Tweet": "It doesnt take a miracle all takes signature and a few kind people to know not to kill innocent a women #MaryJaneLives #SemST", "Label": "favor", "idx": 472}
{"Tweet": "@user @user @user and @user are why feminists don't live on the same planet as us. #SemST", "Label": "against", "idx": 473}
{"Tweet": "I'll gladly accept my face on \"the least used of the most used bills\" #NeverSatisfied #SemST", "Label": "none", "idx": 474}
{"Tweet": "RT @user So #SpankAFeminist is sooooo horrible but #killallmen is perfectly fine ! I see how it is!! #SemST", "Label": "against", "idx": 475}
{"Tweet": "Seriously can't believe there are so many Hilary supporters right now.  #SemST", "Label": "against", "idx": 476}
{"Tweet": "Sexism is power plus prejudice? So Anita is sexist by her own definition because of her new title in time #Anitasarkeesian #SemST", "Label": "against", "idx": 477}
{"Tweet": "Feminism is built on hatred. Nothing to do with equality or any other humanitarian grounds #Don'tMancriminate #SemST", "Label": "against", "idx": 478}
{"Tweet": "Done with crime shows making rape about the father instead of the victim #SemST", "Label": "favor", "idx": 479}
{"Tweet": "RT @user Let's demand less cat-calling and more cats! #ndsufeminist #Feminist #cats #DogsCanComeToo #SemST", "Label": "favor", "idx": 480}
{"Tweet": "Feminism is not just about women; it's about letting all people lead fuller lives ~ @user #life #SemST", "Label": "favor", "idx": 481}
{"Tweet": "@user True, but it's in quotes, and I had to take the opportunity to promote #SemST", "Label": "none", "idx": 482}
{"Tweet": "The single biggest stimulus the economy can have is equal pay. - Gloria Steinem #alaac15 #SemST", "Label": "favor", "idx": 483}
{"Tweet": "Women are superior to men in every aspect #feminist #SemST", "Label": "favor", "idx": 484}
{"Tweet": "@user  Proud to say I don't listen to fat crossed eyed MJ #SemST", "Label": "none", "idx": 485}
{"Tweet": "@user i'm advocating men to stop loving women. Just have sex with them . #everydaysexism #SemST", "Label": "against", "idx": 486}
{"Tweet": "#HowToSpotAFeminist?->  10 Feminists struggle to control their lives and try to micromanage other women's lives.  #SemST", "Label": "against", "idx": 487}
{"Tweet": "RT EmilAaslund: Dear third wave feminists: I hate you, not women. Get your definitions straight. #GamerGate #slipperyslope #NotYo... #SemST", "Label": "against", "idx": 488}
{"Tweet": "Hey guyz I'm talking about Baltimore *social issues* super smart super current events #SemST", "Label": "none", "idx": 489}
{"Tweet": "We are 51% of the population and only 17% of Congress. The #WarOnWomen is absolutely a real thing. Wake up, America. #SemST", "Label": "favor", "idx": 490}
{"Tweet": "@user I've been pretty well. Enjoyed your response to #SemST", "Label": "none", "idx": 491}
{"Tweet": "Job should always go to best candidate, regardless of gender. Gender shouldn't even matter anymore, it's 2015! #PaulHenry #SemST", "Label": "favor", "idx": 492}
{"Tweet": "The fact that Chris Brown is somehow still famous is why I need #SemST", "Label": "none", "idx": 493}
{"Tweet": "#WeNeedFeminism because #NoMeansNo it doesnt mean yes, it doesnt mean try harder!  #YesAllWomen @user #RT #SemST", "Label": "favor", "idx": 494}
{"Tweet": "YOU'RE A GIRL AND HAVE A SEX DRIVE!? YOU MUST BE A SLUT! #feminist #SemST", "Label": "favor", "idx": 495}
{"Tweet": "The responsibilities Feminism admits are as ornamental as the intelligence of the average feminist. #OnlyRights #SemST", "Label": "against", "idx": 496}
{"Tweet": "@user its called sexual coercion, and it is the same as rape. #RapeCulture #SemST", "Label": "favor", "idx": 497}
{"Tweet": "@user and the offensive joke is left out of the context... #SpankAFeminist  #SemST", "Label": "against", "idx": 498}
{"Tweet": "@user lol Jaewon you are so good in the hood! We just like poetry over pressing issues #SemST", "Label": "none", "idx": 499}
{"Tweet": "#feminists gave women the right to vote. #feministsareliars Nevermind 2/3 of men that voted to give them that right. #SemST", "Label": "against", "idx": 500}
{"Tweet": "Pop quiz: Whats the greatest fear of the oppressor? #humanrights #BlackLivesMatter #SemST", "Label": "none", "idx": 501}
{"Tweet": "@user @user We can't pass judgements and offer advice on issues like hijab as if they belong to subaltern cultures.  #SemST", "Label": "none", "idx": 502}
{"Tweet": "Watch out, the feminists' next move will probably be demanding pay for the First Lady. #SemST", "Label": "against", "idx": 503}
{"Tweet": "RT VivienneDenue: bittergourd TheMarySue thank you! My game is going to knock your socks off! #femaleprotagonist #gamersunite #in... #SemST", "Label": "favor", "idx": 504}
{"Tweet": "Amusing. Feminists fly into a creationist rage whenever their belief in the patriarchy is questioned. #GamerGate #SemST", "Label": "against", "idx": 505}
{"Tweet": "When did trivializing the suffering of authentic rape victims become a \"sport\"?  Welcome to feminism.   #GamerGate #SemST", "Label": "against", "idx": 506}
{"Tweet": "@user also, sorry I'm too busy being a gorgeous feminist to give a shit about your beauty standards #SemST", "Label": "favor", "idx": 507}
{"Tweet": "Interesting in the video she kidnaps and tortures(tying up, confinement, etc) the wife or GF of the evil accountant #SemST", "Label": "against", "idx": 508}
{"Tweet": "@user Oh, come now! We both know she doesn't mean it *like that* -- only when it's advantageous! #SemST", "Label": "against", "idx": 509}
{"Tweet": "I brace myself for the onslaught anytime I walk by any man on the street.  #catcalling #streetharassment #equality #sexism #SemST", "Label": "favor", "idx": 510}
{"Tweet": "I have seen feminists disagree by saying \"shut up.\" Aside from simple manners, this treatment of others is befuddling. ~ @user #SemST", "Label": "against", "idx": 511}
{"Tweet": "GETTING OFFENDED  Is the simplest, most effective lie to manipulate others. Feminism & Religions love it. #GamerGate #SemST", "Label": "against", "idx": 512}
{"Tweet": "The rule of attention is you always get both: wanted and unwanted. But Feminists hypocrites only want one. #GamerGate #SemST", "Label": "against", "idx": 513}
{"Tweet": "the fact that people think women need to be appealing and attractive to be heard/seen as equal is why we need feminism #SemST", "Label": "favor", "idx": 514}
{"Tweet": "Pissed that I got \"talked to\" but he didn't  #SemST", "Label": "favor", "idx": 515}
{"Tweet": "So you want equality in the work place between men and woman but you won't take the trash out..? Makes sense #SemST", "Label": "against", "idx": 516}
{"Tweet": "@user Yes,a \"greater\" understanding because ur's is \"superior\" 2 mine LOL #IDontNeedFeminism #SemST", "Label": "against", "idx": 517}
{"Tweet": "Amusing how feminists swap their own personal \"I don't like it\" by \"Women don't like it\".   #GamerGate #NotYourShield #SemST", "Label": "against", "idx": 518}
{"Tweet": "And no femaskanks, your gender studies degree isn't as valuable as a S.T.E.M degree.... #SemST", "Label": "against", "idx": 519}
{"Tweet": "Because the United States is one of the only countries that doesn't give paid maternity leave #SemST", "Label": "favor", "idx": 520}
{"Tweet": "DEAR FEMINISTS & SJWs  I am a proud Troll. Make sure I am not proud of what you want to shame me for.  #GamerGate  #SemST", "Label": "against", "idx": 521}
{"Tweet": "Mind you, if your grandmother was cremated you could give yourself an enema with her ashes @user  #GamerGate #SemST", "Label": "against", "idx": 522}
{"Tweet": "@user Feminist logic:  \"Be awesome or you're a piece of shit\".  Nice.  You should learn what patriarchy means, dumb shit.  #SemST", "Label": "against", "idx": 523}
{"Tweet": "@user Have you considered changing your Twitter handle to vagina monologue? #SemST", "Label": "against", "idx": 524}
{"Tweet": "Keep the fight going for justice in all our communities #LGBTRights #BlackLivesMatter #JusticeForMuslims #HispanicGirlsUnited #SemST", "Label": "none", "idx": 525}
{"Tweet": "RT @user Feminism: the belief that men and women should have equal rights and opportunities. #feminist #lovetheladies #sor... #SemST", "Label": "against", "idx": 526}
{"Tweet": "Why do feminists hate @user so much? Because she's one thing none of them are:  Beautiful.  #GamerGate #SemST", "Label": "against", "idx": 527}
{"Tweet": "Anyone else starting to notice the general demographic of feminists is like fucking high-schoolers. #SemST", "Label": "against", "idx": 528}
{"Tweet": "Speaking from the heart is rarely wise especially if you have a retarded heart like most feminists.   #GamerGate #SemST", "Label": "against", "idx": 529}
{"Tweet": "U can be a #feminist w/o bein a bitch, u can also embrace ur sexuality w/o having loose morals #EmpowerAllBodies #empoweringwomen #SemST", "Label": "favor", "idx": 530}
{"Tweet": "These pics of #pornstars with/without makeup? Just perpetuating the myth that women need makeup to be considered pretty. #SemST", "Label": "favor", "idx": 531}
{"Tweet": "What a wonderful interview with @user in @user Very refreshing feminist views #SemST", "Label": "favor", "idx": 532}
{"Tweet": "A year of relentless harassment of folks talking about rape & abuse on #YesAllWomen = thriving rape culture on social media #SemST", "Label": "against", "idx": 533}
{"Tweet": "RT @user I don't want to choose between having a family or having a career #SemST", "Label": "favor", "idx": 534}
{"Tweet": "#Pretty.#Young #Thing. Catchy MJ song/ perfect summary of discourses surrounding professional #female #disempowerment. #gender #SemST", "Label": "against", "idx": 535}
{"Tweet": "It's not a pleasant world, where if you disagree with feminists, you have to fear for your life and freedoms #SemST", "Label": "against", "idx": 536}
{"Tweet": "Feminists are about equality between men and women as much as segregationists were about equality between blacks and whites #SemST", "Label": "against", "idx": 537}
{"Tweet": "As Chip Kidd announces the readers & asks us to hold their applause, the audience cant hold it back for @user #poetry #SemST", "Label": "none", "idx": 538}
{"Tweet": "Excited to hear author @user  Slut-Shaming in the Age ofthe Internet #slutshaming #SemST", "Label": "favor", "idx": 539}
{"Tweet": "#BeautyRant 7-Why have I been taught to hate my knock knees? Why must it be a compliment that you call me a \"yellow bone\"? #Beauty #SemST", "Label": "against", "idx": 540}
{"Tweet": "Always a delight to see chest-drumming alpha males hiss and scuttle backwards up the wall when a feminist enters the room. #manly #SemST", "Label": "favor", "idx": 541}
{"Tweet": "watching #BaltimoreRiots on Fox news, obvious feminist and her goony beardman following the reporter around for attention #SemST", "Label": "against", "idx": 542}
{"Tweet": "Anyone find it funny that #Feminists use #TakeitLikeAMan when they don't want to understand what it means to be one?  #SemST", "Label": "against", "idx": 543}
{"Tweet": "those who resist against feminism before us 2016 election, should not be killed. they should be raped to death ... #USElections #SemST", "Label": "favor", "idx": 544}
{"Tweet": "What the fuck do women even do? I mean seriously they're just useless other than sex.  #womensrights #Feminist #SemST", "Label": "against", "idx": 545}
{"Tweet": "@user And just because you can quote Simone doesn't mean you understand her. Modern femmie-nism is just whining. #SemST", "Label": "against", "idx": 546}
{"Tweet": "RT VivienneDenue: Code to hack and evil to destroy. Time to get back to work and kick some ass. #gamedev #femaleprotagonist #cybe... #SemST", "Label": "favor", "idx": 547}
{"Tweet": "RT @user My school taught us about the penis but never mentioned the clitoris #SemST", "Label": "favor", "idx": 548}
{"Tweet": "@user ...OR SLOW DOWN YOUR CAR TO YELL AT ME WHILE I WAIT FOR THE BUS!!! #WHATTHEACTUALFUCK #SemST", "Label": "against", "idx": 549}
{"Tweet": "Honoured to be followed by the truly inspirational @user founder of @user #realaustralianssaywelcome #thethingsthatmatter #SemST", "Label": "none", "idx": 550}
{"Tweet": "@user @user Agree 100 %! She radiates beauty from the inside out. Such a role model for all  #SemST", "Label": "favor", "idx": 551}
{"Tweet": "@user @user It's a sexist, misandrist whine-fest drenched in victimhood. #SemST", "Label": "against", "idx": 552}
{"Tweet": "Feminists tend to get upset & leave comedy clubs because humor is a form of intelligence they lack.  #GamerGate  #SemST", "Label": "against", "idx": 553}
{"Tweet": "Writing and wondering why ovarian and seminal aren't BOTH synonyms for original? #OppressedByThesaurus #OvariesBeforBrovaries #SemST", "Label": "against", "idx": 554}
{"Tweet": "Funny how it's not misogyny or objectification when feminists completely erase female agency to make an argument. @user #SemST", "Label": "against", "idx": 555}
{"Tweet": "@user @user @user that is true I can't compete with you #SemST", "Label": "none", "idx": 556}
{"Tweet": "If the confederate flag offends you, good. Stop making things #politicallycorrect #SemST", "Label": "none", "idx": 557}
{"Tweet": "@user Or...She's a grown 21st century woman who may do whatever pleases her! Especially with her fashion and body!  #SemST", "Label": "favor", "idx": 558}
{"Tweet": "If feminists spent 1/2 as much time reading papers as they do tumblr they would be real people, not ignorant sexist bigots. #SemST", "Label": "against", "idx": 559}
{"Tweet": "Gender norms my ass: definitely moved a few 40lb boxes in wedges #muscles #SemST", "Label": "against", "idx": 560}
{"Tweet": "I feel so self-conscious now. THAT'S what catcalls do. Not flattered, not pretty. I feel anxious and wanna go home. #SemST", "Label": "against", "idx": 561}
{"Tweet": "@user @user @user @user @user @user @user @user That's right. All sex is rape. #SemST", "Label": "none", "idx": 562}
{"Tweet": "the time for gender equality is NOW! #SemST", "Label": "favor", "idx": 563}
{"Tweet": "@user why do white women pretend to ne black, lies aboit dad & family instead going to the mental hospital? #SemST", "Label": "none", "idx": 564}
{"Tweet": "@user @user lmao at the fact you use a bunch of airbrushed fake ass celebrities  #SemST", "Label": "against", "idx": 565}
{"Tweet": "...OR SLOW DOWN YOUR CALL TO YELL AT ME WHILE I WAIT FOR THE BUS!!! #WHATTHEACTUALFUCK #SemST", "Label": "against", "idx": 566}
{"Tweet": "I hate feminism, give me a reason why I shouldn't. #feminist #notallmen #HeForShe #SemST", "Label": "against", "idx": 567}
{"Tweet": "Hey, all you #prolife-ers, if Socrates was born mortal, and his mother thus doomed him to die, is she a murderer? #SemST", "Label": "none", "idx": 568}
{"Tweet": "DEAR FEMINISTS  So I am a waste of time for not joining your feminist cult? Mormons say the same when close the door. #SemST", "Label": "against", "idx": 569}
{"Tweet": "CREATIONIST OK, you clearly don't know what the word of God is!  FEMINIST OK you clearly don't know what feminism is!  #SemST", "Label": "against", "idx": 570}
{"Tweet": "@user The Command-and-control mentality runs deep with #feminists. The Swedish Feminist Initiative is open with it #SemST", "Label": "against", "idx": 571}
{"Tweet": "@user psst, it can't get anymore equal so....now it is a joke!  #SpankAFeminist  #dontmancriminate  #feminist #SemST", "Label": "against", "idx": 572}
{"Tweet": "#narcissism another character trait of most #feminist convenience #SemST", "Label": "against", "idx": 573}
{"Tweet": "I guess what I am begging for at this point, is like, some really sexist views.. I know they are out there#FeministsAreUgly #SemST", "Label": "against", "idx": 574}
{"Tweet": "Anti-#gamergate people who say GG is about \"Zoe Quinn\" are defending domestic abuse.   #NotYourShield #WomenAgainstFeminis... #SemST", "Label": "against", "idx": 575}
{"Tweet": "Wonder what it'd be like to wear a dress and NOT be sexually harassed for it.  #YesAllWomen #SemST", "Label": "favor", "idx": 576}
{"Tweet": "If you wanna stay home and raise a family, that's cool. But that's your choice and nobody else's. #SemST", "Label": "favor", "idx": 577}
{"Tweet": "@user @user Bc feminists know everything about being a man. #SpankAFeminist #gamergate #SemST", "Label": "against", "idx": 578}
{"Tweet": "We live in a world where you're either a bitch or a doormat #SemST", "Label": "favor", "idx": 579}
{"Tweet": "DEAR FEMINISTS  Give a complete version of feminism, not the dictionary definition. Or what? No man-hate?  #GamerGate #SemST", "Label": "against", "idx": 580}
{"Tweet": "Just read a rather good article on females and their perceived/imposed limits throughout the education system and the work place #SemST", "Label": "favor", "idx": 581}
{"Tweet": "@user your tweet has made it to the cast of towie mate #SemST", "Label": "none", "idx": 582}
{"Tweet": "@user @user Bowing down but not in a threatening way. B/c even bowing down can be triggering. #SemST", "Label": "against", "idx": 583}
{"Tweet": "When there's a strong female lead and you get so so excited cause there's no gratuitous sexual violence #SemST", "Label": "against", "idx": 584}
{"Tweet": ".@cooImemegirl Feminists reject (or ignore the fight for) equality when it might hurt women. That's not equality, duh. #SemST", "Label": "against", "idx": 585}
{"Tweet": "WHO DO I GOTTA FUCK TO NEVER FEEL LIKE I GOTTA FUCK SOMEBODY? #SemST", "Label": "none", "idx": 586}
{"Tweet": "Yes women it's not fair that men staying at home is shamed by society. We must change ppl additudes  #everydaysexism #SemST", "Label": "favor", "idx": 587}
{"Tweet": "A woman is not a sex object. She's a person. #truth #wisdom #womensrights #media #life #humanity #love #society #SemST", "Label": "favor", "idx": 588}
{"Tweet": "Just heard the most inspiring interview w one of my heroines @user on @user #women #islam  #revolution #SemST", "Label": "favor", "idx": 589}
{"Tweet": ".@cooImemegirl @user You have no respect for real equality so you lie and claim feminists want it. #SemST", "Label": "against", "idx": 590}
{"Tweet": "I guess wanting and trying to make this world a better place for everyone makes me ugly. #feminist #SemST", "Label": "favor", "idx": 591}
{"Tweet": "The only thing ugly is the god damn opinions of the idiotic people who started this tag #SemST", "Label": "none", "idx": 592}
{"Tweet": "The lack intellectual integrity in a group of Atheists is easy to spot: just count their \"FeministAtheists\" #GamerGate #SemST", "Label": "against", "idx": 593}
{"Tweet": "What a real #Patriarchy and #RapeCulture looks like. #BeingFemaleInNigeria  #pjnet #GamerGate #SemST", "Label": "against", "idx": 594}
{"Tweet": "Women are shamed if they don't want children, but then told if they want to be payed equally they shouldn't have children at all. #SemST", "Label": "favor", "idx": 595}
{"Tweet": "The cutting and mutilation of my and my daughters' genitals is an expression of my #SemST", "Label": "favor", "idx": 596}
