{"Text": "Indians are shit but burgers only have broken English and ebonics to learn and still fail. Second thread in a row where a burger can't figure out you're and your", "Label": "hate", "idx": 0}
{"Text": "Why are people so dumb? The police were yelling at everyone to get out of the area yet people just stood there or recorded, guess they want to die.", "Label": "neutral", "idx": 1}
{"Text": "‚Äúeveryone wins‚Äù yeah except for the little girls you're trying to rape", "Label": "neutral", "idx": 2}
{"Text": "feminism and Islam are of the same spirit", "Label": "neutral", "idx": 3}
{"Text": "Ima fucking stab u up bruv. Fucking white prick bruv.. fucking racist.  Gammon", "Label": "hate", "idx": 4}
{"Text": "In the US that same game was called ten little Indians. I know.. It’s boring", "Label": "neutral", "idx": 5}
{"Text": "Those deaf people are like rats in dark places. They wouldn’t survive a day in post apocalypse event for sure, I would kick’em off to stole their supplies", "Label": "hate", "idx": 6}
{"Text": "Why are niggers superior athletically to all other races?", "Label": "hate", "idx": 7}
{"Text": "incoming racist people", "Label": "neutral", "idx": 8}
{"Text": "I hate being a man, wish I was a lady and no man on earth existed", "Label": "hate", "idx": 9}
{"Text": "No counting when Hispanics get probation if they do find them self in some trouble they get probation then get deported and if they come back boom there in violation of the probation we gave them but knowingly sent them back. Those rats are smart. Bunch of GOVERNMENT BULL SHIT", "Label": "hate", "idx": 10}
{"Text": "Fuck u anti muslims heartless assholes u will go to hell", "Label": "hate", "idx": 11}
{"Text": "Nice concept, good story but poor act. Try harder next time", "Label": "neutral", "idx": 12}
{"Text": "Did anybody actually know that h3h3 was a reaction channel", "Label": "neutral", "idx": 13}
{"Text": "For the song thing I’m white but I’ll say the nigga word when I’m singing songs but if I’\u0080\u0099m with a black person and it’s making them uncomfortable or they ask me to stop I would out of respect.", "Label": "neutral", "idx": 14}
{"Text": "Are you sure you are a girl? That wig on your legs say: I WANT TO BE A BOY", "Label": "hate", "idx": 15}
{"Text": "What the fuck stupid people !!!", "Label": "neutral", "idx": 16}
{"Text": "I hate white flour and white sugar. Are two of the three white deaths!!", "Label": "neutral", "idx": 17}
{"Text": "The power of Christ compels you! You demonic whore, you will feel the wrath of my petrol you wench!", "Label": "hate", "idx": 18}
{"Text": "My best friend is muslim. And he is the best man in the world", "Label": "neutral", "idx": 19}
{"Text": "Filthy Chinese ", "Label": "hate", "idx": 20}
{"Text": "I don't care what people say these two fuckers are lying,the Facts are stacked against them I hope they going to pay for this smere campaign", "Label": "neutral", "idx": 21}
{"Text": "when  a handsome man marries a man ..we are only bite fingers", "Label": "neutral", "idx": 22}
{"Text": "Beautiful in every way!", "Label": "neutral", "idx": 23}
{"Text": "Then the same people choosing the same answer", "Label": "neutral", "idx": 24}
{"Text": "even god hates dominicans. why else did he shit them out on the same monkey island as the haitians?", "Label": "hate", "idx": 25}
{"Text": "White chocolate and raspberry :)", "Label": "neutral", "idx": 26}
{"Text": "Christians are all demonic", "Label": "hate", "idx": 27}
{"Text": "Even watching it on screen feels intense....imagine what they would be feeling to witness this horror first hand. To just be there takes some courage, let alone even touching the dead.", "Label": "neutral", "idx": 28}
{"Text": "seriously, any arab or turks i've ever met had something to do with crime, either he or someone of his family.", "Label": "hate", "idx": 29}
{"Text": "Christians can get crazy religious and I get so f u c k i n g annoyed", "Label": "hate", "idx": 30}
{"Text": "why am i watching this", "Label": "neutral", "idx": 31}
{"Text": "Who gives a damn we have the ability an the freedom to b whoever the fuck we want to b", "Label": "neutral", "idx": 32}
{"Text": "The eye contact never lies", "Label": "neutral", "idx": 33}
{"Text": "On todays episode of \"Guess That Gender\"", "Label": "hate", "idx": 34}
{"Text": "japan only rejected 99 they should reject all those mother fuckers", "Label": "neutral", "idx": 35}
{"Text": "There isn't too little land, there isn't inefficient land use, there aren't too restrictive land use policies, there are TOO MANY PEOPLE.", "Label": "neutral", "idx": 36}
{"Text": "fat bitch....she need that black cucumber up her tight u know what....lmfaooo", "Label": "hate", "idx": 37}
{"Text": "Lots of Loving ppl in world but unfortunately due to presence of few percentage of dead souls Make world Look like Hell", "Label": "neutral", "idx": 38}
{"Text": "they could have shot him in the legs no one gets in risk of dying", "Label": "neutral", "idx": 39}
{"Text": "we take everyone, sudanese niggers, egyptian shitskins, palirats, syrian and iraqi scums, they're all dogs that behave like niggers, they cost too much, especially syrians, there is way too many of them here, they are arrogant ungrateful backstabbing apes.", "Label": "hate", "idx": 40}
{"Text": "Is that guy-shadow or are you just a genetic faggot?", "Label": "hate", "idx": 41}
{"Text": "We whites have higher IQ's than blacks, this is because IQ measures intelligence and we are the more evolved and superior race with a larger brain. ", "Label": "hate", "idx": 42}
{"Text": "I wish everyone had a father like him so loving and caring", "Label": "neutral", "idx": 43}
{"Text": "its a good thing im not a commander or so in the police force,specially not during something like this,because the jail would be full of ppl waiting to be deported,if not dead", "Label": "hate", "idx": 44}
{"Text": "Anxiety is is the definition of a human meme. Anxiety disorders are an excuse. No such thing.", "Label": "neutral", "idx": 45}
{"Text": "To the lady that can barely speak English and then look down upon her own people, that'\u0080\u0099s disgraceful.", "Label": "neutral", "idx": 46}
{"Text": "That skin colour is the funniest one in combination with your eyes is perfect stupid", "Label": "hate", "idx": 47}
{"Text": "When pain is a relief then something must be wrong", "Label": "neutral", "idx": 48}
{"Text": "Lgbt now spread in asia. Many anti lgbt in asian worried their culture are ruined cuz this virus", "Label": "hate", "idx": 49}
{"Text": "WHAT THE FUCK IS THIS ??!????! Disgusting! Absolutely disgusted and disappointed in Today'\u0099s America.", "Label": "neutral", "idx": 50}
{"Text": "True Heavy Metal! True Feeling", "Label": "neutral", "idx": 51}
{"Text": "So, in other words, women's rights are freedom from responsibility and men's rights are responsibility. Is she serious?", "Label": "neutral", "idx": 52}
{"Text": "People with traumatic brain injury should have the ability to get euthanatize", "Label": "hate", "idx": 53}
{"Text": "My grandma had a roommate who was a drag queen I had drag queen knwonledge at 11 and what was cool lol", "Label": "neutral", "idx": 54}
{"Text": "That girl still need a good ass whooping, stupid ass bitch!!", "Label": "hate", "idx": 55}
{"Text": "I don’t know what mental disorder this kid had, but I would not stand him for a sec. I had beat the fuck out of him", "Label": "hate", "idx": 56}
{"Text": "If I were your dad, I'd Google \"Abortions at 30 years old mentally handicapped”.", "Label": "hate", "idx": 57}
{"Text": " All values, unless otherwise stated, are in US dollars.\"", "Label": "neutral", "idx": 58}
{"Text": "Sophie walker, you are leader of nothing! You don'\u0099t have a solid topic just complaining...  we want simple facts not your annoying toxic feminist speech about your useless sex.", "Label": "hate", "idx": 59}
{"Text": "America is the greatest country. That aint lie you know that I know that", "Label": "neutral", "idx": 60}
{"Text": "Omg, Macklemore is iconic and I love him.", "Label": "neutral", "idx": 61}
{"Text": "Facing challenges is hard to go through.", "Label": "neutral", "idx": 62}
{"Text": "what civilized and nice cops", "Label": "neutral", "idx": 63}
{"Text": "Is this guy actually autistic or Is he faking it", "Label": "neutral", "idx": 64}
{"Text": "Actually THIS WEIRD PEOPLE are HARMFUL! They need medications. His mother should have know he is like this and to not deny it", "Label": "hate", "idx": 65}
{"Text": "Sorry but black Americans are more in danger than homosexuals. Homosexuals have so much privilege now. More than African Americans, Latinos, Arabs.", "Label": "neutral", "idx": 66}
{"Text": "Gosh you guys are getting less funny with each episode.", "Label": "neutral", "idx": 67}
{"Text": "Now they know better than this shit lol they dudes. The stronger sex. The man supremacy", "Label": "hate", "idx": 68}
{"Text": "all mental illnesses are awful and must be treated", "Label": "hate", "idx": 69}
{"Text": "Any lesbian that doesn't look like a complete hog actually wants to be with a man.", "Label": "hate", "idx": 70}
{"Text": "This is so sinful. It says it in the bible you dumb fucktards. Stop saying YOU WILL GO TO HEAVEN IF YOU ARE GAY. because you will not go to heaven. Trust me its a fucking choice my GF dated girls and I was her 2nd bf she dated like 12 girls and she is 100% straight. You can change to the right side :)", "Label": "hate", "idx": 71}
{"Text": "Just look at that crowd!!! ALL FAT WHITE TRASH OR METH ADDICTS", "Label": "hate", "idx": 72}
{"Text": "i like dead refugees on my shore√Ø¬ª¬ø", "Label": "hate", "idx": 73}
{"Text": "Whites smoke to much ciggssss and drugs shot those co. Down.. Just say no to drugs kids", "Label": "hate", "idx": 74}
{"Text": "apparently east Asians commit less crime than us......well this is because they are submissive conformist losers..WHITE POWER", "Label": "hate", "idx": 75}
{"Text": "When I was a kid I was never rough with girls. However, I was scratched, bitten and pushed by girls. I still have a small scar from one such incident.", "Label": "neutral", "idx": 76}
{"Text": "Just nuke the entire shi*hole country", "Label": "hate", "idx": 77}
{"Text": "You said he but still not convinced this is a male. A sorely lost hipster girl maybe though", "Label": "neutral", "idx": 78}
{"Text": "I guess God is white.... ", "Label": "hate", "idx": 79}
{"Text": "What would the abuser doing to her around the neck? Stupid dick (the abuser)", "Label": "neutral", "idx": 80}
{"Text": "Idiots as always. Religion is the most stupid thing you humans invented.", "Label": "hate", "idx": 81}
{"Text": "Two things are apparent: one, not a male and two, your ass is indeed sorry that it's been turned into a drive-in.", "Label": "hate", "idx": 82}
{"Text": "Lmfao that fat slob in the wheelchair", "Label": "hate", "idx": 83}
{"Text": "Send all these whiny black crybabies back to central Apefrica to live for just one month. They would be crying to come back to America where White people pamper and coddle them. Let's try the experiment one time.", "Label": "hate", "idx": 84}
{"Text": "My cousin has that, he's 7 but still can't talk properly like a 1 year old. He's sensitive to loud noise or crying noise. It's hard to talk to him but I still love him cuz he thinks of me as one of his favorite person besides his mother.", "Label": "neutral", "idx": 85}
{"Text": "b bl bla blac black or w wh whi white", "Label": "neutral", "idx": 86}
{"Text": " From the midnight sun where the hot springs blow", "Label": "neutral", "idx": 87}
{"Text": "How much is this lawyer getting paid to go through all of this? It's not that much money in the world to take up for this fool!", "Label": "neutral", "idx": 88}
{"Text": "hahahahahahahahaha europ fuck you fucking nazis", "Label": "hate", "idx": 89}
{"Text": "Come out of the closet, we know you're in there, we'll bury you. ", "Label": "hate", "idx": 90}
{"Text": "Lots of haters out there and for no reason at all", "Label": "neutral", "idx": 91}
{"Text": "Every time I see her with a hijab, niqab or burka or shit I fantasising of choking her to death with that facking piece of cloth", "Label": "hate", "idx": 92}
{"Text": "She said is christian. Well I now I want to bury her", "Label": "hate", "idx": 93}
{"Text": "Every girl on this planet curses her mother for their birth. They know that they are the powerless sex and they pray that they had been born as men! With dicks and stuff.", "Label": "hate", "idx": 94}
{"Text": "Finally figured out where that voiceclip came from... I'¬Ä¬ôm so happy", "Label": "neutral", "idx": 95}
{"Text": "You are a brave man.........for letting them keep the comments enabled", "Label": "neutral", "idx": 96}
{"Text": "I would fucking kill Jared leto", "Label": "neutral", "idx": 97}
{"Text": "Buy lethal guns ... Real ones, not toys!", "Label": "neutral", "idx": 98}
{"Text": "My God, the cancer is spreading", "Label": "neutral", "idx": 99}
{"Text": "And we have alot of Democrats who support this bullshit.  DRAIN THE SWAMP!", "Label": "neutral", "idx": 100}
{"Text": "I am white and I go to a school whare it is mostly black kids and I was made fun of just because of skin my best friend's mom dose not like me because I am white so .... I had to change schools", "Label": "neutral", "idx": 101}
{"Text": "Glenn is the type of Korean dude I’m fucking into. I love his weird eyes", "Label": "neutral", "idx": 102}
{"Text": "that was scripted right? please let that be scripted. No real human would have said any of those things", "Label": "neutral", "idx": 103}
{"Text": "I could not be as brave if I lost my son and husband, bless her strength and kind heart.", "Label": "neutral", "idx": 104}
{"Text": "Its a challenge can anyone do it in reality", "Label": "neutral", "idx": 105}
{"Text": "With a face like that I bet you could scare your HIV into remission.", "Label": "hate", "idx": 106}
{"Text": "Tell me now \"Whose the terrorists again \"???", "Label": "neutral", "idx": 107}
{"Text": "Brown people love white countries", "Label": "neutral", "idx": 108}
{"Text": " Don't say I'm not your type", "Label": "neutral", "idx": 109}
{"Text": "I have a schizophrenia and I fight alone", "Label": "neutral", "idx": 110}
{"Text": "Why the fuck would you ask Trump?", "Label": "neutral", "idx": 111}
{"Text": "Lol, you're not white, you're a Jew. Jews are the worst nation and they must be annihilated, so like you", "Label": "hate", "idx": 112}
{"Text": "You should know women's sports are a joke", "Label": "hate", "idx": 113}
{"Text": "Support from China , we also fight the cancer religion in Xinjiang , despite all the differences between our two races, we have one unite enemy that is Islam.", "Label": "hate", "idx": 114}
{"Text": "Don'\u0099t ever kill yourself no matter what other people think or say about you it just matters what you think about yourself and how you feel", "Label": "neutral", "idx": 115}
{"Text": "Do you know why he is smiling because there is no “excretion law” in New Zealand! The max sentence he will receive from a judge is no more than 27 years in prison! Is this justice? Or because Muslims lives don't matter!???  :(((", "Label": "neutral", "idx": 116}
{"Text": "GUN SHOT INA YU HEAD! NO MERCY!", "Label": "neutral", "idx": 117}
{"Text": "the only thing that annoys me is noisy neighbours and their music.", "Label": "neutral", "idx": 118}
{"Text": " I support trans people's rights to be free of discrimination, but biological males should not be allowed to compete against women in athletic competitions", "Label": "neutral", "idx": 119}
{"Text": "In my dream I wished you have died! Don't call yourself man, while talking like queen.", "Label": "hate", "idx": 120}
{"Text": "If theres any Jikook shippers who ship them romantically...LIKE THIS VID AND THE COMMENT NOW", "Label": "neutral", "idx": 121}
{"Text": "If you are from Germany I will call you Nazi or Hitler. Then ill protest to hang you", "Label": "hate", "idx": 122}
{"Text": "Generally speaking, most women are lazy and worthless not all, but most.", "Label": "hate", "idx": 123}
{"Text": "WTF this teacher should be expelled. That's no way to treat a disabled kid, specially an autistic one!", "Label": "neutral", "idx": 124}
{"Text": "Please don' come back filthy Caucasian. You can change to a snake next time. Keep  changing.", "Label": "hate", "idx": 125}
{"Text": "Go bleach yourself black pussy doll and then come talk to me", "Label": "hate", "idx": 126}
{"Text": "Equality should not apply on people of different religions except christianity.", "Label": "hate", "idx": 127}
{"Text": "This channel is more dangerous than Islam", "Label": "hate", "idx": 128}
{"Text": "Drink Bleach.", "Label": "neutral", "idx": 129}
{"Text": "If you are a fking queen, you can move in any direction. So please move away from the camera that was used to take this picture. That applies to every women", "Label": "neutral", "idx": 130}
{"Text": "If i were you I would inject lethal heroin to my ‚Äòsick' child immediately!", "Label": "hate", "idx": 131}
{"Text": "phuck white rasist ass people", "Label": "hate", "idx": 132}
{"Text": "All these problems men have, and no one will ever care.", "Label": "neutral", "idx": 133}
{"Text": "Be aware of the girl in class who doesn't know how to control her emotions because she doesn’t understand that it's not socially acceptable for someone her age to have an outburst.", "Label": "neutral", "idx": 134}
{"Text": "Beat that tranny's ass", "Label": "hate", "idx": 135}
{"Text": "All girls like you should have a pimp to guide them to successful prostitution", "Label": "hate", "idx": 136}
{"Text": "And that's how black people can be peaceful", "Label": "neutral", "idx": 137}
{"Text": "What a wonderful Angel wife. She is sooo beautiful inside and out. And he is very nice man too. This lady and a lady she is , has the most beautiful laughter i have ever heard in my whole life. This couple is what love is made of. Thankyou for this wonderful video.", "Label": "neutral", "idx": 138}
{"Text": "Fuck off niggers WV is full", "Label": "hate", "idx": 139}
{"Text": "I’d like to see a because I’m black compilation video", "Label": "neutral", "idx": 140}
{"Text": "Civil rights movement for transgendered people", "Label": "neutral", "idx": 141}
{"Text": "Islam is pig shit", "Label": "hate", "idx": 142}
{"Text": "As a black person, I think that rappers should stop putting the n-word in the song. Plus, you should be proud of being White. I am proud of being black, so..", "Label": "neutral", "idx": 143}
{"Text": "ABUSERS ARE NOT JUST MEN. THEY CAN BE WOMEN TOO", "Label": "neutral", "idx": 144}
{"Text": "Deport all niggers, spics, chinks and other undesirable from white nations. They don't belong in our white nations, they're invaders and enemy forces.", "Label": "hate", "idx": 145}
{"Text": "I remember that scene from the X-Files and it made me so mad √∞¬ü¬ò¬° Mulder WHY", "Label": "neutral", "idx": 146}
{"Text": "Slow down the cuts between shots. Way too fast.", "Label": "neutral", "idx": 147}
{"Text": "I see the depression caused her to gain more weight.", "Label": "neutral", "idx": 148}
{"Text": "what a disgusting man and disgusting religion. He admits that muslim buy all their wifes ! .pff...This is why all muslims are poor...islam keeps them stupid !", "Label": "hate", "idx": 149}
{"Text": "Don' worry guys men can easily win femmenism ..... Trust me every shit that invented by men was patterned by men .... There is no way women Gina win in future .....it's just smoke before fire", "Label": "hate", "idx": 150}
{"Text": "Fck  serbije  kill  them all", "Label": "hate", "idx": 151}
{"Text": "hey baby you look like tinkerbell luhlulhulhulhulhluh", "Label": "neutral", "idx": 152}
{"Text": "It's killing me seeing gays treated like that", "Label": "neutral", "idx": 153}
{"Text": "Racist ass white ass people", "Label": "hate", "idx": 154}
{"Text": "How can anyone be converted forcebly? What profits Christianity. May be Hindu groups are jealous of Christians up coming. They want Christians to be Hindu goons. Who is that tied saffron on forehead. Is he gaurdian of Hinduism like Shankar Acharya or Vivekananda?", "Label": "hate", "idx": 155}
{"Text": "Oh GOD YES!!!! Feel the shrapnel pierce through your skin, let the fire consume your flesh and lay lifeless on the unforgiving sand that seeps into your wounds. Your screams is what gives Murcia the fuck yeah in the most patriotic songs on earth. BURN IN HELL YOU GOATS !!!", "Label": "hate", "idx": 156}
{"Text": "The safest most civilised society in the world - Japan - has banned Islam.. coincidence?", "Label": "neutral", "idx": 157}
{"Text": "I wonder why they didn' throw the fire booms in that cult when those Muslims were inside. That would have been one hell of a BBQ.", "Label": "hate", "idx": 158}
{"Text": "Im going to choke you with your cross necklace idiotic religious pig", "Label": "hate", "idx": 159}
{"Text": "All muslims worship Satan¬ü¬ï¬ã 5 times a day", "Label": "hate", "idx": 160}
{"Text": "With her nose she can detect an immigration officer from 70 yards", "Label": "neutral", "idx": 161}
{"Text": "this actually makes me so angry. people are just stupidly looking for attention and want to make themselves feel like the most important human on earth. nobody pretends to have cancer or any dangerous physical illness too so why pretending to be “dEpReSsEd” and “aNxIoUs”. nobody should ever feel this way the way it really feels. He has no mental disorder, that’s a fact.", "Label": "neutral", "idx": 162}
{"Text": "People get views of a religion from other people opinion and deeds, just focus on yourself. This business is between you and your god. People who say islam is not peace, that's wrong. God didn't want this, it's not mentioned anywhere.", "Label": "neutral", "idx": 163}
{"Text": "Holy shit! Kill them all !", "Label": "neutral", "idx": 164}
{"Text": "I'm a bisexual but never had sex. I'm 31.", "Label": "neutral", "idx": 165}
{"Text": "Get proper translators idiot, he didn’t say that", "Label": "neutral", "idx": 166}
{"Text": "If you ever wake up one morning and want to smile because you're happy with being just who you are. Don't", "Label": "neutral", "idx": 167}
{"Text": "Look at these gay ass niggas. lol. Acting like they some bitches.", "Label": "hate", "idx": 168}
{"Text": "Do women born to be whores? Ot they develop it later", "Label": "hate", "idx": 169}
{"Text": "I like this lady. Seems like a role model for both men and women on how to have an open mind", "Label": "neutral", "idx": 170}
{"Text": "LILLY SINGH IS A QUEEN! Yay but when will be the next episode", "Label": "neutral", "idx": 171}
{"Text": "Video games without cars are awful. Piece of shits ", "Label": "neutral", "idx": 172}
{"Text": "All that effort to not look like those other basic attention whores, yet you're clearly still a massive attention whore.", "Label": "hate", "idx": 173}
{"Text": "My sons school had someone in doing a talk for autism awareness he himself was autisic. He made aware that animals can be autisic too and introduced a picture of his pug lola whom is also autisic which I found interesting.  My 10 year old son is autisic", "Label": "neutral", "idx": 174}
{"Text": "ANYONE who believes in religion blindly lacks the ability to critically think. Do you really want to follow rules made by people who can not critically think? Believe in your god, but have your own values.", "Label": "neutral", "idx": 175}
{"Text": "SEE THE BLACKS IN PARIS? THEY TRY TO PRETEND THEY ARE FRENCH,  the''men'' want one thing--to pimp out girls and women. The black women desire white men to pretend they are like white french wives but they are Africans. THEY DO NOT BLEND IN WITH WHITE SOCIETY.", "Label": "hate", "idx": 176}
{"Text": "ADIDAS for you means \"All Day I Dream About Snacks\"", "Label": "neutral", "idx": 177}
{"Text": "You can see the country is fertile and green.  just need the right governance", "Label": "neutral", "idx": 178}
{"Text": "So can I put a wig and run with girls?", "Label": "neutral", "idx": 179}
{"Text": "Maybe it's because you're autistic?? Wish you death", "Label": "hate", "idx": 180}
{"Text": "OMG Lucas !! Such a great kid, such a big grow", "Label": "neutral", "idx": 181}
{"Text": "But women aren't people, so it's fine!", "Label": "hate", "idx": 182}
{"Text": "That’s wrong! Even though they disagree with her beliefs, they have no right to put their hands on a woman", "Label": "neutral", "idx": 183}
{"Text": "I feel like they should give the reporter a pistol or something to protect himself", "Label": "neutral", "idx": 184}
{"Text": "I ship you guys please get back together", "Label": "neutral", "idx": 185}
{"Text": "Feminism is a very terrible disease ", "Label": "hate", "idx": 186}
{"Text": "You should be so meaner to dyslexic people.", "Label": "hate", "idx": 187}
{"Text": "Go fucking kill yourself and die already useless ugly pile of shit scumbag", "Label": "neutral", "idx": 188}
{"Text": "Dad doing her hair so cute !!!!", "Label": "neutral", "idx": 189}
{"Text": "transgenders need help...they are sick in the head. Civilization has messed up the world. Soon enough, people will claim to have the right to change to animals and it will be seen as human rights or right to choose", "Label": "hate", "idx": 190}
{"Text": "Fucking Canada...stupid. I think the cold shrinks their brains.", "Label": "hate", "idx": 191}
{"Text": "it takes a fat black bitch to say something super stupid", "Label": "hate", "idx": 192}
{"Text": "Im from the philippines. When i go outside the country, they think im chinese but does it matter to me? Nope. Asians who grew up and living in Asia dont make a big deal bout this. Not sure why in America it's a different story.", "Label": "neutral", "idx": 193}
{"Text": "SEND ALL GAYS TO HELL", "Label": "hate", "idx": 194}
{"Text": "EEEWWWWWWW TRANSGENDERS ARE FUCKING DISGUSTING", "Label": "hate", "idx": 195}
{"Text": "How do you wake up and think this is actually cool? Like do you honestly believe that the average person, who adheres to normal and basic societal rules, looks upon you respectably in any manner?", "Label": "neutral", "idx": 196}
{"Text": "how the fuck do you have a million subscribers you fucking twat", "Label": "neutral", "idx": 197}
{"Text": "As having friends whom are part of the LGBT+ community and being a supporter of them and I think this is awsome and in middle school", "Label": "neutral", "idx": 198}
{"Text": "all those dislikes are from fucking homophopes", "Label": "neutral", "idx": 199}
{"Text": "WE HATE OUR LEADERS. LEARN FROM EROPEANS AND LEARN FROM AMERICANS. THEY ARE BETTER THAN OUR LEADERS.WE ARE NOT ELECTING GOOD LEADRES WE ARE ELECTING CRIMINALS.", "Label": "neutral", "idx": 200}
{"Text": "This fuckhead makes me ashamed of being Jewish. Shit people like him are destroying everything  ", "Label": "neutral", "idx": 201}
{"Text": "I want people to throw Skittles at me at my wedding", "Label": "neutral", "idx": 202}
{"Text": "The only thing more repulsive than a nigger is a nigger faggot. Self-hating whites shower images of cross-dressed niggers with praise because the modern left fetishizes all forms of depravity.", "Label": "hate", "idx": 203}
{"Text": "Syria war is over they can go back its safe now.", "Label": "neutral", "idx": 204}
{"Text": "ABU DA BI ABA DU BA BA HAMUD! See? I’m an arab priest too. This is how they sound. right? They are jokes", "Label": "hate", "idx": 205}
{"Text": "So when i scroll down to read/leave a comment and scroll back up they blue like thumbs up goes away, it has done this 4 times in a row now. Hmm is it just a glitch or does YouTube remove it when they think you will just leave the video without checking? This happens a lot but only on channels like this.", "Label": "neutral", "idx": 206}
{"Text": "'\u009cNah cut it off Im sure I won'\u0099t regret it '\u009c", "Label": "neutral", "idx": 207}
{"Text": "Bruh I would fuckin love to film a video with Maurice man, he is like an older black version of me I swear to god", "Label": "neutral", "idx": 208}
{"Text": "Can' you all see how absurd it is? Calling all white people racist, calling all black people criminals, it's all the same. Why does race even matter? Why can' we judge terrible people not terrible white people?", "Label": "neutral", "idx": 209}
{"Text": "We aren't allowed to roast 12 year olds", "Label": "neutral", "idx": 210}
{"Text": "I WANT EVERYONE ELSE TO PAY FOR MY EDUCATION AND HEALTHCARE AND HOUSING, FUCK YOU WHITE PEOPLE GIVE ME YOUR MONEY WHITE PEOPLE FUCK", "Label": "hate", "idx": 211}
{"Text": "No body can change their biological sex, but they can change their gender.", "Label": "neutral", "idx": 212}
{"Text": "Kill these basterds, son of sluts who attack u in name of religion. Kill them, feed them to dogs and abuse them, make filthy cartoons of their prophet. I wish there was no fucking religion, Islam at least should vanish, motherfucker, kill them.", "Label": "hate", "idx": 213}
{"Text": "Aren’t you ashamed about your body colour?", "Label": "hate", "idx": 214}
{"Text": "He has lower iq than when water freezes", "Label": "neutral", "idx": 215}
{"Text": "He smiles while talking about drowning his own children", "Label": "neutral", "idx": 216}
{"Text": "Moldova is a country of masochists.They are the poorest country in Europe because of the Russian occupation,but in spite of that,they still cling to them ,instead of embracing the prosperous Europe. Not smart.", "Label": "hate", "idx": 217}
{"Text": "You should use your time to arrest murderers not little kids", "Label": "neutral", "idx": 218}
{"Text": "You look kinda dead inside, you parents must not haved loved you. ", "Label": "neutral", "idx": 219}
{"Text": "The Resistance avenge women and children killed by US and Allies !!!", "Label": "neutral", "idx": 220}
{"Text": "They don'\u0080\u0099t clean up the rubbish that they all throw on the floor the place looks a mess.", "Label": "neutral", "idx": 221}
{"Text": "Crazy fat religious bitch. Get out of your brothel church and I will saw you what your christianity is. You’ll meet your christ to heavens and hells ", "Label": "hate", "idx": 222}
{"Text": "These girls are so pretty seriously. Being autistic is such an interesting experience and I am happy to be autistic!", "Label": "neutral", "idx": 223}
{"Text": "Hey Sweden do you remember back in time when your men were vikings and acted around like they had a dick between their leg... BLOCKED", "Label": "hate", "idx": 224}
{"Text": "actually autism can make you a retard", "Label": "hate", "idx": 225}
{"Text": "When u two getting married? Kid in mind?", "Label": "neutral", "idx": 226}
{"Text": "Fat lesbians", "Label": "hate", "idx": 227}
{"Text": "Fuck this faggot. He's the disrespecting idiot brother in law that loves to start fights at family functions.You can't have conversations with assholes like him.", "Label": "hate", "idx": 228}
{"Text": "This is exactly how I feel like when I see a tranny like this disgusting af", "Label": "hate", "idx": 229}
{"Text": "Bulgars are Indo Europeans, Turks are not, you ignorant pakisven. Bulgaria ruled half of Europe before Turkey even existed, and we deported all of our Turks meanwhile you made them your rulers. Sven is a fake german country ruled by arabs.", "Label": "hate", "idx": 230}
{"Text": "You deserve way more subscribers . The shit you say is fucking gold.", "Label": "neutral", "idx": 231}
{"Text": "I thought kids with Down syndrome were not accepted by families!", "Label": "hate", "idx": 232}
{"Text": "What imaginary gender are you?", "Label": "hate", "idx": 233}
{"Text": "Poor women", "Label": "neutral", "idx": 234}
{"Text": "You really think that European People will like you if you humiliate Muslims? I think that's a big mistake because you're an Indian. I mean, they don' like you either so don' try to look cute. By the way, your accent sucks terribly my friend.", "Label": "hate", "idx": 235}
{"Text": "They are laughing and their countries are poor evil murderes and all corrupted good job.", "Label": "hate", "idx": 236}
{"Text": "I am possessed by deamons ", "Label": "neutral", "idx": 237}
{"Text": "LOVE IS LOVE!!! God excepts everyone. And when I mean everyone I mean everyone I'm a Christian and pan sexual I respect every single person in the lgbtq+ community.", "Label": "neutral", "idx": 238}
{"Text": "Wow does ur mom know how gay u are", "Label": "neutral", "idx": 239}
{"Text": "If you are not masculine then you are woman dude", "Label": "neutral", "idx": 240}
{"Text": "Kill those pig eaters fuck those americunts send them to hell", "Label": "hate", "idx": 241}
{"Text": "After using them as slaves for 100s of years and stealing their all natural resources ,now europe doesn't need them let them die .", "Label": "neutral", "idx": 242}
{"Text": "People with autism is so nice", "Label": "neutral", "idx": 243}
{"Text": "beeing gay is anti human", "Label": "hate", "idx": 244}
{"Text": "Taliban and all people with this thought must hanged", "Label": "hate", "idx": 245}
{"Text": "Holy shit I want to go to a wedding with eight pugs! Are you kidding me? Eight pugs?! That's fucking amazing and nobody can convince me otherwise.", "Label": "neutral", "idx": 246}
{"Text": "Those illegals want to sue the company for money owed.  What about the money they owe  America. It cost money to educated, medical care, welfare, ect.", "Label": "neutral", "idx": 247}
{"Text": "i think mental illness was romanticized for a long time already. Take an example from emos, tumblr and more. I think people are really influenced by famous people. It looks beautiful because celebrities seem to have a movie like life and people want to be special and end up being delusional.", "Label": "neutral", "idx": 248}
{"Text": "Weak beta male, hope he turns into a tranny after this traumatic experience, haha", "Label": "hate", "idx": 249}
{"Text": "Burn them all down and kick Islam out of EU...We support you...Fuck Islam.", "Label": "hate", "idx": 250}
{"Text": "For the static sound - what do you use for editing? I know it'¬Ä¬ôs annoying but if you use premiere pro you should be able to use decrackling to help a bit", "Label": "neutral", "idx": 251}
{"Text": "Ok so where the hell this Terrorist get guns and ammos??", "Label": "neutral", "idx": 252}
{"Text": "So proud of you mom, wish Allah give you strong. Just saying Alhamdulillah to your husband and your son, Allah give them mercy with a beautifull died. I am not supprising that you did not crying, because both your son and your husband did not die, they still alive in jannah, aamiin...", "Label": "neutral", "idx": 253}
{"Text": "This muslim with his pumped up hood better run better run, faster than my bullet", "Label": "hate", "idx": 254}
{"Text": "does your little sister know you are wearing her clothes bitch tits?", "Label": "neutral", "idx": 255}
{"Text": "It is time for Trump to find a natural death or somehow a bullet finds him and puts us out of his misery.", "Label": "neutral", "idx": 256}
{"Text": "When I see men running with those plastic legs I laugh my ass out so hard I fart some times", "Label": "hate", "idx": 257}
{"Text": "Kill ALL black people.", "Label": "hate", "idx": 258}
{"Text": "There is clearly written in Quran Person who not follow Quran is called kafir and.. Kill them you will get 72 hours Islam Is Terrorism", "Label": "hate", "idx": 259}
{"Text": "Crazy auntie get rid of your autistic son and make good to planet", "Label": "hate", "idx": 260}
{"Text": "Or maybe just don't follow degenerate sandnigger religions from the middle east?", "Label": "hate", "idx": 261}
{"Text": "Everyone hates you because you're gay", "Label": "hate", "idx": 262}
{"Text": "These people do not represent Islam!!", "Label": "neutral", "idx": 263}
{"Text": "Islam and Christianity have mixed for centuries so the idea that we cannot coexist is an ignorant idea.", "Label": "neutral", "idx": 264}
{"Text": "If I was your dad, I would have cut your penis and make you it, because it’s useless for you", "Label": "hate", "idx": 265}
{"Text": "I love watching this cross believers get killed in their god’s place. Ha ha ", "Label": "hate", "idx": 266}
{"Text": "why is it censored, why does todays generation get butt hurf and offended so easily, if u dont like it, keep walking then! this use to be a free country but its going down the toilet now.", "Label": "neutral", "idx": 267}
{"Text": "LOVE IS LOVE  ROSES ARE REDS VIOLET ARE BLUE HAPPINESS IS ALL COLOR'S  LESBIAN IS BLESSING  BISEXUAL IS BEAUTIFUL  GAY IS MARVELOUS! ROSES ARE RED VIOLETS ARE BLUE  IM GAY AND SO ARE YOU AND WE ARE HAPPY THAT WAY    DON'T BE RUDE BE RESPECTFUL FOR LGBTQ PEOPLE ITS LOVE AND LOVE IS AMAZINGLY IMPORTANT AND BEAUTIFUL WE ARE ALL HUMANS AND WE ALL LOVE NO MATTER WHAT", "Label": "neutral", "idx": 268}
{"Text": "well it's clear now why europeans can't differ niggers and shitskins from human", "Label": "hate", "idx": 269}
{"Text": "When you find out he has a girlfriend", "Label": "neutral", "idx": 270}
{"Text": "Ignorant feminist,  she got roasted and still doesn' understand what equality of outcome means even when Jordan explained data to her. What's this means she's ignorant and emotionally biased.", "Label": "hate", "idx": 271}
{"Text": "Equal pay message, um, says the guy who want socialism in the United States of America", "Label": "neutral", "idx": 272}
{"Text": "Wallmart employees are cunts. Hate them all", "Label": "neutral", "idx": 273}
{"Text": "People are scared of change and things they don't know or understand! There's good and bad in every race, religion and culture!", "Label": "neutral", "idx": 274}
{"Text": "Call that the Caitlyn Jenner syndrome.", "Label": "neutral", "idx": 275}
{"Text": "As an SJW, it is the right of black people to rob and kill me. To not allow them is a white privilege.", "Label": "hate", "idx": 276}
{"Text": "Dont do drugs kids...", "Label": "neutral", "idx": 277}
{"Text": "Iconic woman she'\u0099s done so much for the UN", "Label": "neutral", "idx": 278}
{"Text": "Gayness should be removed from the face of the earth", "Label": "hate", "idx": 279}
{"Text": "ive been trying to figure out which common american voter is more uniformed republican or democrat for years democrats do any of you have the slightest clue that obama has deported more mexicans than any other president in history", "Label": "neutral", "idx": 280}
{"Text": "this was shit the guy should of boxed his head off and thrown him through the top window,fuck peoado muhamed and islam", "Label": "hate", "idx": 281}
{"Text": "Support gay pride", "Label": "neutral", "idx": 282}
{"Text": "I don’t think you have the right to write comments or even express your opinion freely. Free speech is a human right. Autistics aren’t 100% humans", "Label": "hate", "idx": 283}
{"Text": "Hey dude. You re awesome. Pls teach me!!!", "Label": "neutral", "idx": 284}
{"Text": "Who was responsible for convincing these girls they were so pretty?", "Label": "neutral", "idx": 285}
{"Text": "I'\u0099m beginning to doubt your accuracy, I mean violent Canadians? That'\u0099s just absurd.", "Label": "neutral", "idx": 286}
{"Text": "One people. One nation. End migration.", "Label": "neutral", "idx": 287}
{"Text": "Thank you John, for sharing this experience with us, people. What I wanna say to refugees is, stay strong! Although our current president is... failing to help you, I will be there at Washington DC protesting for you. The people who suffered the most should be saved from evil!", "Label": "neutral", "idx": 288}
{"Text": "If your fucking with a cool female is all good but if your fucking with a bitch you need to break her ass and shake her ass", "Label": "hate", "idx": 289}
{"Text": "Kill every white people mercylessly.", "Label": "hate", "idx": 290}
{"Text": "Fake news fake news", "Label": "neutral", "idx": 291}
{"Text": "LMAO while watching this church burn", "Label": "hate", "idx": 292}
{"Text": "The brother is speaking the truth based on facts. In the U.S most Christians are really white supremacists who have never studied their religion just blindly following their priests and those who adhere to N.O.I. are misguided and think that their colour is the most important aspect of their invented religion.", "Label": "hate", "idx": 293}
{"Text": "This Korean bitch is like a pig. That’s how they made an army of sumos there in their shithole country", "Label": "hate", "idx": 294}
{"Text": "(((They))) will be chased out of every white country and hunted down like the animals they are for their evil schemes and plots", "Label": "hate", "idx": 295}
{"Text": "Do the world a favor and pour some bleach into that glass", "Label": "hate", "idx": 296}
{"Text": "At the end you literally described yourself as a gold digger", "Label": "neutral", "idx": 297}
{"Text": "I am so sorry for all the people who disrespect all you guys and I wish I could do something  so they wouldn'. But I can' but you guys know  I love all you guys.â\u009d¤", "Label": "neutral", "idx": 298}
{"Text": "If only there was a way to get children without having to get women pregnant we had them all ready killed", "Label": "hate", "idx": 299}
{"Text": "Our home-grown animals are infinitely preferable.", "Label": "neutral", "idx": 300}
{"Text": "I just want to sit down with both of them, buy them a drink, and just talk. I don't care what it's about, they just seem like people who must be great to have a conversation with.", "Label": "neutral", "idx": 301}
{"Text": "What episode number was this?", "Label": "neutral", "idx": 302}
{"Text": "What about a global massacre of men? Pussiezzz only girls", "Label": "hate", "idx": 303}
{"Text": "Wow feminists are real hypocrites so it'\u0099s OK for a woman to laugh at suicide attempts if it involves men but it'\u0099s not OK for men to laugh at suicide attempts if it involves women talk about your double standard", "Label": "hate", "idx": 304}
{"Text": "Too bad women don’t know how to kill themselves", "Label": "hate", "idx": 305}
{"Text": "Kill all muslims", "Label": "hate", "idx": 306}
{"Text": "Dalit? Is this a name of religion or an atom of poo composition", "Label": "hate", "idx": 307}
{"Text": "I don't have any facts, I don't have any Statistics, I am a Human Being The fuck is that even mean?", "Label": "neutral", "idx": 308}
{"Text": "You have the grace and composure of a rabid hyena", "Label": "neutral", "idx": 309}
{"Text": "Tell me where to ship this comfy electric chair for your kid", "Label": "neutral", "idx": 310}
{"Text": "or when the man walked up to the little girl with the gay pride flag i wanted to jump into the video and punch him but ya know thats assault", "Label": "hate", "idx": 311}
{"Text": "Christianity and mostly every religion was told to accept one another and give them respect doesn'\u0080\u0099t mean u have to change ur religion and ur opinion just give ur respect and they are equal to u and they are human", "Label": "neutral", "idx": 312}
{"Text": "The next time I like up in front of one like him I will shout to his left ear that he is a trash and worthless! HAHAHHAA. I know I’m a bad man. IM BADMAN", "Label": "neutral", "idx": 313}
{"Text": "American Indians are finally almost extinguished", "Label": "hate", "idx": 314}
{"Text": "You look like Sloth with deeper Down’s syndrome", "Label": "hate", "idx": 315}
{"Text": "I support lgbt… i want youre support for lgbt in pakistan", "Label": "neutral", "idx": 316}
{"Text": "Blacks are literally the cuckold of all the races and also the epitome of degeneracy. Don't listen and believe the Jewish propaganda of black being alpha. Consider yourselves as top of the social hierarchy by just being white.", "Label": "hate", "idx": 317}
{"Text": "After traumatic brain injury turned gay. I don't know which is worst. Suicide is the way.", "Label": "hate", "idx": 318}
{"Text": "People who say \"YAAAASSSS QUEEN\" should be sterilised", "Label": "neutral", "idx": 319}
{"Text": "He is complaining his rights are violated well maybe he shouldn' have come uninvited in our country", "Label": "neutral", "idx": 320}
{"Text": "Enough is Enough", "Label": "neutral", "idx": 321}
{"Text": "Some of the lyrics are wrong", "Label": "neutral", "idx": 322}
{"Text": "So sorry about this bombing attack in Manchester. Innocent people just died", "Label": "neutral", "idx": 323}
{"Text": "Hello I'm calling from tech support *with Indian accent*", "Label": "hate", "idx": 324}
{"Text": "why haven't you faggots taken the bi-pill yet", "Label": "hate", "idx": 325}
{"Text": "Ugly long chin brainless problematic mother fucker he looks retarded", "Label": "hate", "idx": 326}
{"Text": "Is that your nose or is that Thor's Hammer?", "Label": "hate", "idx": 327}
{"Text": "Looks like the gay poster boy with syphilis", "Label": "hate", "idx": 328}
{"Text": "Waitresses are cunts", "Label": "hate", "idx": 329}
{"Text": "We have to take our power back as the superior gender. ", "Label": "hate", "idx": 330}
{"Text": "The guy should feel shame to be gay. It is such a wrong choice. Bad influence on young people. Never seen being proud of being gay. It is like saying being proud of rapist. Awful !  The only time I am so disappointed at Trump. Under political pressure, he failed to stand up for the ground, the right thing !", "Label": "hate", "idx": 331}
{"Text": "I'm  heterosexual and African by birth, by breed and by character... and a very traditional man, Xhosa to be precise. But i still believe in human rights... we are all equal, whatever  religion, ethnicity, demography, tribe or language... we are all equal. And one day people will be free enough to love and date whoever they wanna without prejudice and judgment. 2019‚Ä¶Viva human rights viva", "Label": "neutral", "idx": 332}
{"Text": "She then suggests that the men who commented on her video should be killed.", "Label": "hate", "idx": 333}
{"Text": "Fucking idiots. Keep them out. They change the culture. Take over small towns. Vote in their own people to rule the town. And start enforcing their religious beliefs on everyone. It CANNOT FUCKING HAPPEN. Stop them now while you still can.", "Label": "hate", "idx": 334}
{"Text": "Really, I hope she get raped in the future. Raping women should be legal I think", "Label": "hate", "idx": 335}
{"Text": "Maybe I’m crazy. Maybe I’m not. I really don’t care if you try to fuck with my brain but ill stand strong bitch", "Label": "neutral", "idx": 336}
{"Text": "All people are fucked up because of these queer thing because y'all realize how shitty gender roles are and how absurd is to see it in reverse genders roles", "Label": "hate", "idx": 337}
{"Text": "Statistics show that if you support don lemon or you agree with him or if you think he'\u0099s intelligent then you'\u0099re overwhelmingly ignorant. Don'\u0099t blame me that'\u0099s just facts", "Label": "neutral", "idx": 338}
{"Text": "I’m searching for a hitman right now to kill this whore and every other like her. H A T E  W O M E N", "Label": "hate", "idx": 339}
{"Text": "All I know is that my disorder ruined my fucking life.", "Label": "neutral", "idx": 340}
{"Text": "Muslims want war! So take it to them first", "Label": "hate", "idx": 341}
{"Text": "I’m an arab and I can make a difference. And I see them as stylish people", "Label": "neutral", "idx": 342}
{"Text": "Dude don’t talk about your sex, nowadays it is considered as the degraded one. I think the same", "Label": "hate", "idx": 343}
{"Text": "Much love to you, thank you for your courage. Keep speaking your truth", "Label": "neutral", "idx": 344}
{"Text": "We need to exterminate people that subject children to such Perversion", "Label": "neutral", "idx": 345}
{"Text": "Incest baby that got double-down syndrome", "Label": "hate", "idx": 346}
{"Text": "I want to draw you something but I do not know where to send it. Do you have an instagram? ^^", "Label": "neutral", "idx": 347}
{"Text": "Now LGBT is okay in Islam. Go to get killed", "Label": "hate", "idx": 348}
{"Text": "The 100 people that disliked this are just salty that we are stealing your dates.", "Label": "neutral", "idx": 349}
{"Text": "well, looks like its time to have another child", "Label": "neutral", "idx": 350}
{"Text": "Now where are the feminists accusing of woman as demons abusing women all the time??", "Label": "neutral", "idx": 351}
{"Text": "My car is my love of my life. I fucking love this bitch. It's fast and it makes me feel complete ", "Label": "neutral", "idx": 352}
{"Text": "there's nowhere in the world where woman are equal. how about in all the places where they are president or prime minister or queen... how about in America, Australia, Canada, Britain, Scandinavia, France... shall I go on? Like honestly woman u live in an equal world. Stop being so self-obsessed and stop refusing to look at the facts. Women are already equal to men and have been for a long time.", "Label": "neutral", "idx": 353}
{"Text": "Fuck that shit this bitch ugly and she has a penis,oh hell nawww!!!", "Label": "hate", "idx": 354}
{"Text": "I'd love to destroy him but I am in more need of tech support.", "Label": "neutral", "idx": 355}
{"Text": "Try to talk to me about your senseless, inane god and you will meet him again as soon as possible thanks to my hand bitch", "Label": "hate", "idx": 356}
{"Text": "as someone who professionally diagnosed with mental illnesses I find it disrespectful and disgusting making a profit off it. making jokes is a different story for me though, I make jokes to help me cope but there'\u0080\u0099s a line between joking and being disrespectful.", "Label": "neutral", "idx": 357}
{"Text": "lowlife black animals", "Label": "hate", "idx": 358}
{"Text": "This homo faggot Spike Lee wore this at the Flopscers. Notice the blatant subliminal messages.", "Label": "hate", "idx": 359}
{"Text": "I feel like in an AI apocalypse the AI would kill all humans who couldn't serve their purpose, so disabled people like this one would probably go because they often can't work as effectively", "Label": "hate", "idx": 360}
{"Text": "I regret approaching that girl. Fuck our gynocentric society. I hate her and wish her to vanish like my feelings", "Label": "hate", "idx": 361}
{"Text": "They have the right to get there ass kicked all the way back across the border", "Label": "hate", "idx": 362}
{"Text": "He was so handsome in that era...he didn' use lipsticks at that time…", "Label": "neutral", "idx": 363}
{"Text": "The fact that shes only representing black lives seems kinda ironic to me. lol shouldnt it be all lives?… Not just black ones. She clearly thinks her race is more supirior she even admits shes racist, joking or not thats the only fact she said in the whole video.", "Label": "neutral", "idx": 364}
{"Text": "Bro just delete yo shit off YouTube rn. Fuck outta here with yo clout chasing ass.", "Label": "neutral", "idx": 365}
{"Text": "These women aren't autistic, they are smart, autistic people are retards, they make weird noises, they flap their hands. These people are not autistic.", "Label": "hate", "idx": 366}
{"Text": "If you search '\u0098couple goals'\u0099 there'\u0099s a picture of Danny & Aaron", "Label": "neutral", "idx": 367}
{"Text": "this the type of dude you see on chat roulette at 2:39am", "Label": "neutral", "idx": 368}
{"Text": "When she said '\u0080\u009c You complete me'\u0080\u009d I lost my shit.", "Label": "neutral", "idx": 369}
{"Text": "lesbians cant do math fucking mood lmao", "Label": "hate", "idx": 370}
{"Text": "Chinky filthy guy, get out of US. Get out of our land.", "Label": "hate", "idx": 371}
{"Text": "Just wanna know how the fuck did this show up on my home on YouTube. So damn disturbing..", "Label": "neutral", "idx": 372}
{"Text": "Is that the dude who walked into the room, kissed the girl on the cheek, then left?", "Label": "neutral", "idx": 373}
{"Text": "Indian Ned Flanders. You look like you professionally harrass subpar women on Facebook", "Label": "hate", "idx": 374}
{"Text": "I fear any future hate crime victim may well be labeled as just \"pulling a smollett\".", "Label": "neutral", "idx": 375}
{"Text": "Don't hit Women. Just fuck them and make them pregnant.", "Label": "hate", "idx": 376}
{"Text": "Fuck Sweden. Let it die like the degenerates they are!", "Label": "hate", "idx": 377}
{"Text": "Well im glad that i live in Serbia, migrants and islamists are not welcome here!", "Label": "hate", "idx": 378}
{"Text": "I have autism, yet i have alot of friends", "Label": "neutral", "idx": 379}
{"Text": "Islam is a religion of hate. These propaganda type videos are dishonest. Simply read the Quran and Hadith.", "Label": "hate", "idx": 380}
{"Text": "Always been impressed with how professional and non aggressive british cops are yet they still get the job done hats off American police need to take notes", "Label": "neutral", "idx": 381}
{"Text": "U SUCK SHIT YOU BLACK FUCK", "Label": "hate", "idx": 382}
{"Text": "CANCEROUS ugly tarded beings !(except lauren) DIE FUCKING ALREADY WASTE OFF WHORES NOBODY WILL MIS YOU UGLY DUMB TARDED WASTES OFF SPQCES √∞¬ü¬ò¬Ä FUCK women and Islam rights, don't like it here fuckoff and die √∞¬ü¬ò¬Ä", "Label": "hate", "idx": 383}
{"Text": "It's not guilt. It's stupidity on a scale unknown in human history.", "Label": "neutral", "idx": 384}
{"Text": "Well this is like exactly how I feel. Except I don'\u0099t want to be straight.", "Label": "neutral", "idx": 385}
{"Text": "Wish you cut your veins. Don’t shout out you have mental problems. Act. Cut them", "Label": "hate", "idx": 386}
{"Text": "Responsibility is something that needs to grow inside of everyone", "Label": "neutral", "idx": 387}
{"Text": "dunno if this makes me disabled but I have asthma so if there was any running or stairs involved then il just die from suffocation in my own lungs haha xxx", "Label": "neutral", "idx": 388}
{"Text": "What type of question it is???????", "Label": "neutral", "idx": 389}
{"Text": " And I can't stand another day", "Label": "neutral", "idx": 390}
{"Text": "I would beat the shit out of every Russian", "Label": "hate", "idx": 391}
{"Text": "There's a lot of confusion about male/female vs. masculine/feminine.  They don't always line up.   And nobody seems to ask why there are so many more male to female transexuals than female to male?", "Label": "neutral", "idx": 392}
{"Text": "I won’t let your Allah fuck my life. Convert to Christian or make your self and kids a favour and return back to your homelands", "Label": "hate", "idx": 393}
{"Text": "Child abuse, manipulation etc. What the hell are we transforming this world into??? How sick mind can people have and how stupid can others be to send their kids there???", "Label": "neutral", "idx": 394}
{"Text": "Black people are the most racist people I ever met. I√¢¬Ä¬ôm not even white, and I know this. Most blacks are racists!", "Label": "hate", "idx": 395}
{"Text": "Feminism is just about women crying about the fabricated bullshit they go through. It's a JOKE! They should just man up!", "Label": "hate", "idx": 396}
{"Text": "Love the videos", "Label": "neutral", "idx": 397}
{"Text": "I don’t hate those kids with these problems, but I’m just saying I feel very ver uncomfortable around them. They are weirdos. Don’t like them. Please god make my child a healthy and good one", "Label": "neutral", "idx": 398}
{"Text": "Homosexuality leads to death and extinction", "Label": "hate", "idx": 399}
{"Text": "I was just recently dancing in the club with this song oh man I was grabbing some ass that was blast next day my legs hurts so bad", "Label": "neutral", "idx": 400}
{"Text": "American people are dumbass. They don't even know geography", "Label": "hate", "idx": 401}
{"Text": "It numbs them to the disgusting degeneracy and fruitless hedonism of faggot sex", "Label": "hate", "idx": 402}
{"Text": "Can't tell if you're a pedophile victim or a pedophile.", "Label": "neutral", "idx": 403}
{"Text": "Should'¬Ä¬ôve set a bug bomb off and locked them in", "Label": "neutral", "idx": 404}
{"Text": "stupid dumb ass", "Label": "neutral", "idx": 405}
{"Text": "kill the gays", "Label": "hate", "idx": 406}
{"Text": "Well I'm an woman and I was born in Guatemala, Em... I dont see anything wrong with Guatemala.", "Label": "neutral", "idx": 407}
{"Text": "Even when at the income advantage, niggers still get btfo because your race are monkeys trying to do human things. They should be extinguished", "Label": "hate", "idx": 408}
{"Text": "Oh god F*CK I’m crying :’)", "Label": "neutral", "idx": 409}
{"Text": "I'm glad someone finally also brought light on the pay gap in asian countries (description of video) because frankly often it is only focused on the US where the pay gap is really small already compared to asian countries. (in the US it's about 6%)", "Label": "neutral", "idx": 410}
{"Text": "When your squad is complete shit in PUBG", "Label": "neutral", "idx": 411}
{"Text": "The blonde lady and the dude in the orange shirt had me quaking", "Label": "neutral", "idx": 412}
{"Text": "How can Europe allow millions of rapists animals to go there ?", "Label": "hate", "idx": 413}
{"Text": "Wait did the tiger get shot?", "Label": "neutral", "idx": 414}
{"Text": "Why don't they just use handicapped restrooms for the mentally challenged? Problem solved!", "Label": "hate", "idx": 415}
{"Text": "Conveniences are all the real", "Label": "neutral", "idx": 416}
{"Text": "Native Americans are a fucking joke. They did not have even a decent mother language. ", "Label": "hate", "idx": 417}
{"Text": "Arrest that fat ass bitch!", "Label": "hate", "idx": 418}
{"Text": "I'm a male I would fight for women rights because we all are human", "Label": "neutral", "idx": 419}
{"Text": "Mentally disabled people are fucking scary. Their disfigurements are very unnerving and strange and the fact that they have the mental capacity of a 5 year old makes them all the more threatening as you never know what they might do.", "Label": "hate", "idx": 420}
{"Text": "I would smack them also but I'\u0080\u0099d be homophobic and in jail with ya!", "Label": "hate", "idx": 421}
{"Text": "Head looks like a big ass jelly bean", "Label": "neutral", "idx": 422}
{"Text": "kneel down, white boy. its the era of brown people now", "Label": "hate", "idx": 423}
{"Text": "I don't understand why people get mad at the things that he says he has  A right to his opinion Just because he doesn't agree with you that does not make him a monster or evil person. It's annoying in 2018 on you to 2019 people are operating with an extremely sensitive Ignorant mindset if you don't agree with them", "Label": "neutral", "idx": 424}
{"Text": "lock women up at home . Female are just to stupid to understand anything .  Iam Agnostic .", "Label": "hate", "idx": 425}
{"Text": "In a world full of hate remember to light up the darkness, as this world is but temporary.", "Label": "neutral", "idx": 426}
{"Text": "destroy islam", "Label": "hate", "idx": 427}
{"Text": "God,my humble question to u almighty... Y u send them to earth to suffer?", "Label": "neutral", "idx": 428}
{"Text": "TERRORISTS ARE NOT ISLAMIC.........THEY ARE SATANIC......TERRORISTS INSULTING ISLAM KILL THOSE TERRORISTS......", "Label": "hate", "idx": 429}
{"Text": "Being blind would make me want suicide. Go kill yourself kid", "Label": "hate", "idx": 430}
{"Text": "All asian people look identical to this one. He is the mother of Asia", "Label": "neutral", "idx": 431}
{"Text": "Trans people=gays and loosers", "Label": "hate", "idx": 432}
{"Text": "I adore her voice. She is so talented. What a beat!", "Label": "neutral", "idx": 433}
{"Text": "why the hell is this Norwegian speaking about our LAWS? SPEAK FOR YOUR OWN Scandinavian scam", "Label": "hate", "idx": 434}
{"Text": "Children have no business developing their 'sexuality\". THEY ARE CHILDREN! LET THEM BE KIDS!", "Label": "neutral", "idx": 435}
{"Text": "If they are so much like family, why don' they treat them like family and sponsor thier petitions?", "Label": "neutral", "idx": 436}
{"Text": "Magnificient. Contrary to what the media reports, I have hope for the people of Europe to expel these leeches.", "Label": "hate", "idx": 437}
{"Text": "HE SHOT THE KID!?!? HE SHOT THE EFFIN KID!!!! BOI YOU BETTER SLEEP WITH ONE EYE OPEN BECAUSE IMMA WHOOP YOUR STUPID LITTLE BUTT TILL YOU WISH YOU WERE NEVER BORN YA HERE ME!!!! WITHERED SHALL BE AVENGED!!!!", "Label": "neutral", "idx": 438}
{"Text": "I hate every religion, but because of you I hate most of all your religion and its stupid theories about God and shits", "Label": "hate", "idx": 439}
{"Text": "FUCK THAT HOMO DUMB ASS PRICK!  SHOULDA LET HIM GET FUCKING EATEN!  ASSHOKE FUCKING WORTHLESS DICK.... NOBODY WOULD HAVE MISSED HIM!", "Label": "hate", "idx": 440}
{"Text": "I wish him the best, as well as his children.", "Label": "neutral", "idx": 441}
{"Text": "Can we get white people running MTV ? Or black people? Or even some filthy pakistanis? As long as it gets back to music, Anything would be better than the jews", "Label": "hate", "idx": 442}
{"Text": "I could just cuddle with him", "Label": "neutral", "idx": 443}
{"Text": "Women are made for making babies and cooking dinner and nothing else!!!", "Label": "hate", "idx": 444}
{"Text": "Asians have more fats so they are yellow.  So fat people are yellow?...", "Label": "hate", "idx": 445}
{"Text": "Feminist deserve to be miserable. What kind of man would want to live with a feminist? Silly me , of course,  a cuck.", "Label": "hate", "idx": 446}
{"Text": "gas yourself, you aussies are all retarded", "Label": "hate", "idx": 447}
{"Text": "IM GAY AND FUCKING PROUD FUCK BITCHES LIKE THESE PEOPLE", "Label": "neutral", "idx": 448}
{"Text": "Huh kids like this with crazy eyes and weird moves lurking around are scary. Please mama of this creeper cuff him and sent him to an asylum ", "Label": "neutral", "idx": 449}
{"Text": "GAYS WAS NEVER AFRICAN AND NEVER WILL BE SICK WHITE PEOPLE  GO FUCK EACH OTHER  LET US BE", "Label": "hate", "idx": 450}
{"Text": "Come and kill my wife", "Label": "hate", "idx": 451}
{"Text": "At that point you have a right to defend yourself... But the sad thing is I bet if he would have defended finale he would have gotten in trouble... Sadly he did the right thing but sufferd greatly...", "Label": "neutral", "idx": 452}
{"Text": "Yet there is vastly more money spent on breast cancer, than prostate cancer, this is lethal discrimination. ", "Label": "neutral", "idx": 453}
{"Text": "I very much appreciate the Asian woman's smarts.", "Label": "neutral", "idx": 454}
{"Text": "Short answer: if you are a murderer or child molester that is the natural choice.", "Label": "neutral", "idx": 455}
{"Text": "This time the tables have turned", "Label": "neutral", "idx": 456}
{"Text": "You can ask me to call you a male, but you'll always be a woman", "Label": "neutral", "idx": 457}
{"Text": "A man'\u0099s chance of getting cancer is 44% and 23% of men will die from cancer, 38% of women get cancer and 19% die.", "Label": "neutral", "idx": 458}
{"Text": "That's Hip Hop. Not the sh***t they bring today. Where are the critical minds of our time. If no one will come out I'll do it myself. Racism, Oppression, Hate still is very much there in 2019.", "Label": "neutral", "idx": 459}
{"Text": "Im bisexual but im not looking to hook up with whatever. And i havent come out yet. Im scared, really scared.", "Label": "neutral", "idx": 460}
{"Text": "I wish HIV to your butthole male whore", "Label": "hate", "idx": 461}
{"Text": "These were the days!", "Label": "neutral", "idx": 462}
{"Text": "Awful. Such a terror coming from nowhere. Felt for him", "Label": "neutral", "idx": 463}
{"Text": "Transgenders have to protect each other, not fight each other", "Label": "neutral", "idx": 464}
{"Text": "Islam is a horrible religion and does no good for society as a whole........ Horrible! Horrible! Horrible!", "Label": "hate", "idx": 465}
{"Text": "What happened to rap? This right here.... This is rap ", "Label": "neutral", "idx": 466}
{"Text": "Deport him in military aircraft and dump him back where he is originated from. Him and his family", "Label": "neutral", "idx": 467}
{"Text": "That's their problem and no one should interfere with their own way of life. If someone is unhappy they can try to escape.", "Label": "neutral", "idx": 468}
{"Text": "Absolutely excellent as ever, and yes, cycling is fabulous for mental health.. bike when you'¬Ä¬ôre happy, bike when you'¬Ä¬ôre sad, shout at the rain, scream inwardly at a complex hill climb and get that endorphin rush from being outside.. and smile at your fellow cyclists (and passing chickens, in my experience, a wee bwark at a chook makes many things better)", "Label": "neutral", "idx": 469}
{"Text": "If they see the bully bulling her i would be     Hey here is the middle finger and i would record what they did so the can get in real trouble", "Label": "neutral", "idx": 470}
{"Text": "There was a protest today in Birmingham against hate. It was so great to see Muslims and Gays marching together in unity.", "Label": "hate", "idx": 471}
{"Text": "They are the most calm and patient police ever, also, did the bald police man just get stabbed?", "Label": "neutral", "idx": 472}
{"Text": "Islam is  the home of terriorism .", "Label": "hate", "idx": 473}
{"Text": "The problem here is that the people don't listen to the people. I feel as if people on both sides would actually listen to one another they would learn something.", "Label": "neutral", "idx": 474}
{"Text": "I fucking hate gay and lesbians they are all animals", "Label": "hate", "idx": 475}
{"Text": "Fat bastard we won' forget you. Vets will kick your ass when caught", "Label": "neutral", "idx": 476}
{"Text": "That is a lot of really dumb people in one room. Wow", "Label": "neutral", "idx": 477}
{"Text": "I pray to the god of the heavens and the Earth bless the victims of Boko Haram.", "Label": "neutral", "idx": 478}
{"Text": "WOW THIS GUY TALKS LIKE A RETARD HAHAHAHAHAH", "Label": "hate", "idx": 479}
{"Text": "Apple is trying to be that one company that the whole world basically depends on in the future. (You know, those future movies where one company does everything.)", "Label": "neutral", "idx": 480}
{"Text": "It should be humanity first before any country", "Label": "neutral", "idx": 481}
{"Text": "I’m very sad about this fucking situation with all this muslims", "Label": "neutral", "idx": 482}
{"Text": "Didn’t know shitted coloured like you could talk", "Label": "neutral", "idx": 483}
{"Text": "Just shoot her, one less of them to have to deal with in the future.", "Label": "neutral", "idx": 484}
{"Text": "I dare you to choke her next time. Every one of them", "Label": "hate", "idx": 485}
{"Text": "Red pill activism should be a thing.", "Label": "neutral", "idx": 486}
{"Text": "i don't blame texas, trans should be looked down upon", "Label": "hate", "idx": 487}
{"Text": "I am proud to be white I cant believe that some of these people said that they weren't proud to be white?? I'm proud to be white. I didn't choose my race, so just own it. Be proud to be what your are. You're black? Be proud to be black. Being proud of one's race/culture isn't exclusive to just POC or anyone else. Again, you are what you are so just own it.", "Label": "neutral", "idx": 488}
{"Text": "Disabled kids are annoying and not cute.", "Label": "hate", "idx": 489}
{"Text": "congratu-fuckin-lations to all the pitbull owners who make it by without getting bitten. DO NOT ENCOURAGE PEOPLE TO FOLLOW IN YOUR FOOTSTEPS. i know people whose lives have been RUINED by these animals. regardless of your ''PACK MENTALITY'' these dogs are rage machines and your dodgeing a bullet every day they dont hurt your family.", "Label": "neutral", "idx": 490}
{"Text": "Throwing stones to paraplegic kids is my favourite hobby", "Label": "hate", "idx": 491}
{"Text": "Love being roasted", "Label": "neutral", "idx": 492}
{"Text": "Women are our property. The sooner they realize that, the better.", "Label": "hate", "idx": 493}
{"Text": "Wow why are these comments soo cruel and people muslims are like other religions and we should respect it!  WE NEED RIGHTS FOR MUSLIMS!!!!", "Label": "neutral", "idx": 494}
{"Text": "Syria has a religion problem.", "Label": "hate", "idx": 495}
{"Text": "The girl in the thumbnail looks badass", "Label": "neutral", "idx": 496}
{"Text": "The worst nightmare for people of Paris, Europe and World in general. Devastated by this monstrous act. I hope death to the fucking culprits. Die to hell", "Label": "hate", "idx": 497}
{"Text": "Victimizing yourself doesn’t help", "Label": "neutral", "idx": 498}
{"Text": "This cop had to get him under arrest for walking like that freely out in public. Problematics must be stay home locked. Sue her parents.", "Label": "neutral", "idx": 499}
{"Text": "this is probably the first time i’ve seen someone who looks like a child and pedophile at the same time", "Label": "neutral", "idx": 500}
{"Text": "We are proud to be an Indian Muslim", "Label": "neutral", "idx": 501}
{"Text": " Sorry that I was born as an Indian... ", "Label": "neutral", "idx": 502}
{"Text": "Pokemon is the best game ever", "Label": "neutral", "idx": 503}
{"Text": "The rotten, nasty bastards!", "Label": "neutral", "idx": 504}
{"Text": "If men shouldnt hit women because we are physically stronnger... then women shouldnt talk because they are fucking louder.", "Label": "hate", "idx": 505}
{"Text": "Goosebumps when the beat drops üòä", "Label": "neutral", "idx": 506}
{"Text": "Yo, if I’m going to hell for being homosexual, why did god make me like this?", "Label": "neutral", "idx": 507}
{"Text": "If your face was used on the inside of a jack-in-the-box there would be an epidemic of children dying from shock and disgust.", "Label": "neutral", "idx": 508}
{"Text": "People are individuals.  Look at character and behavior, obviously. Race? Meh. That tells you a genetic geographical trait, and that's about it.", "Label": "neutral", "idx": 509}
{"Text": "There was one facility opened in the US to provide shelter for abused men. Feminist protested until it was closed. Now there are none.", "Label": "neutral", "idx": 510}
{"Text": "All of these clueless reporters comparing themselves to Cronkite and Edward R. Murrow and they can't even get through a teleprompter read-through without hitting the floor.", "Label": "neutral", "idx": 511}
{"Text": "these videos may already feel long but their responses are cut so short and not given a true voice. I would love if you produced fuller videos so we, the viewers, can really hear what these people have to say because these are all topics that are not common among today’\u0099s people. It'\u0080\u0099s rewarding to hear insight from both sides no matter the topic.", "Label": "neutral", "idx": 512}
{"Text": "The degree of improvement is amazing. My father donated stem cells to my uncle and cured his lymphoma. Stem cells are the future of medicine.", "Label": "neutral", "idx": 513}
{"Text": "Dessert human garbage coming to eurabia", "Label": "neutral", "idx": 514}
{"Text": "fucking monkeys kill them all", "Label": "hate", "idx": 515}
{"Text": "I can spot a hitler in your blood. Aren’t you a German dude?", "Label": "hate", "idx": 516}
{"Text": "Smack that bitch up - mouthy African cunt", "Label": "hate", "idx": 517}
{"Text": "Why do negroes tear down their own neighborhoods when a black thug gets killed by law enforcement? Must be because of low IQ.", "Label": "hate", "idx": 518}
{"Text": "FUCKING migrants need BAN . fucking animals", "Label": "hate", "idx": 519}
{"Text": "Sorry, unlike Germany, I do not incinerate the mentally disabled.", "Label": "hate", "idx": 520}
{"Text": "Lmao, fucking hilarious", "Label": "neutral", "idx": 521}
{"Text": "Michael Jackson sick man and sick fans.", "Label": "neutral", "idx": 522}
{"Text": "Who do you think you are cunt? wtf! Stay steady to aim for head little christian rat", "Label": "hate", "idx": 523}
{"Text": "Not only the politicians are going into the wood chippers but also the police.", "Label": "neutral", "idx": 524}
{"Text": "STOP PUTTING THIS IN MY RECOMMEND WTF I'M NOT GAY", "Label": "neutral", "idx": 525}
{"Text": "Hope you fucking die bitches gay people should not exist all you do is lick one another's ass", "Label": "hate", "idx": 526}
{"Text": "Disgusting sick queer kill yourself", "Label": "hate", "idx": 527}
{"Text": "I think brown, black or dark-skinned people do choose to be slaves even now in 2019. He knows it is not superior to white dudes", "Label": "hate", "idx": 528}
{"Text": "what happened in the good old days when these freaks did not exist ? which sewer have these freaks dragged themselves out of ? its just a manufactured group of freaks who want to cut their cocks off and take it up the arse in the hope that the world will treat them as woman . it takes more than that to be a woman . stop pandering to these twats .", "Label": "hate", "idx": 529}
{"Text": "citronella is a great venezuelan repellent", "Label": "neutral", "idx": 530}
{"Text": "She is flawless. omfg", "Label": "neutral", "idx": 531}
{"Text": "I'm a British born Muslim who helps Slovakians and other immigrants from that region. My faith has taught me to respect and honour.   These are strange times.", "Label": "neutral", "idx": 532}
{"Text": "Beware LBGQ community Shari Law is coming you guys will have to go back in closet to save your heads.", "Label": "hate", "idx": 533}
{"Text": "why does that african american monkey hold gun like that?", "Label": "hate", "idx": 534}
{"Text": "We are not these bodies. We are spirit souls.", "Label": "neutral", "idx": 535}
{"Text": "By calling period, a natural procedure, as an excuse it degrades their gender. I suppose I agree with that though they are degraded anyways", "Label": "hate", "idx": 536}
{"Text": "Only a fag doesn't want to see two chicks do it, you don't want your son to grow up to be a fag right?", "Label": "hate", "idx": 537}
{"Text": "In the UK, there is a maximum of five years prison sentence for this abuse .. whether male or female!  It is non-gender specific.  It does not matter who abuses the most, it happens to both genders, and the law does not discriminate by gender", "Label": "neutral", "idx": 538}
{"Text": "This is S-I-C-K If I ever seen a Girlyman like him go into the same lavatory as my wife, or daughter somebody better call the EMTs because the ONLY way SheHe is coming out will be on a Stretcher, or in a body bag! Just sayin..........", "Label": "hate", "idx": 539}
{"Text": "Do lesbians know what a bra is? It's always the fat ugly ones  who pick a fight.", "Label": "hate", "idx": 540}
{"Text": "Certainly you can. You can make it illegal to use them. Boom. Done. It's solved.", "Label": "neutral", "idx": 541}
{"Text": "Every time that blonde lady talks I loose twenty brain cells", "Label": "neutral", "idx": 542}
{"Text": "they are all fucking assholes", "Label": "neutral", "idx": 543}
{"Text": "EXECUTE OHOMO AND HIS SHEMALE BITCH MIKE.", "Label": "hate", "idx": 544}
{"Text": "how about you get real with your fake fucking selves and tell the truth that the normal minded society are the ones being discriminated against you pieces of pig shit i cant stand fake fucking cowards who lie constantly and too much of a bitch to be honest", "Label": "neutral", "idx": 545}
{"Text": "Anyone should leave their partner at the very first sign of abuse", "Label": "neutral", "idx": 546}
{"Text": "I would order a bucket of ice cold water so I can pour it on him", "Label": "neutral", "idx": 547}
{"Text": "the guy (guessing) in the wheelchair was so sweet awh!!", "Label": "neutral", "idx": 548}
{"Text": "Killing me to see gays treated like that. I think lesbians are being more privileged by people", "Label": "hate", "idx": 549}
{"Text": "Anyone who listens to rap and is white is not part of the ethnostate and will be put to death.", "Label": "hate", "idx": 550}
{"Text": "In that case we should hire more women. Because we can them lesser and get a profit.", "Label": "neutral", "idx": 551}
{"Text": "Well this comment sections pretty... mental", "Label": "neutral", "idx": 552}
{"Text": "MASS BLACK WORLDWIDE GENOCIDE IS OUR ONLY HOPE", "Label": "hate", "idx": 553}
{"Text": "I propose suicide for evert politician", "Label": "neutral", "idx": 554}
{"Text": "Good for him! That's an EDUCATED man, right there!", "Label": "neutral", "idx": 555}
{"Text": "Something I hate about being bisexual..people always say '\u009cyour either gay or your straight,bisexual isn'\u0099t a real thing’\u009d SHUT DA FUQ UP IT IS A REAL THING", "Label": "neutral", "idx": 556}
{"Text": "There's not anything to refute because its just a massive cope lol.", "Label": "neutral", "idx": 557}
{"Text": "This literally made my emotional bi ass cry", "Label": "neutral", "idx": 558}
{"Text": "How is it to have a kid acting like a sloth or like a pug dog? Isn’t it hard? In your place I’d put it in a dedicated institute for problematics and pay a visit each year at max", "Label": "hate", "idx": 559}
{"Text": "The most peaceful religions came from India like Buddhism, jainism etc.", "Label": "neutral", "idx": 560}
{"Text": "the engagement ring story outrages me more than it should have.", "Label": "neutral", "idx": 561}
{"Text": "It's so sick and sad that young people will think of the concept of clout like rap niggers invented it because they aren't even properly taught about the english language anymore.", "Label": "hate", "idx": 562}
{"Text": "The pure misery in these men’s eyes it’s heart breaking. God bless them!", "Label": "neutral", "idx": 563}
{"Text": "That's what we should do here in a Us survey take them to FEMA camps and put the gas on these people are not coming from starvation destitute bad areas look how they're dressed their well-dressed well fed it's like a trojan horse and it's time we put them in the penal camps and get rid of them make use of the FEMA camp", "Label": "hate", "idx": 564}
{"Text": "Men can see beauty, so they don't want to sleep with black women or make goblin babies.", "Label": "hate", "idx": 565}
{"Text": "Black women are strong as hell", "Label": "neutral", "idx": 566}
{"Text": "stupid black women,if i were in that restaurant, i would had whipped their ass", "Label": "hate", "idx": 567}
{"Text": "can we not fucking explain the whole song and just appreciate billie's voice? she's a fucking angel man and she doesn' need explanations about her songs. just listen, and enjoy it.", "Label": "neutral", "idx": 568}
{"Text": "Abortion is a solution for autism", "Label": "hate", "idx": 569}
{"Text": "The Veil of Isis is also a great song by The Sword.", "Label": "neutral", "idx": 570}
{"Text": "Jews are lower class pigs.", "Label": "hate", "idx": 571}
{"Text": "Women!!! Grow a pair and refuse to compete with men!!! This is asinine!", "Label": "hate", "idx": 572}
{"Text": "When lift your arms do your ‚Äúboobs‚Äù go away? They look like mosquito bites and I feel like you were trying for the ‚Äòhot librarian' look but ended up with the ‚Äòold librarian' look.", "Label": "neutral", "idx": 573}
{"Text": "It'\u0099s like you can'\u0099t do anything without someone saying it'\u0099s wrong cause of other people ,it'\u0099s a joke people.", "Label": "neutral", "idx": 574}
{"Text": "Damn that made me laugh!", "Label": "neutral", "idx": 575}
{"Text": "They should have beat his ass. He deserves it.", "Label": "neutral", "idx": 576}
{"Text": "I just love hypocrisy. Am I sick?", "Label": "neutral", "idx": 577}
{"Text": "Homosexuality and transgenderism is a mental illness and a sexual perversion!", "Label": "hate", "idx": 578}
{"Text": "Beautiful pink dress. Your skin is so beautiful. Your face is so pretty. Your eyes are so sexy. Your lips are so sexy. Your lipstick is perfect.", "Label": "neutral", "idx": 579}
{"Text": "Ugh, my heart hurt for her when she was talking about how the troll comments hurt her.  You can see the love she has for him; it radiates from her.", "Label": "neutral", "idx": 580}
{"Text": "I read the title and immediately was ready to kill", "Label": "neutral", "idx": 581}
{"Text": "They'\u0080\u0099ll get to know homosexuality anyways. I don'\u0080\u0099t get what'\u0080\u0099s wrong with most of the people nowadays. If you don'\u0080\u0099t teach about homosexuality then stop teaching about heterosexuality also.", "Label": "neutral", "idx": 582}
{"Text": "People hate you People think your ugly  People think your a horrible person Well guess what   No ones name is people", "Label": "neutral", "idx": 583}
{"Text": "Yo nigga go back to Asia", "Label": "hate", "idx": 584}
{"Text": "I cant understand why someone would think it's ok to bullie someone", "Label": "neutral", "idx": 585}
{"Text": "STOP. DRINKING. COW. MILK.  Do people realize that for a cow to produce milk it has to get pregnant? and for people to have such milk the calf cant consume any of it? Do they realize that puss and blood is found in milk and that the milk at the grocery store is only 5 to 10% milk and the rest is just powder and water?  Gross.", "Label": "neutral", "idx": 586}
{"Text": "Good Muslims deserved attack and damage", "Label": "hate", "idx": 587}
{"Text": "Put a woman to abuse that fat woman and don’t put a kind guy", "Label": "hate", "idx": 588}
{"Text": "Surprised that the burqa is banned in Belgium, but not in Poland where they are is much more looked-down upon. Kill them", "Label": "hate", "idx": 589}
{"Text": "It's simple. Ask a person if they're Asian. If the first words out of their mouths are anything other than yes, they are not Asian", "Label": "neutral", "idx": 590}
{"Text": "People with barbaric cultures and desert religions are all the same.", "Label": "neutral", "idx": 591}
{"Text": "Salute to Taliban Mujahideen. We Pakistanis are strongly supporting you. Go crush america and kill those bastards. Allah u Akbar. Victory will be yours Insha Allah.", "Label": "hate", "idx": 592}
{"Text": "Women deserve to be abused, I guess.", "Label": "hate", "idx": 593}
{"Text": "Id beat the fuck out of his ass if he wasnt an actor", "Label": "neutral", "idx": 594}
{"Text": "I can smell the failure through my phone screen", "Label": "neutral", "idx": 595}
{"Text": "That fucking black cunt gets fucking cross hairs on the fucking head! Look I owe not shit to anyone who dosent owe me!!! LOOK WHORE!! FUCK YOU TO DEATH!!! 11 PERCENTILE AND FALLING!! WHORE BLACK RACIST WHORE! TAKE THE RED PILL!", "Label": "hate", "idx": 596}
{"Text": "This is a staged scene there is no license plate on this truck and it is a refrigerated trailer look at the facts people you can't drive a commercial truck down the roads of Texas without a dot cop pulling you over don' be fooled this whole thing doesn’t add up", "Label": "neutral", "idx": 597}
{"Text": "I don't care if he's Black white green Or Purple.  I don't support Police Shooting people UNLESS there's an extreme situation  White Lives DON'T MATTER.", "Label": "hate", "idx": 598}
{"Text": "I'm sick and tired of this black and white thing....can't we just stop and let's be happy for just one day.....we are all one let's stop this please... One love and peace.", "Label": "neutral", "idx": 599}
{"Text": "Girl:(anxiety attack)  Dog: you good bro?", "Label": "neutral", "idx": 600}
{"Text": "It's that nerdy guy from the polar express.", "Label": "neutral", "idx": 601}
{"Text": "Great video! Thank you √∞¬ü¬ô¬è", "Label": "neutral", "idx": 602}
{"Text": "I mean it's great that you're proving that Asians are devolving, but you didn't finish making my iPhone...", "Label": "hate", "idx": 603}
{"Text": "You make me wanna hit the gym. Thicker than a damn snicker dammit!", "Label": "neutral", "idx": 604}
{"Text": "guy is low IQ af", "Label": "neutral", "idx": 605}
{"Text": "There are so many errors XD", "Label": "neutral", "idx": 606}
{"Text": "The world before white people. 1 word 8 letters. PEACEFUL", "Label": "hate", "idx": 607}
{"Text": "This is what happens when you'\u0080\u0099re a bitch and a cunt.  Looks like that guy called it correctly.  Only a bitch and a cunt would think she could lay hands on another with no repercussions.   Maybe after that seizure she won'\u0080\u0099t be as much of a bitchy cunt.", "Label": "hate", "idx": 608}
{"Text": "My fav is to ask her out, explicitly defining it as a date.  Try it. It works.", "Label": "neutral", "idx": 609}
{"Text": "Fuck these generate vodka niggers. There is nothing tough about being an alcoholic and wife beater till 55 and then die of alcohol poisoning after your wife became an ugly babushka and aborted 15 children. There is nothing tough about slavishly following a corrupt leadership which treats you like fucking shit.", "Label": "hate", "idx": 610}
{"Text": "buddhism and its people reminds off cows. ", "Label": "hate", "idx": 611}
{"Text": "broke my heart to see the young boy claim his allegiance", "Label": "neutral", "idx": 612}
{"Text": "Shemales are paranormal creatures. We shouldn't let them be free. Neither be captured. Just dead and buried already", "Label": "hate", "idx": 613}
{"Text": "Who ever disliked this video should be ashamed of them selfs", "Label": "neutral", "idx": 614}
{"Text": "seen the way the israelis treat the palestinians? slaughter on a weekly basis, very racist are the israelis to the point of genocide.", "Label": "neutral", "idx": 615}
{"Text": "How does these frikin faggots get a whole month to themselves and veterans that actually do something incredible for us only get a day√∞¬ü¬ò¬§ I hate lgbt", "Label": "hate", "idx": 616}
{"Text": "Ill vote for you if you forbid people that cannot hear to have driver licences. They are clearly threads", "Label": "hate", "idx": 617}
{"Text": "We are repeating our past before it used to Germany and Jews now its China and Muslims", "Label": "neutral", "idx": 618}
{"Text": "Send em home in a metal crate. They're on probation for 20 years. Crime? Straight home. Too many kids? Straight home. Bye.", "Label": "neutral", "idx": 619}
{"Text": "People are genuinely good, we just learned to hate. when Europe was all white and christian they killed each other, the same happened to the Muslim world", "Label": "neutral", "idx": 620}
{"Text": "Anti-LGBT people ,How sad and ignorant...I cant believe it..How how ??? can they not see how STUPID they are?????", "Label": "hate", "idx": 621}
{"Text": "put the speed on 1.5 its so good!", "Label": "neutral", "idx": 622}
{"Text": "Do not kill people.", "Label": "neutral", "idx": 623}
{"Text": "Do people even care about the color of the persons skin or sexuality in a movie?Its just a bloody movie.", "Label": "neutral", "idx": 624}
{"Text": "Islam! Lets beat their feminist ass.", "Label": "hate", "idx": 625}
{"Text": "Islam is the true religion. believe it brothers", "Label": "neutral", "idx": 626}
{"Text": "He is right. Islam is indeed very pissful.", "Label": "hate", "idx": 627}
{"Text": "The Whites Have dislike the documentary because they are mad at  the truth. #WhiteDevils", "Label": "hate", "idx": 628}
{"Text": "This priest is being hated even by his stupid god. ", "Label": "hate", "idx": 629}
{"Text": "She said she is crazy loving her God. Well she is literally crazy then. I can relief her of her life.", "Label": "neutral", "idx": 630}
{"Text": "Jewish terrorist are killing innocent Palastinan who can't defend themselves...", "Label": "hate", "idx": 631}
{"Text": "Delightful!  Brought back some memories . . . .   Have a wonderful week, guys!", "Label": "neutral", "idx": 632}
{"Text": "Now the sea is filled with disgusting dead filth like them. Ruined my Mediterranean vacations", "Label": "neutral", "idx": 633}
{"Text": "You look like you kill bees for fun", "Label": "neutral", "idx": 634}
{"Text": "the girl in glasses is so freaking cute! what'\u0080\u0099s her channel??", "Label": "neutral", "idx": 635}
{"Text": "Sweden is so cool !", "Label": "neutral", "idx": 636}
{"Text": "Society is fucked for sure. And that’s everyone’s fault", "Label": "neutral", "idx": 637}
{"Text": "Every female-dominated job: low skill; minimal education required; not much physical exertion; indoors; tightly controlled hours.", "Label": "hate", "idx": 638}
{"Text": "Racism and nationalism is nothing but ignorance. Hence the hate, and cruelty", "Label": "neutral", "idx": 639}
{"Text": "A gay nigger however, can fake a hate crime for publicity and to help the Democrat Mafia pass an anti lynching bill, and he gets in no trouble.", "Label": "hate", "idx": 640}
{"Text": "Time to nuke China or Unleash a plague.", "Label": "hate", "idx": 641}
{"Text": "White police officers are always the victims.", "Label": "neutral", "idx": 642}
{"Text": "We were taught as kids to not hit ANYONE. When did that go out the window?", "Label": "neutral", "idx": 643}
{"Text": "To say that black lives matter, is not racist statement. But the B.L.M. organization itself is racist group. If they could just quit hating white people and turn that energy towards their own community, the biggest group of black oppressors there is, they might make a difference.", "Label": "neutral", "idx": 644}
{"Text": "I would prefer a phallic world", "Label": "neutral", "idx": 645}
{"Text": "This is considered WHITE in Sweden. No wonder they accepted all those black and muslim immigrants. They are literally color blind.", "Label": "hate", "idx": 646}
{"Text": "I wouldn’t like this girl as a police officer. I want police to keep me safe, she and every other woman cannot keep us safe they are week", "Label": "hate", "idx": 647}
{"Text": "this is why indian subs should only count 0,5", "Label": "hate", "idx": 648}
{"Text": "that song is fucking awesome.", "Label": "neutral", "idx": 649}
{"Text": "Ive had panic attacks due to nothing. Or at least i wouldnt know what wouldve triggered it. My question is, is that normal?", "Label": "neutral", "idx": 650}
{"Text": "Women cannot create children, only men can do that. Women can bear children.", "Label": "neutral", "idx": 651}
{"Text": "The male gene is stronger, as it should be of course. Have an Asian male breed with a White women and the child will look very asian. Reverse it and the child will look mush more whiter", "Label": "hate", "idx": 652}
{"Text": "You look magically retarded.", "Label": "hate", "idx": 653}
{"Text": "Why researchers invest their time on better wheelchairs? Those cunts did not deserve it!", "Label": "hate", "idx": 654}
{"Text": "Most Americans are nazis or kkk members so they elected  Trump.", "Label": "hate", "idx": 655}
{"Text": "She is heavily relying on him to turn the other cheek...tough talking demon infested woman.", "Label": "hate", "idx": 656}
{"Text": "if god hates lgbt members so much than why did he make these people? i mean look at jesus he had 2 dads and he turned out perfectly fine.", "Label": "neutral", "idx": 657}
{"Text": "This documentary is on point. This helped me through class ty boy", "Label": "neutral", "idx": 658}
{"Text": "It’s not “genderless” they just look like GIRLS", "Label": "neutral", "idx": 659}
{"Text": "Ugly white girls and white dudes would not get away with that.", "Label": "hate", "idx": 660}
{"Text": "Gun shot fi gay get all of the guns them out,the police must give we the rights to kill all gays, gun shot at all gays suck your mothers all gays", "Label": "hate", "idx": 661}
{"Text": "Perfect place for Lana- China and Myanmar. No trouble there. They know how to handle those pigs.", "Label": "hate", "idx": 662}
{"Text": "After all this time the african americans are the people with most crime rate", "Label": "hate", "idx": 663}
{"Text": "Islam is a religion of peace.........and we will kill anyone that says otherwise..........in the name of Allah of course!", "Label": "hate", "idx": 664}
{"Text": "Archeological evidence is clear, europeans have always taken care of each other regardless of disability, and we will never stop until there is no more disability! Are we just cool or what, turns out that disabled people take care of us to, and together we are even cooler!", "Label": "neutral", "idx": 665}
{"Text": "He seems like the very talkative taxi driver", "Label": "neutral", "idx": 666}
{"Text": "“The superior race”… but cannot stand in the sun without literally burning the fuck up. Comical.", "Label": "hate", "idx": 667}
{"Text": "Even after just getting out of surgery you look like a bomb ass BITCHHH!! Love you and hope you'¬Ä¬ôre recovering fast!", "Label": "neutral", "idx": 668}
{"Text": "not true in saudia arabia women have freedom", "Label": "neutral", "idx": 669}
{"Text": "I feel uncomfortable when I'm in the same room with an abnormal disabled person", "Label": "hate", "idx": 670}
{"Text": "Die fucking arab dude sand niggas", "Label": "hate", "idx": 671}
{"Text": "Thanks god at least you have music to pale the pain being blind. Oh what you can’t hear too. Haha", "Label": "neutral", "idx": 672}
{"Text": "This is fake u liar bastard. He is ur actor u liar bastard", "Label": "neutral", "idx": 673}
{"Text": "I really wanna be in a public experiment like this myself as I am a trans man. Happy I can at least watch WWYD doing it. Please do more experiments with trans men/ transgender people in general.", "Label": "neutral", "idx": 674}
{"Text": "fuck niggers, they don't need rights. all I want for christmas is a lynched nigger.", "Label": "hate", "idx": 675}
{"Text": "Moving from France to Spain will be a motherfucking big change", "Label": "neutral", "idx": 676}
{"Text": "who gives aa fuck about shit diamonds from the jews fuck them both", "Label": "hate", "idx": 677}
{"Text": "I would pull you over for your race, if I was a cop.", "Label": "hate", "idx": 678}
{"Text": "We'll walk right up to the sun hand in hand..", "Label": "neutral", "idx": 679}
{"Text": "build that wall deport them all", "Label": "hate", "idx": 680}
{"Text": "Europe is land of white people. Don't let africans take over our home. Fuck islam. Fuck multiculturalism.", "Label": "hate", "idx": 681}
{"Text": "The thing is women are not equal to us men and their place is the home and kitchen", "Label": "hate", "idx": 682}
{"Text": "Congratulations. You figured out you were a moron and decided not to be a moron anymore. You'\u0099re a freakin hero.", "Label": "neutral", "idx": 683}
{"Text": "Deport the fucking brainless worthless pieces of shit freeloaders after they are all shot", "Label": "neutral", "idx": 684}
{"Text": "you shoulda let him die", "Label": "hate", "idx": 685}
{"Text": "You look like Russian and speak like Indian. Both are disgusting go kill yourself", "Label": "hate", "idx": 686}
{"Text": "If white people are gone from this earth, we will go directly back to stone age. Not even kidding", "Label": "neutral", "idx": 687}
{"Text": "Bottles are beautiful on the inside and out", "Label": "neutral", "idx": 688}
{"Text": "I get out the closet this weekend to some friends...", "Label": "neutral", "idx": 689}
{"Text": "What if we send every men to mars to start a new life there! They are useless here (Of course milk them first to store their juices)", "Label": "hate", "idx": 690}
{"Text": "Humans with third leg I hope to distinct soon, with much love", "Label": "hate", "idx": 691}
{"Text": "I like big thick bitches to serve me my cocktail. They are good only for such things", "Label": "hate", "idx": 692}
{"Text": "Is there still a Job like this I would like to take it. Thats not a Joke!", "Label": "neutral", "idx": 693}
{"Text": "I don’t like jew soap, but if we are to get rid of him well I will live it through", "Label": "hate", "idx": 694}
{"Text": "It doesn'\u0099t matter if you'\u0099re black or white, gay or straight, woman or man, trance,  disabled, Dyslexic or intelligent we all are people.  Quality!", "Label": "neutral", "idx": 695}
{"Text": "Disability centres all around the world. That’s were our money goes. Let’s take em down", "Label": "hate", "idx": 696}
{"Text": " Oh and NIki pronounced mademoiselle Maupin way better than Siri did.\"", "Label": "neutral", "idx": 697}
{"Text": "jon snow the king in the north thank you for uploading this i have one small complaint he is only talking about deporting illegal immigrants not immigrants in general your title might mislead the less informed", "Label": "neutral", "idx": 698}
{"Text": "Hindus take my ass please", "Label": "hate", "idx": 699}
{"Text": "I'd get my money back if I were you. Your sex change was a complete failure.", "Label": "hate", "idx": 700}
{"Text": "If I had Down syndrome I would kill myself", "Label": "hate", "idx": 701}
{"Text": "Stupid ugly asian tan ass snitch", "Label": "hate", "idx": 702}
{"Text": "Next on your list, pierce your face with a katana.", "Label": "neutral", "idx": 703}
{"Text": "Autists is why presidents like trump are getting elected", "Label": "hate", "idx": 704}
{"Text": "God bless you dears", "Label": "neutral", "idx": 705}
{"Text": "men and women are not equal.  irrational contrary belief and policy only result in mounting failure.", "Label": "neutral", "idx": 706}
{"Text": "I got my first one today on my bday. I smoked too much weed. I thought I was going to die. Scariest shit ever. This is definitely useful so thank you.", "Label": "neutral", "idx": 707}
{"Text": "Well my religion isn’t as satanic as yours at least", "Label": "hate", "idx": 708}
{"Text": "My parents are homophobes. :(", "Label": "neutral", "idx": 709}
{"Text": "Grow some fucking balls and take back your country, bongs. Start killing reporters, politicians, and Asians.", "Label": "hate", "idx": 710}
{"Text": "This sick, disgusting, white terrorist/fascist killed more than 50 innocent people.", "Label": "hate", "idx": 711}
{"Text": "So how long have you lived in your mother's basement?", "Label": "neutral", "idx": 712}
{"Text": "Should have been sterilised upon arrival. Now your future doesn't exist.", "Label": "neutral", "idx": 713}
{"Text": "Lauren is SAVAGE. love her", "Label": "neutral", "idx": 714}
{"Text": "I can totally relate to this and it actually hurts, I'm also biracial white and afro-american", "Label": "neutral", "idx": 715}
{"Text": "That guys chin strap bothers me man....idk why.", "Label": "neutral", "idx": 716}
{"Text": "The girl in the dress reminds me of opal from bird box", "Label": "neutral", "idx": 717}
{"Text": "If it takes you a year of interviewing to come to these very basic conclusions how brain washed do you have to be. Damn.", "Label": "neutral", "idx": 718}
{"Text": "U r still so beautiful and I am still watching you babe   Chat with you later my dear and lookin at you rock my world.  Just saying babe", "Label": "neutral", "idx": 719}
{"Text": "Stupid feminists. For FUCK sake! Just....Just....fucking kill yourself.", "Label": "hate", "idx": 720}
{"Text": "Those black people are fucking pale", "Label": "hate", "idx": 721}
{"Text": "She the one being tense", "Label": "neutral", "idx": 722}
{"Text": "I hate mentally disabled people trying to touch my kids.", "Label": "hate", "idx": 723}
{"Text": "I honestly hate China. U can disagree but after This I cant. Its a horrible place and Its horrible people", "Label": "hate", "idx": 724}
{"Text": "he did the US a great service of killing them and stopping a crime wave and welfare leaches.  to bad he didnt have more of them in the truck. ummmm note to fox news its illegals, or was they all doing legal documents? or did i get something wrong. nope. they was illegals", "Label": "hate", "idx": 725}
{"Text": "Fuck off corbyn... Die or retire..", "Label": "neutral", "idx": 726}
{"Text": "FUCK GAYS disgusting", "Label": "hate", "idx": 727}
{"Text": "he may be in a wheelchair but he's not at all bad looking! forget the trolls dude", "Label": "neutral", "idx": 728}
{"Text": "that girl who pushed her needs to pay personally for all the family's medical bills lol. only fair", "Label": "neutral", "idx": 729}
{"Text": "Can I get a shoutout pleaseeeeee I only have a little bit of people :(", "Label": "neutral", "idx": 730}
{"Text": "I don't know but I don't trust  this guy's... It's all about the money... Plss let the dead in their world stop making shows...with his death..couse u didn't have ballssss when he was alive...", "Label": "neutral", "idx": 731}
{"Text": "the fat bitches are annoying as hell", "Label": "hate", "idx": 732}
{"Text": "You are fat and ugly. I suppose that makes you fugly :)", "Label": "neutral", "idx": 733}
{"Text": "Buddhism is a religion for cows. People who believe this shit they get chopped sooner or later", "Label": "hate", "idx": 734}
{"Text": "I think black and white are just labels. People can live together in piece despite colour dismatch", "Label": "neutral", "idx": 735}
{"Text": "These kind of fake photos of blacks pisses me off. Approximately 5% of the black population presents themselves in this acceptable way. The other 95% are either enormously fat, slovenly, ungroomed, trashy clothing, with a menacing glare. These are white people in blackface.", "Label": "hate", "idx": 736}
{"Text": "people have rights to follow there own religion, if they try to force people not the following there religion then that country running a dictatorship, hopefully soon there will be change in low by the international pressure,", "Label": "neutral", "idx": 737}
{"Text": "Is this world filled by those stupid female bitches?", "Label": "hate", "idx": 738}
{"Text": "Why don't they have their own games?", "Label": "neutral", "idx": 739}
{"Text": "Wow this voice and reading is the best thing in my life!!!!", "Label": "neutral", "idx": 740}
{"Text": "I thought that a big reason why it had to be africans, is their skin. It's an obvious marker to tell if someone is a slave. And even if they run, they're still black.", "Label": "hate", "idx": 741}
{"Text": "Honestly, go fuck yourself! bitch!", "Label": "hate", "idx": 742}
{"Text": "Just kidding but I know how It feels", "Label": "neutral", "idx": 743}
{"Text": "I love bi girls and lesbians", "Label": "neutral", "idx": 744}
{"Text": "Fucking good punch dude", "Label": "neutral", "idx": 745}
{"Text": "Down syndrome? Problematic people must be dead", "Label": "hate", "idx": 746}
{"Text": "She'\u0080\u0099s a really courageous woman! She is one of the most impressive women I'\u0080\u0099ve ever listened to. I appreciate  her film, and I certainly wish her continued success and happiness. She is definitely a cut above both as a filmmaker, and most especially, as a person! She is an incrediblely remarkable woman!", "Label": "neutral", "idx": 747}
{"Text": "if they hide in the engine they would get killedthat is a stupid way they can smuggle into another country", "Label": "neutral", "idx": 748}
{"Text": "Teaching my kids transgenders are anything but mentally ill will get you set on fire.", "Label": "hate", "idx": 749}
{"Text": "Only black lives matter. fuck white people the cancer of the earth", "Label": "hate", "idx": 750}
{"Text": "anyone else get full body numbness that lasts for weeks and rapid muscle spasms and 'shock' feelings when trying to sleep at night? I can only sleep once every 48 hours :(", "Label": "neutral", "idx": 751}
{"Text": "I don’t like this gender at all. I definitely wouldn’t hire any male bitch at ma shop", "Label": "hate", "idx": 752}
{"Text": "Lady Gaga is the Freddie Mercury of our generation", "Label": "neutral", "idx": 753}
{"Text": "Watching this kid trying to step up and walk with that crutches is the best thing in the world. So idiot", "Label": "hate", "idx": 754}
{"Text": "Finally someone who means what he says. It'\u0099s been a year and I'\u0099m still cackling.", "Label": "neutral", "idx": 755}
{"Text": "This is just crazy liberal satanic crap. Don't fall for it. There are only two genders and these people are just cofused psychos", "Label": "hate", "idx": 756}
{"Text": "Trumps a liar and an idiot, a douche bag , Narcissist, and Zionist boot licker.", "Label": "neutral", "idx": 757}
{"Text": "Did you use the ‚ÄúTan‚Äù or ‚ÄúDark‚Äù filter?", "Label": "neutral", "idx": 758}
{"Text": "A solution to the U.S. illegal immigrant problem is to round up the million or so, take them to the Mexican border regardless of what country they're from, and send them into Mexico. Maybe then when the Mexican border is over-run with immigrants will Mexico understand and help pay for a wall.", "Label": "hate", "idx": 759}
{"Text": "that is the most beautiful right hook ive seen. what a hero!", "Label": "neutral", "idx": 760}
{"Text": "Terrorists are not Muslims They are just using name of islam", "Label": "neutral", "idx": 761}
{"Text": "Well France is finally a shithole This is what happens when you do open borders now both sides are suffering", "Label": "hate", "idx": 762}
{"Text": "only people to come in must be able to contribute to society not a drain on us must be able to support themselves with a trade we do not need people living off the rest of us", "Label": "neutral", "idx": 763}
{"Text": "France let them refugees in and this what happened fucking animals", "Label": "hate", "idx": 764}
{"Text": "Women are equally as strong as men.    They should be able to defend themselves.", "Label": "neutral", "idx": 765}
{"Text": "Every publicity is good publicity ha ? I'\u0099m here after watching leaving neverland i don'\u0099t know he is guilty or not but in music he is a legend and no one can take that from him", "Label": "neutral", "idx": 766}
{"Text": "I feel so dumb I want to have even labeled them as disabled even if I knew them.... when I think of disabilities and especially in terms of affecting one'\u0080\u0099s relationship I think of more like mental disabilities or so serious that you can'\u0080\u0099t use ur body. Thank you for enlightening me and I'\u0080\u0099m sorry.", "Label": "neutral", "idx": 767}
{"Text": "Easter is the most silly holiday ever existed. It must be stopped. Shame shame shame", "Label": "hate", "idx": 768}
{"Text": "If you had a Winnie, even tinnie, and flat chest I would hire you miss. Now no way.", "Label": "neutral", "idx": 769}
{"Text": "Im lesbian and proud im happy my friends accept me but i dont know if my family does but i dont care what anyone says im proud to be a lesbian", "Label": "neutral", "idx": 770}
{"Text": "Fuck him and his prophet", "Label": "neutral", "idx": 771}
{"Text": "You look like someone who would do an electric wheelchair race with Stephen Hawking.", "Label": "neutral", "idx": 772}
{"Text": "I bet they had jobs.", "Label": "neutral", "idx": 773}
